Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
//////////////////////////////////////////////////////////////////////////////////////
// File: MKL05Z32LF4.h
// Purpose: Define the peripheral registers.
// This file has been automatically generated from the APIF knowledgebase
//
// Revisions:
// - rev. 1.0 (2011-06-01)
//     Initial public version.
// - rev. 1.1 (2012-03-13)
//     Bit/group constants related to 32-bit registers typecasted to uint32_t.
//
//////////////////////////////////////////////////////////////////////////////////////
#include <stdint.h>
//
//////////////////////////////////////////////////////////////////////////////////////
// Generic Bit Definitions Used Elsewhere in this File
//
// Peripheral Base Address Defines in Alphabetical Order
//
#define  ADC0_BASE_PTR               ((uint8_t *) (0x4003B000u))

#define  CMP0_BASE_PTR               ((uint8_t *) (0x40073000u))

#define  DAC_BASE_PTR                ((uint8_t *) (0x4003F000u))

#define  DMA_BASE_PTR                ((uint8_t *) (0x40008000u))

#define  DMAMUX0_BASE_PTR            ((uint8_t *) (0x40021000u))

#define  FTFA_BASE_PTR               ((uint8_t *) (0x40020000u))

#define  GPIOA_BASE_PTR              ((uint8_t *) (0x400FF000u))

#define  GPIOB_BASE_PTR              ((uint8_t *) (0x400FF040u))

#define  I2C0_BASE_PTR               ((uint8_t *) (0x40066000u))

#define  LLWU_BASE_PTR               ((uint8_t *) (0x4007C000u))

#define  LPSCI0_BASE_PTR             ((uint8_t *) (0x4006A000u))

#define  LPTMR0_BASE_PTR             ((uint32_t *) (0x40040000u))

#define  LPTPM0_BASE_PTR             ((uint32_t *) (0x40038000u))

#define  LPTPM1_BASE_PTR             ((uint32_t *) (0x40039000u))

#define  MCG_BASE_PTR                ((uint8_t *) (0x40064000u))

#define  OSC0_BASE_PTR               ((uint8_t *) (0x40065000u))

#define  PIT_BASE_PTR                ((uint32_t *) (0x40037000u))

#define  PMC_BASE_PTR                ((uint8_t *) (0x4007D000u))

#define  PORTA_BASE_PTR              ((uint8_t *) (0x40049000u))

#define  PORTB_BASE_PTR              ((uint8_t *) (0x4004A000u))

#define  RCM_BASE_PTR                ((uint8_t *) (0x4007F000u))

#define  RTC_BASE_PTR                ((uint8_t *) (0x4003D000u))

#define  SIM_BASE_PTR                ((uint8_t *) (0x40047000u))

#define  SMC_BASE_PTR                ((uint8_t *) (0x4007E000u))

#define  SPI0_BASE_PTR               ((uint8_t *) (0x40076000u))

#define  TSI0_BASE_PTR               ((uint8_t *) (0x40045000u))


//////////////////////////////////////////////////////////////////////////////////////
// The following section defines the IO register locations.
//////////////////////////////////////////////////////////////////////////////////////

#define  ADC0_SC1A                   (*(uint32_t *) (0x4003B000))

#define  ADC0_SC1B                   (*(uint32_t *) (0x4003B004))

#define  ADC0_CFG1                   (*(uint32_t *) (0x4003B008))

#define  ADC0_CFG2                   (*(uint32_t *) (0x4003B00C))

#define  ADC0_RA                     (*(uint32_t *) (0x4003B010))

#define  ADC0_RB                     (*(uint32_t *) (0x4003B014))

#define  ADC0_CV1                    (*(uint32_t *) (0x4003B018))

#define  ADC0_CV2                    (*(uint32_t *) (0x4003B01C))

#define  ADC0_SC2                    (*(uint32_t *) (0x4003B020))

#define  ADC0_SC3                    (*(uint32_t *) (0x4003B024))

#define  ADC0_OFS                    (*(uint32_t *) (0x4003B028))

#define  ADC0_PG                     (*(uint32_t *) (0x4003B02C))

#define  ADC0_CLPD                   (*(uint32_t *) (0x4003B034))

#define  ADC0_CLPS                   (*(uint32_t *) (0x4003B038))

#define  ADC0_CLP4                   (*(uint32_t *) (0x4003B03C))

#define  ADC0_CLP3                   (*(uint32_t *) (0x4003B040))

#define  ADC0_CLP2                   (*(uint32_t *) (0x4003B044))

#define  ADC0_CLP1                   (*(uint32_t *) (0x4003B048))

#define  ADC0_CLP0                   (*(uint32_t *) (0x4003B04C))

#define  CMP0_CR0                    (*(uint8_t *) (0x40073000))

#define  CMP0_CR1                    (*(uint8_t *) (0x40073001))

#define  CMP0_FPR                    (*(uint8_t *) (0x40073002))

#define  CMP0_SCR                    (*(uint8_t *) (0x40073003))

#define  CMP0_DACCR                  (*(uint8_t *) (0x40073004))

#define  CMP0_MUXCR                  (*(uint8_t *) (0x40073005))

#define  DAC_DAT0L                   (*(uint8_t *) (0x4003F000))

#define  DAC_DAT0H                   (*(uint8_t *) (0x4003F001))

#define  DAC_DAT1L                   (*(uint8_t *) (0x4003F002))

#define  DAC_DAT1H                   (*(uint8_t *) (0x4003F003))

#define  DAC_DAT2L                   (*(uint8_t *) (0x4003F004))

#define  DAC_DAT2H                   (*(uint8_t *) (0x4003F005))

#define  DAC_DAT3L                   (*(uint8_t *) (0x4003F006))

#define  DAC_DAT3H                   (*(uint8_t *) (0x4003F007))

#define  DAC_DAT4L                   (*(uint8_t *) (0x4003F008))

#define  DAC_DAT4H                   (*(uint8_t *) (0x4003F009))

#define  DAC_DAT5L                   (*(uint8_t *) (0x4003F00A))

#define  DAC_DAT5H                   (*(uint8_t *) (0x4003F00B))

#define  DAC_DAT6L                   (*(uint8_t *) (0x4003F00C))

#define  DAC_DAT6H                   (*(uint8_t *) (0x4003F00D))

#define  DAC_DAT7L                   (*(uint8_t *) (0x4003F00E))

#define  DAC_DAT7H                   (*(uint8_t *) (0x4003F00F))

#define  DAC_DAT8L                   (*(uint8_t *) (0x4003F010))

#define  DAC_DAT8H                   (*(uint8_t *) (0x4003F011))

#define  DAC_DAT9L                   (*(uint8_t *) (0x4003F012))

#define  DAC_DAT9H                   (*(uint8_t *) (0x4003F013))

#define  DAC_DAT10L                  (*(uint8_t *) (0x4003F014))

#define  DAC_DAT10H                  (*(uint8_t *) (0x4003F015))

#define  DAC_DAT11L                  (*(uint8_t *) (0x4003F016))

#define  DAC_DAT11H                  (*(uint8_t *) (0x4003F017))

#define  DAC_DAT12L                  (*(uint8_t *) (0x4003F018))

#define  DAC_DAT12H                  (*(uint8_t *) (0x4003F019))

#define  DAC_DAT13L                  (*(uint8_t *) (0x4003F01A))

#define  DAC_DAT13H                  (*(uint8_t *) (0x4003F01B))

#define  DAC_DAT14L                  (*(uint8_t *) (0x4003F01C))

#define  DAC_DAT14H                  (*(uint8_t *) (0x4003F01D))

#define  DAC_DAT15L                  (*(uint8_t *) (0x4003F01E))

#define  DAC_DAT15H                  (*(uint8_t *) (0x4003F01F))

#define  DAC_SR                      (*(uint8_t *) (0x4003F020))

#define  DAC_C0                      (*(uint8_t *) (0x4003F021))

#define  DAC_C1                      (*(uint8_t *) (0x4003F022))

#define  DAC_C2                      (*(uint8_t *) (0x4003F023))

#define  DMA_SAR0                    (*(uint32_t *) (0x40008100))

#define  DMA_DAR0                    (*(uint32_t *) (0x40008104))

#define  DMA_DSR_BCR0                (*(uint32_t *) (0x40008108))

#define  DMA_DCR0                    (*(uint32_t *) (0x4000810C))

