Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  DMA_SAR1                    (*(uint32_t *) (0x40008110))

#define  DMA_DAR1                    (*(uint32_t *) (0x40008114))

#define  DMA_DSR_BCR1                (*(uint32_t *) (0x40008118))

#define  DMA_DCR1                    (*(uint32_t *) (0x4000811C))

#define  DMA_SAR2                    (*(uint32_t *) (0x40008120))

#define  DMA_DAR2                    (*(uint32_t *) (0x40008124))

#define  DMA_DSR_BCR2                (*(uint32_t *) (0x40008128))

#define  DMA_DCR2                    (*(uint32_t *) (0x4000812C))

#define  DMA_SAR3                    (*(uint32_t *) (0x40008130))

#define  DMA_DAR3                    (*(uint32_t *) (0x40008134))

#define  DMA_DSR_BCR3                (*(uint32_t *) (0x40008138))

#define  DMA_DCR3                    (*(uint32_t *) (0x4000813C))

#define  DMAMUX0_CHCFG0              (*(uint8_t *) (0x40021000))

#define  DMAMUX0_CHCFG1              (*(uint8_t *) (0x40021001))

#define  DMAMUX0_CHCFG2              (*(uint8_t *) (0x40021002))

#define  DMAMUX0_CHCFG3              (*(uint8_t *) (0x40021003))

#define  DMAMUX0_CHCFG4              (*(uint8_t *) (0x40021004))

#define  DMAMUX0_CHCFG5              (*(uint8_t *) (0x40021005))

#define  DMAMUX0_CHCFG6              (*(uint8_t *) (0x40021006))

#define  DMAMUX0_CHCFG7              (*(uint8_t *) (0x40021007))

#define  DMAMUX0_CHCFG8              (*(uint8_t *) (0x40021008))

#define  DMAMUX0_CHCFG9              (*(uint8_t *) (0x40021009))

#define  DMAMUX0_CHCFG10             (*(uint8_t *) (0x4002100A))

#define  DMAMUX0_CHCFG11             (*(uint8_t *) (0x4002100B))

#define  DMAMUX0_CHCFG12             (*(uint8_t *) (0x4002100C))

#define  DMAMUX0_CHCFG13             (*(uint8_t *) (0x4002100D))

#define  DMAMUX0_CHCFG14             (*(uint8_t *) (0x4002100E))

#define  DMAMUX0_CHCFG15             (*(uint8_t *) (0x4002100F))

#define  FTFA_FSTAT                  (*(uint8_t *) (0x40020000))

#define  FTFA_FCNFG                  (*(uint8_t *) (0x40020001))

#define  FTFA_FSEC                   (*(uint8_t *) (0x40020002))

#define  FTFA_FOPT                   (*(uint8_t *) (0x40020003))

#define  FTFA_FCCOB3                 (*(uint8_t *) (0x40020004))

#define  FTFA_FCCOB2                 (*(uint8_t *) (0x40020005))

#define  FTFA_FCCOB1                 (*(uint8_t *) (0x40020006))

#define  FTFA_FCCOB0                 (*(uint8_t *) (0x40020007))

#define  FTFA_FCCOB7                 (*(uint8_t *) (0x40020008))

#define  FTFA_FCCOB6                 (*(uint8_t *) (0x40020009))

#define  FTFA_FCCOB5                 (*(uint8_t *) (0x4002000A))

#define  FTFA_FCCOB4                 (*(uint8_t *) (0x4002000B))

#define  FTFA_FCCOBB                 (*(uint8_t *) (0x4002000C))

#define  FTFA_FCCOBA                 (*(uint8_t *) (0x4002000D))

#define  FTFA_FCCOB9                 (*(uint8_t *) (0x4002000E))

#define  FTFA_FCCOB8                 (*(uint8_t *) (0x4002000F))

#define  FTFA_FPROT3                 (*(uint8_t *) (0x40020010))

#define  FTFA_FPROT2                 (*(uint8_t *) (0x40020011))

#define  FTFA_FPROT1                 (*(uint8_t *) (0x40020012))

#define  FTFA_FPROT0                 (*(uint8_t *) (0x40020013))

#define  GPIOA_PDOR                  (*(uint32_t *) (0x400FF000))

#define  GPIOA_PSOR                  (*(uint32_t *) (0x400FF004))

#define  GPIOA_PCOR                  (*(uint32_t *) (0x400FF008))

#define  GPIOA_PTOR                  (*(uint32_t *) (0x400FF00C))

#define  GPIOA_PDIR                  (*(uint32_t *) (0x400FF010))

#define  GPIOA_PDDR                  (*(uint32_t *) (0x400FF014))

#define  GPIOB_PDOR                  (*(uint32_t *) (0x400FF040))

#define  GPIOB_PSOR                  (*(uint32_t *) (0x400FF044))

#define  GPIOB_PCOR                  (*(uint32_t *) (0x400FF048))

#define  GPIOB_PTOR                  (*(uint32_t *) (0x400FF04C))

#define  GPIOB_PDIR                  (*(uint32_t *) (0x400FF050))

#define  GPIOB_PDDR                  (*(uint32_t *) (0x400FF054))

#define  I2C0_A1                     (*(uint8_t *) (0x40066000))

#define  I2C0_F                      (*(uint8_t *) (0x40066001))

#define  I2C0_C1                     (*(uint8_t *) (0x40066002))

#define  I2C0_S                      (*(uint8_t *) (0x40066003))

#define  I2C0_D                      (*(uint8_t *) (0x40066004))

#define  I2C0_C2                     (*(uint8_t *) (0x40066005))

#define  I2C0_FLT                    (*(uint8_t *) (0x40066006))

#define  I2C0_RA                     (*(uint8_t *) (0x40066007))

#define  I2C0_SMB                    (*(uint8_t *) (0x40066008))

#define  I2C0_A2                     (*(uint8_t *) (0x40066009))

#define  I2C0_SLTH                   (*(uint8_t *) (0x4006600A))

#define  I2C0_SLTL                   (*(uint8_t *) (0x4006600B))

#define  LLWU_PE1                    (*(uint8_t *) (0x4007C000))

#define  LLWU_PE2                    (*(uint8_t *) (0x4007C001))

#define  LLWU_PE3                    (*(uint8_t *) (0x4007C002))

#define  LLWU_PE4                    (*(uint8_t *) (0x4007C003))

#define  LLWU_ME                     (*(uint8_t *) (0x4007C004))

#define  LLWU_F1                     (*(uint8_t *) (0x4007C005))

#define  LLWU_F2                     (*(uint8_t *) (0x4007C006))

#define  LLWU_F3                     (*(uint8_t *) (0x4007C007))

#define  LLWU_FILT1                  (*(uint8_t *) (0x4007C008))

#define  LLWU_FILT2                  (*(uint8_t *) (0x4007C009))

#define  LPSCI0_BDH                  (*(uint8_t *) (0x4006A000))

#define  LPSCI0_BDL                  (*(uint8_t *) (0x4006A001))

#define  LPSCI0_C1                   (*(uint8_t *) (0x4006A002))

#define  LPSCI0_C2                   (*(uint8_t *) (0x4006A003))

#define  LPSCI0_S1                   (*(uint8_t *) (0x4006A004))

#define  LPSCI0_S2                   (*(uint8_t *) (0x4006A005))

#define  LPSCI0_C3                   (*(uint8_t *) (0x4006A006))

#define  LPSCI0_D                    (*(uint8_t *) (0x4006A007))

#define  LPSCI0_MA1                  (*(uint8_t *) (0x4006A008))

#define  LPSCI0_MA2                  (*(uint8_t *) (0x4006A009))

#define  LPSCI0_C4                   (*(uint8_t *) (0x4006A00A))

#define  LPSCI0_C5                   (*(uint8_t *) (0x4006A00B))

#define  LPTMR0_CSR                  (*(uint32_t *) (0x40040000))

#define  LPTMR0_PSR                  (*(uint32_t *) (0x40040004))

#define  LPTMR0_CMR                  (*(uint32_t *) (0x40040008))

