Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  LPTMR0_CNR                  (*(uint32_t *) (0x4004000C))

#define  LPTPM0_SC                   (*(uint32_t *) (0x40038000))

#define  LPTPM0_CNT                  (*(uint32_t *) (0x40038004))

#define  LPTPM0_MOD                  (*(uint32_t *) (0x40038008))

#define  LPTPM0_C0SC                 (*(uint32_t *) (0x4003800C))

#define  LPTPM0_C0V                  (*(uint32_t *) (0x40038010))

#define  LPTPM0_C1SC                 (*(uint32_t *) (0x40038014))

#define  LPTPM0_C1V                  (*(uint32_t *) (0x40038018))

#define  LPTPM0_C2SC                 (*(uint32_t *) (0x4003801C))

#define  LPTPM0_C2V                  (*(uint32_t *) (0x40038020))

#define  LPTPM0_C3SC                 (*(uint32_t *) (0x40038024))

#define  LPTPM0_C3V                  (*(uint32_t *) (0x40038028))

#define  LPTPM0_C4SC                 (*(uint32_t *) (0x4003802C))

#define  LPTPM0_C4V                  (*(uint32_t *) (0x40038030))

#define  LPTPM0_C5SC                 (*(uint32_t *) (0x40038034))

#define  LPTPM0_C5V                  (*(uint32_t *) (0x40038038))

#define  LPTPM0_STATUS               (*(uint32_t *) (0x40038050))

#define  LPTPM0_CONF                 (*(uint32_t *) (0x40038084))

#define  LPTPM1_SC                   (*(uint32_t *) (0x40039000))

#define  LPTPM1_CNT                  (*(uint32_t *) (0x40039004))

#define  LPTPM1_MOD                  (*(uint32_t *) (0x40039008))

#define  LPTPM1_C0SC                 (*(uint32_t *) (0x4003900C))

#define  LPTPM1_C0V                  (*(uint32_t *) (0x40039010))

#define  LPTPM1_C1SC                 (*(uint32_t *) (0x40039014))

#define  LPTPM1_C1V                  (*(uint32_t *) (0x40039018))

#define  LPTPM1_C2SC                 (*(uint32_t *) (0x4003901C))

#define  LPTPM1_C2V                  (*(uint32_t *) (0x40039020))

#define  LPTPM1_C3SC                 (*(uint32_t *) (0x40039024))

#define  LPTPM1_C3V                  (*(uint32_t *) (0x40039028))

#define  LPTPM1_C4SC                 (*(uint32_t *) (0x4003902C))

#define  LPTPM1_C4V                  (*(uint32_t *) (0x40039030))

#define  LPTPM1_C5SC                 (*(uint32_t *) (0x40039034))

#define  LPTPM1_C5V                  (*(uint32_t *) (0x40039038))

#define  LPTPM1_STATUS               (*(uint32_t *) (0x40039050))

#define  LPTPM1_CONF                 (*(uint32_t *) (0x40039084))

#define  MCG_C1                      (*(uint8_t *) (0x40064000))

#define  MCG_C2                      (*(uint8_t *) (0x40064001))

#define  MCG_C3                      (*(uint8_t *) (0x40064002))

#define  MCG_C4                      (*(uint8_t *) (0x40064003))

#define  MCG_C5                      (*(uint8_t *) (0x40064004))

#define  MCG_C6                      (*(uint8_t *) (0x40064005))

#define  MCG_S                       (*(uint8_t *) (0x40064006))

#define  MCG_SC                      (*(uint8_t *) (0x40064008))

#define  MCG_ATCVH                   (*(uint8_t *) (0x4006400A))

#define  MCG_ATCVL                   (*(uint8_t *) (0x4006400B))

#define  MCG_C7                      (*(uint8_t *) (0x4006400C))

#define  MCG_C8                      (*(uint8_t *) (0x4006400D))

#define  OSC0_CR                     (*(uint8_t *) (0x40065000))

#define  PIT_MCR                     (*(uint32_t *) (0x40037000))

#define  PIT_LTMR64H                 (*(uint32_t *) (0x400370E0))

#define  PIT_LTMR64L                 (*(uint32_t *) (0x400370E4))

#define  PIT_LDVAL0                  (*(uint32_t *) (0x40037100))

#define  PIT_CVAL0                   (*(uint32_t *) (0x40037104))

#define  PIT_TCTRL0                  (*(uint32_t *) (0x40037108))

#define  PIT_TFLG0                   (*(uint32_t *) (0x4003710C))

#define  PIT_LDVAL1                  (*(uint32_t *) (0x40037110))

#define  PIT_CVAL1                   (*(uint32_t *) (0x40037114))

#define  PIT_TCTRL1                  (*(uint32_t *) (0x40037118))

#define  PIT_TFLG1                   (*(uint32_t *) (0x4003711C))

#define  PIT_LDVAL2                  (*(uint32_t *) (0x40037120))

#define  PIT_CVAL2                   (*(uint32_t *) (0x40037124))

#define  PIT_TCTRL2                  (*(uint32_t *) (0x40037128))

#define  PIT_TFLG2                   (*(uint32_t *) (0x4003712C))

#define  PIT_LDVAL3                  (*(uint32_t *) (0x40037130))

#define  PIT_CVAL3                   (*(uint32_t *) (0x40037134))

#define  PIT_TCTRL3                  (*(uint32_t *) (0x40037138))

#define  PIT_TFLG3                   (*(uint32_t *) (0x4003713C))

#define  PMC_LVDSC1                  (*(uint8_t *) (0x4007D000))

#define  PMC_LVDSC2                  (*(uint8_t *) (0x4007D001))

#define  PMC_REGSC                   (*(uint8_t *) (0x4007D002))

#define  PORTA_PCR0                  (*(uint32_t *) (0x40049000))

#define  PORTA_PCR1                  (*(uint32_t *) (0x40049004))

#define  PORTA_PCR2                  (*(uint32_t *) (0x40049008))

#define  PORTA_PCR3                  (*(uint32_t *) (0x4004900C))

#define  PORTA_PCR4                  (*(uint32_t *) (0x40049010))

#define  PORTA_PCR5                  (*(uint32_t *) (0x40049014))

#define  PORTA_PCR6                  (*(uint32_t *) (0x40049018))

#define  PORTA_PCR7                  (*(uint32_t *) (0x4004901C))

#define  PORTA_PCR8                  (*(uint32_t *) (0x40049020))

#define  PORTA_PCR9                  (*(uint32_t *) (0x40049024))

#define  PORTA_PCR10                 (*(uint32_t *) (0x40049028))

#define  PORTA_PCR11                 (*(uint32_t *) (0x4004902C))

#define  PORTA_PCR12                 (*(uint32_t *) (0x40049030))

#define  PORTA_PCR13                 (*(uint32_t *) (0x40049034))

#define  PORTA_PCR14                 (*(uint32_t *) (0x40049038))

#define  PORTA_PCR15                 (*(uint32_t *) (0x4004903C))

#define  PORTA_PCR16                 (*(uint32_t *) (0x40049040))

#define  PORTA_PCR17                 (*(uint32_t *) (0x40049044))

#define  PORTA_PCR18                 (*(uint32_t *) (0x40049048))

#define  PORTA_PCR19                 (*(uint32_t *) (0x4004904C))

#define  PORTA_PCR20                 (*(uint32_t *) (0x40049050))

#define  PORTA_PCR21                 (*(uint32_t *) (0x40049054))

