Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  PORTA_PCR22                 (*(uint32_t *) (0x40049058))

#define  PORTA_PCR23                 (*(uint32_t *) (0x4004905C))

#define  PORTA_PCR24                 (*(uint32_t *) (0x40049060))

#define  PORTA_PCR25                 (*(uint32_t *) (0x40049064))

#define  PORTA_PCR26                 (*(uint32_t *) (0x40049068))

#define  PORTA_PCR27                 (*(uint32_t *) (0x4004906C))

#define  PORTA_PCR28                 (*(uint32_t *) (0x40049070))

#define  PORTA_PCR29                 (*(uint32_t *) (0x40049074))

#define  PORTA_PCR30                 (*(uint32_t *) (0x40049078))

#define  PORTA_PCR31                 (*(uint32_t *) (0x4004907C))

#define  PORTA_GPCLR                 (*(uint32_t *) (0x40049080))

#define  PORTA_GPCHR                 (*(uint32_t *) (0x40049084))

#define  PORTA_ISFR                  (*(uint32_t *) (0x400490A0))

#define  PORTB_PCR0                  (*(uint32_t *) (0x4004A000))

#define  PORTB_PCR1                  (*(uint32_t *) (0x4004A004))

#define  PORTB_PCR2                  (*(uint32_t *) (0x4004A008))

#define  PORTB_PCR3                  (*(uint32_t *) (0x4004A00C))

#define  PORTB_PCR4                  (*(uint32_t *) (0x4004A010))

#define  PORTB_PCR5                  (*(uint32_t *) (0x4004A014))

#define  PORTB_PCR6                  (*(uint32_t *) (0x4004A018))

#define  PORTB_PCR7                  (*(uint32_t *) (0x4004A01C))

#define  PORTB_PCR8                  (*(uint32_t *) (0x4004A020))

#define  PORTB_PCR9                  (*(uint32_t *) (0x4004A024))

#define  PORTB_PCR10                 (*(uint32_t *) (0x4004A028))

#define  PORTB_PCR11                 (*(uint32_t *) (0x4004A02C))

#define  PORTB_PCR12                 (*(uint32_t *) (0x4004A030))

#define  PORTB_PCR13                 (*(uint32_t *) (0x4004A034))

#define  PORTB_PCR14                 (*(uint32_t *) (0x4004A038))

#define  PORTB_PCR15                 (*(uint32_t *) (0x4004A03C))

#define  PORTB_PCR16                 (*(uint32_t *) (0x4004A040))

#define  PORTB_PCR17                 (*(uint32_t *) (0x4004A044))

#define  PORTB_PCR18                 (*(uint32_t *) (0x4004A048))

#define  PORTB_PCR19                 (*(uint32_t *) (0x4004A04C))

#define  PORTB_PCR20                 (*(uint32_t *) (0x4004A050))

#define  PORTB_PCR21                 (*(uint32_t *) (0x4004A054))

#define  PORTB_PCR22                 (*(uint32_t *) (0x4004A058))

#define  PORTB_PCR23                 (*(uint32_t *) (0x4004A05C))

#define  PORTB_PCR24                 (*(uint32_t *) (0x4004A060))

#define  PORTB_PCR25                 (*(uint32_t *) (0x4004A064))

#define  PORTB_PCR26                 (*(uint32_t *) (0x4004A068))

#define  PORTB_PCR27                 (*(uint32_t *) (0x4004A06C))

#define  PORTB_PCR28                 (*(uint32_t *) (0x4004A070))

#define  PORTB_PCR29                 (*(uint32_t *) (0x4004A074))

#define  PORTB_PCR30                 (*(uint32_t *) (0x4004A078))

#define  PORTB_PCR31                 (*(uint32_t *) (0x4004A07C))

#define  PORTB_GPCLR                 (*(uint32_t *) (0x4004A080))

#define  PORTB_GPCHR                 (*(uint32_t *) (0x4004A084))

#define  PORTB_ISFR                  (*(uint32_t *) (0x4004A0A0))

#define  RCM_SRS0                    (*(uint8_t *) (0x4007F000))

#define  RCM_SRS1                    (*(uint8_t *) (0x4007F001))

#define  RCM_RPFC                    (*(uint8_t *) (0x4007F004))

#define  RCM_RPFW                    (*(uint8_t *) (0x4007F005))

#define  RTC_TSR                     (*(uint32_t *) (0x4003D000))

#define  RTC_TPR                     (*(uint32_t *) (0x4003D004))

#define  RTC_TAR                     (*(uint32_t *) (0x4003D008))

#define  RTC_TCR                     (*(uint32_t *) (0x4003D00C))

#define  RTC_CR                      (*(uint32_t *) (0x4003D010))

#define  RTC_SR                      (*(uint32_t *) (0x4003D014))

#define  RTC_LR                      (*(uint32_t *) (0x4003D018))

#define  RTC_IER                     (*(uint32_t *) (0x4003D01C))

#define  SIM_SOPT1                   (*(uint32_t *) (0x40047000))

#define  SIM_SOPT1CFG                (*(uint32_t *) (0x40047004))

#define  SIM_SOPT2                   (*(uint32_t *) (0x40048004))

#define  SIM_SOPT4                   (*(uint32_t *) (0x4004800C))

#define  SIM_SOPT5                   (*(uint32_t *) (0x40048010))

#define  SIM_SOPT7                   (*(uint32_t *) (0x40048018))

#define  SIM_SDID                    (*(uint32_t *) (0x40048024))

#define  SIM_SCGC4                   (*(uint32_t *) (0x40048034))

#define  SIM_SCGC5                   (*(uint32_t *) (0x40048038))

#define  SIM_SCGC6                   (*(uint32_t *) (0x4004803C))

#define  SIM_SCGC7                   (*(uint32_t *) (0x40048040))

#define  SIM_CLKDIV1                 (*(uint32_t *) (0x40048044))

#define  SIM_FCFG1                   (*(uint32_t *) (0x4004804C))

#define  SIM_FCFG2                   (*(uint32_t *) (0x40048050))

#define  SIM_UIDMH                   (*(uint32_t *) (0x40048058))

#define  SIM_UIDML                   (*(uint32_t *) (0x4004805C))

#define  SIM_UIDL                    (*(uint32_t *) (0x40048060))

#define  SIM_COPC                    (*(uint32_t *) (0x40048100))

#define  SIM_SRVCOP                  (*(uint32_t *) (0x40048104))

#define  SMC_PMPROT                  (*(uint8_t *) (0x4007E000))

#define  SMC_PMCTRL                  (*(uint8_t *) (0x4007E001))

#define  SMC_STOPCTRL                (*(uint8_t *) (0x4007E002))

#define  SMC_PMSTAT                  (*(uint8_t *) (0x4007E003))

#define  SPI0_C1                     (*(uint8_t *) (0x40076000))

#define  SPI0_C2                     (*(uint8_t *) (0x40076001))

#define  SPI0_BR                     (*(uint8_t *) (0x40076002))

#define  SPI0_S                      (*(uint8_t *) (0x40076003))

#define  SPI0_D                      (*(uint8_t *) (0x40076005))

#define  SPI0_M                      (*(uint8_t *) (0x40076007))

#define  TSI0_GENCS                  (*(uint32_t *) (0x40045000))

#define  TSI0_DATA                   (*(uint32_t *) (0x40045004))

