Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  TSI0_TSHD                   (*(uint32_t *) (0x40045008))

//////////////////////////////////////////////////////////////////////////////////////
// The following section defines the IO register bitfield locations and includes some commentary on the meaning of some settings.
//////////////////////////////////////////////////////////////////////////////////////

#define  ADC0_SC1A_ADCH_MASK         0x5u
#define  ADC0_SC1A_ADCH_SHIFT        0
#define  ADC0_SC1A_ADCH(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_SC1A_ADCH_SHIFT))&ADC0_SC1A_ADCH_MASK)
//   Input channel select
//     0b00000 ==> AD0 is selected as input.
//     0b00001 ==> AD1 is selected as input.
//     0b00010 ==> AD2 is selected as input.
//     0b00011 ==> AD3 is selected as input.
//     0b00100 ==> AD4 is selected as input.
//     0b00101 ==> AD5 is selected as input.
//     0b00110 ==> AD6 is selected as input.
//     0b00111 ==> AD7 is selected as input.
//     0b01000 ==> AD8 is selected as input.
//     0b01001 ==> AD9 is selected as input.
//     0b01010 ==> AD10 is selected as input.
//     0b01011 ==> AD11 is selected as input.
//     0b01100 ==> AD12 is selected as input.
//     0b01101 ==> AD13 is selected as input.
//     0b01110 ==> AD14 is selected as input.
//     0b01111 ==> AD15 is selected as input.
//     0b10000 ==> AD16 is selected as input.
//     0b10001 ==> AD17 is selected as input.
//     0b10010 ==> AD18 is selected as input.
//     0b10011 ==> AD19 is selected as input.
//     0b10100 ==> AD20 is selected as input.
//     0b10101 ==> AD21 is selected as input.
//     0b10110 ==> AD22 is selected as input.
//     0b10111 ==> AD23 is selected as input.
//     0b11000 ==> Reserved.
//     0b11001 ==> Reserved.
//     0b11010 ==> Temp sensor (single-ended) is selected as input.
//     0b11011 ==> Bandgap (single-ended) is selected as input.
//     0b11100 ==> Reserved.
//     0b11101 ==> VREFSH is selected as input. Voltage reference selected is determined by the REFSEL bits in the SC2 register.
//     0b11110 ==> VREFSL is selected as input. Voltage reference selected is determined by the REFSEL bits in the SC2 register.
//     0b11111 ==> Module disabled.

#define  ADC0_SC1A_AIEN_MASK         0x40u
#define  ADC0_SC1A_AIEN_SHIFT        6
//   Interrupt enable
//     0b0 ==> Conversion complete interrupt disabled.
//     0b1 ==> Conversion complete interrupt enabled.

#define  ADC0_SC1A_COCO_MASK         0x80u
#define  ADC0_SC1A_COCO_SHIFT        7
//   Conversion complete flag
//     0b0 ==> Conversion not completed.
//     0b1 ==> Conversion completed.

#define  ADC0_SC1B_ADCH_MASK         0x5u
#define  ADC0_SC1B_ADCH_SHIFT        0
#define  ADC0_SC1B_ADCH(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_SC1B_ADCH_SHIFT))&ADC0_SC1B_ADCH_MASK)
//   Input channel select
//     0b00000 ==> AD0 is selected as input.
//     0b00001 ==> AD1 is selected as input.
//     0b00010 ==> AD2 is selected as input.
//     0b00011 ==> AD3 is selected as input.
//     0b00100 ==> AD4 is selected as input.
//     0b00101 ==> AD5 is selected as input.
//     0b00110 ==> AD6 is selected as input.
//     0b00111 ==> AD7 is selected as input.
//     0b01000 ==> AD8 is selected as input.
//     0b01001 ==> AD9 is selected as input.
//     0b01010 ==> AD10 is selected as input.
//     0b01011 ==> AD11 is selected as input.
//     0b01100 ==> AD12 is selected as input.
//     0b01101 ==> AD13 is selected as input.
//     0b01110 ==> AD14 is selected as input.
//     0b01111 ==> AD15 is selected as input.
//     0b10000 ==> AD16 is selected as input.
//     0b10001 ==> AD17 is selected as input.
//     0b10010 ==> AD18 is selected as input.
//     0b10011 ==> AD19 is selected as input.
//     0b10100 ==> AD20 is selected as input.
//     0b10101 ==> AD21 is selected as input.
//     0b10110 ==> AD22 is selected as input.
//     0b10111 ==> AD23 is selected as input.
//     0b11000 ==> Reserved.
//     0b11001 ==> Reserved.
//     0b11010 ==> Temp sensor (single-ended) is selected as input.
//     0b11011 ==> Bandgap (single-ended) is selected as input.
//     0b11100 ==> Reserved.
//     0b11101 ==> VREFSH is selected as input. Voltage reference selected is determined by the REFSEL bits in the SC2 register.
//     0b11110 ==> VREFSL is selected as input. Voltage reference selected is determined by the REFSEL bits in the SC2 register.
//     0b11111 ==> Module disabled.

#define  ADC0_SC1B_AIEN_MASK         0x40u
#define  ADC0_SC1B_AIEN_SHIFT        6
//   Interrupt enable
//     0b0 ==> Conversion complete interrupt disabled.
//     0b1 ==> Conversion complete interrupt enabled.

#define  ADC0_SC1B_COCO_MASK         0x80u
#define  ADC0_SC1B_COCO_SHIFT        7
//   Conversion complete flag
//     0b0 ==> Conversion not completed.
//     0b1 ==> Conversion completed.

#define  ADC0_CFG1_ADICLK_MASK       0x2u
#define  ADC0_CFG1_ADICLK_SHIFT      0
#define  ADC0_CFG1_ADICLK(x)         (((uint32_t)(((uint32_t)(x))<<ADC0_CFG1_ADICLK_SHIFT))&ADC0_CFG1_ADICLK_MASK)
//   Input clock select
//     0b00 ==> Bus clock.
//     0b01 ==> Bus clock divided by 2.
//     0b10 ==> Alternate clock (ALTCLK).
//     0b11 ==> Asynchronous clock (ADACK).

#define  ADC0_CFG1_MODE_MASK         0x8u
#define  ADC0_CFG1_MODE_SHIFT        2
#define  ADC0_CFG1_MODE(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_CFG1_MODE_SHIFT))&ADC0_CFG1_MODE_MASK)
//   Conversion mode selection
//     0b00 ==> It is single-ended 8-bit conversion.
//     0b01 ==> It is single-ended 12-bit conversion.
//     0b10 ==> It is single-ended 10-bit conversion.
//     0b11 ==> It is single-ended 16-bit conversion.

#define  ADC0_CFG1_ADLSMP_MASK       0x10u
#define  ADC0_CFG1_ADLSMP_SHIFT      4
//   Sample time configuration
//     0b0 ==> Short sample time.
//     0b1 ==> Long sample time.

#define  ADC0_CFG1_ADIV_MASK         0x40u
#define  ADC0_CFG1_ADIV_SHIFT        5
#define  ADC0_CFG1_ADIV(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_CFG1_ADIV_SHIFT))&ADC0_CFG1_ADIV_MASK)
//   Clock divide select
//     0b00 ==> The divide ratio is 1 and the clock rate is input clock.
//     0b01 ==> The divide ratio is 2 and the clock rate is (input clock)/2.
//     0b10 ==> The divide ratio is 4 and the clock rate is (input clock)/4.
//     0b11 ==> The divide ratio is 8 and the clock rate is (input clock)/8.

