Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  ADC0_CFG1_ADLPC_MASK        0x80u
#define  ADC0_CFG1_ADLPC_SHIFT       7
//   Low-power configuration
//     0b0 ==> Normal power configuration.
//     0b1 ==> Low power configuration. The power is reduced at the expense of maximum clock speed.

#define  ADC0_CFG2_ADLSTS_MASK       0x2u
#define  ADC0_CFG2_ADLSTS_SHIFT      0
#define  ADC0_CFG2_ADLSTS(x)         (((uint32_t)(((uint32_t)(x))<<ADC0_CFG2_ADLSTS_SHIFT))&ADC0_CFG2_ADLSTS_MASK)
//   Long sample time select
//     0b00 ==> Default longest sample time (20 extra ADCK cycles; 24 ADCK cycles total).
//     0b01 ==> 12 extra ADCK cycles; 16 ADCK cycles total sample time.
//     0b10 ==> 6 extra ADCK cycles; 10 ADCK cycles total sample time.
//     0b11 ==> 2 extra ADCK cycles; 6 ADCK cycles total sample time.

#define  ADC0_CFG2_ADHSC_MASK        0x4u
#define  ADC0_CFG2_ADHSC_SHIFT       2
//   High speed configuration
//     0b0 ==> Normal conversion sequence selected.
//     0b1 ==> High speed conversion sequence selected (2 additional ADCK cycles to total conversion time).

#define  ADC0_CFG2_ADACKEN_MASK      0x8u
#define  ADC0_CFG2_ADACKEN_SHIFT     3
//   Asynchronous clock output enable
//     0b0 ==> Asynchronous clock output disabled; Asynchronous clock only enabled if selected by ADICLK and a conversion is active.
//     0b1 ==> Asynchronous clock and clock output enabled regardless of the state of the ADC.

#define  ADC0_CFG2_MUXSEL_MASK       0x10u
#define  ADC0_CFG2_MUXSEL_SHIFT      4
//   ADC Mux select
//     0b0 ==> ADxxa channels are selected.
//     0b1 ==> ADxxb channels are selected.

#define  ADC0_RA_D_MASK              0x10u
#define  ADC0_RA_D_SHIFT             0
#define  ADC0_RA_D(x)                (((uint32_t)(((uint32_t)(x))<<ADC0_RA_D_SHIFT))&ADC0_RA_D_MASK)
//   Data result

#define  ADC0_RB_D_MASK              0x10u
#define  ADC0_RB_D_SHIFT             0
#define  ADC0_RB_D(x)                (((uint32_t)(((uint32_t)(x))<<ADC0_RB_D_SHIFT))&ADC0_RB_D_MASK)
//   Data result

#define  ADC0_CV1_CV_MASK            0x10u
#define  ADC0_CV1_CV_SHIFT           0
#define  ADC0_CV1_CV(x)              (((uint32_t)(((uint32_t)(x))<<ADC0_CV1_CV_SHIFT))&ADC0_CV1_CV_MASK)
//   Compare value

#define  ADC0_CV2_CV_MASK            0x10u
#define  ADC0_CV2_CV_SHIFT           0
#define  ADC0_CV2_CV(x)              (((uint32_t)(((uint32_t)(x))<<ADC0_CV2_CV_SHIFT))&ADC0_CV2_CV_MASK)
//   Compare value

#define  ADC0_SC2_REFSEL_MASK        0x2u
#define  ADC0_SC2_REFSEL_SHIFT       0
#define  ADC0_SC2_REFSEL(x)          (((uint32_t)(((uint32_t)(x))<<ADC0_SC2_REFSEL_SHIFT))&ADC0_SC2_REFSEL_MASK)
//   Voltage reference selection
//     0b00 ==> Default voltage reference pin pair (external pins VREFH and VREFL)
//     0b01 ==> Alternate reference pair (VALTH and VALTL). This pair may be additional external pins or internal sources depending on MCU configuration. Consult the Chip Configuration information for details specific to this MCU.
//     0b10 ==> Internal bandgap reference and associated ground reference (VBGH and VBGL). Consult the Chip Configuration information for details specific to this MCU.
//     0b11 ==> Reserved

#define  ADC0_SC2_DMAEN_MASK         0x4u
#define  ADC0_SC2_DMAEN_SHIFT        2
//   DMA enable
//     0b0 ==> DMA is disabled.
//     0b1 ==> DMA is enabled and will assert the ADC DMA request during a ADC conversion complete event noted by the assertion of any of the ADC COCO flags.

#define  ADC0_SC2_ACREN_MASK         0x8u
#define  ADC0_SC2_ACREN_SHIFT        3
//   Compare function range enable
//     0b0 ==> Range function disabled. Only the compare value 1 register (CV1) is compared.
//     0b1 ==> Range function enabled. Both compare value registers (CV1 and CV2) are compared.

#define  ADC0_SC2_ACFGT_MASK         0x10u
#define  ADC0_SC2_ACFGT_SHIFT        4
//   Compare function greater than enable
//     0b0 ==> Configures less than threshold, outside range not inclusive and inside range not inclusive functionality based on the values placed in the CV1 and CV2 registers.
//     0b1 ==> Configures greater than or equal to threshold, outside range inclusive and inside range inclusive functionality based on the values placed in the CV1 and CV2 registers.

#define  ADC0_SC2_ACFE_MASK          0x20u
#define  ADC0_SC2_ACFE_SHIFT         5
//   Compare function enable
//     0b0 ==> Compare function disabled.
//     0b1 ==> Compare function enabled.

#define  ADC0_SC2_ADTRG_MASK         0x40u
#define  ADC0_SC2_ADTRG_SHIFT        6
//   Conversion trigger select
//     0b0 ==> Software trigger selected.
//     0b1 ==> Hardware trigger selected.

#define  ADC0_SC2_ADACT_MASK         0x80u
#define  ADC0_SC2_ADACT_SHIFT        7
//   Conversion active
//     0b0 ==> Conversion not in progress.
//     0b1 ==> Conversion in progress.

#define  ADC0_SC3_AVGS_MASK          0x2u
#define  ADC0_SC3_AVGS_SHIFT         0
#define  ADC0_SC3_AVGS(x)            (((uint32_t)(((uint32_t)(x))<<ADC0_SC3_AVGS_SHIFT))&ADC0_SC3_AVGS_MASK)
//   Hardware average select
//     0b00 ==> 4 samples averaged.
//     0b01 ==> 8 samples averaged.
//     0b10 ==> 16 samples averaged.
//     0b11 ==> 32 samples averaged.

#define  ADC0_SC3_AVGE_MASK          0x4u
#define  ADC0_SC3_AVGE_SHIFT         2
//   Hardware average enable
//     0b0 ==> Hardware average function disabled.
//     0b1 ==> Hardware average function enabled.

#define  ADC0_SC3_ADCO_MASK          0x8u
#define  ADC0_SC3_ADCO_SHIFT         3
//   Continuous conversion enable
//     0b0 ==> One conversion or one set of conversions if the hardware average function is enabled (AVGE=1) after initiating a conversion.
//     0b1 ==> Continuous conversions or sets of conversions if the hardware average function is enabled (AVGE=1) after initiating a conversion.

#define  ADC0_SC3_CALF_MASK          0x40u
#define  ADC0_SC3_CALF_SHIFT         6
//   Calibration failed flag
//     0b0 ==> Calibration completed normally.
//     0b1 ==> Calibration failed. ADC accuracy specifications are not guaranteed.

#define  ADC0_SC3_CAL_MASK           0x80u
#define  ADC0_SC3_CAL_SHIFT          7
//   Calibration

