Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  ADC0_OFS_OFS_MASK           0x10u
#define  ADC0_OFS_OFS_SHIFT          0
#define  ADC0_OFS_OFS(x)             (((uint32_t)(((uint32_t)(x))<<ADC0_OFS_OFS_SHIFT))&ADC0_OFS_OFS_MASK)
//   Offset error correction value

#define  ADC0_PG_PG_MASK             0x10u
#define  ADC0_PG_PG_SHIFT            0
#define  ADC0_PG_PG(x)               (((uint32_t)(((uint32_t)(x))<<ADC0_PG_PG_SHIFT))&ADC0_PG_PG_MASK)
//   Plus-side gain

#define  ADC0_CLPD_CLPD_MASK         0x6u
#define  ADC0_CLPD_CLPD_SHIFT        0
#define  ADC0_CLPD_CLPD(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_CLPD_CLPD_SHIFT))&ADC0_CLPD_CLPD_MASK)

#define  ADC0_CLPS_CLPS_MASK         0x6u
#define  ADC0_CLPS_CLPS_SHIFT        0
#define  ADC0_CLPS_CLPS(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_CLPS_CLPS_SHIFT))&ADC0_CLPS_CLPS_MASK)

#define  ADC0_CLP4_CLP4_MASK         0xAu
#define  ADC0_CLP4_CLP4_SHIFT        0
#define  ADC0_CLP4_CLP4(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_CLP4_CLP4_SHIFT))&ADC0_CLP4_CLP4_MASK)

#define  ADC0_CLP3_CLP3_MASK         0x9u
#define  ADC0_CLP3_CLP3_SHIFT        0
#define  ADC0_CLP3_CLP3(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_CLP3_CLP3_SHIFT))&ADC0_CLP3_CLP3_MASK)

#define  ADC0_CLP2_CLP2_MASK         0x8u
#define  ADC0_CLP2_CLP2_SHIFT        0
#define  ADC0_CLP2_CLP2(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_CLP2_CLP2_SHIFT))&ADC0_CLP2_CLP2_MASK)

#define  ADC0_CLP1_CLP1_MASK         0x7u
#define  ADC0_CLP1_CLP1_SHIFT        0
#define  ADC0_CLP1_CLP1(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_CLP1_CLP1_SHIFT))&ADC0_CLP1_CLP1_MASK)

#define  ADC0_CLP0_CLP0_MASK         0x6u
#define  ADC0_CLP0_CLP0_SHIFT        0
#define  ADC0_CLP0_CLP0(x)           (((uint32_t)(((uint32_t)(x))<<ADC0_CLP0_CLP0_SHIFT))&ADC0_CLP0_CLP0_MASK)

#define  CMP0_CR0_HYSTCTR_MASK       0x2u
#define  CMP0_CR0_HYSTCTR_SHIFT      0
#define  CMP0_CR0_HYSTCTR(x)         (((uint8_t)(((uint8_t)(x))<<CMP0_CR0_HYSTCTR_SHIFT))&CMP0_CR0_HYSTCTR_MASK)
//   Comparator hard block hysteresis control
//     0b00 ==> Level 0
//     0b01 ==> Level 1
//     0b10 ==> Level 2
//     0b11 ==> Level 3

#define  CMP0_CR0_FILTER_CNT_MASK    0x30u
#define  CMP0_CR0_FILTER_CNT_SHIFT   4
#define  CMP0_CR0_FILTER_CNT(x)      (((uint8_t)(((uint8_t)(x))<<CMP0_CR0_FILTER_CNT_SHIFT))&CMP0_CR0_FILTER_CNT_MASK)
//   Filter Sample Count
//     0b000 ==> Filter is disabled. If SE = 1, then COUT is a logic 0. This is not a legal state, and is not recommended. If SE = 0, COUT = COUTA.
//     0b001 ==> One sample must agree. The comparator output is simply sampled.
//     0b010 ==> 2 consecutive samples must agree.
//     0b011 ==> 3 consecutive samples must agree.
//     0b100 ==> 4 consecutive samples must agree.
//     0b101 ==> 5 consecutive samples must agree.
//     0b110 ==> 6 consecutive samples must agree.
//     0b111 ==> 7 consecutive samples must agree.

#define  CMP0_CR1_EN_MASK            0x1u
#define  CMP0_CR1_EN_SHIFT           0
//   Comparator Module Enable
//     0b0 ==> Analog Comparator is disabled.
//     0b1 ==> Analog Comparator is enabled.

#define  CMP0_CR1_OPE_MASK           0x2u
#define  CMP0_CR1_OPE_SHIFT          1
//   Comparator Output Pin Enable
//     0b0 ==> CMPO is not available on the associated CMPO output pin. Instead, INV is driven if the comparator owns the pin, which is usually a result of properly setting pin mux controls at the SoC level. If the comparator does not own the pin, this field has no effect.
//     0b1 ==> CMPO is available on the associated CMPO output pin. The comparator output (CMPO) is driven out on the associated CMPO output pin if the comparator owns the pin. If the comparator does not own the field, this bit has no effect.

#define  CMP0_CR1_COS_MASK           0x4u
#define  CMP0_CR1_COS_SHIFT          2
//   Comparator Output Select
//     0b0 ==> Set the filtered comparator output (CMPO) to equal COUT.
//     0b1 ==> Set the unfiltered comparator output (CMPO) to equal COUTA.

#define  CMP0_CR1_INV_MASK           0x8u
#define  CMP0_CR1_INV_SHIFT          3
//   Comparator INVERT
//     0b0 ==> Does not invert the comparator output.
//     0b1 ==> Inverts the comparator output.

#define  CMP0_CR1_PMODE_MASK         0x10u
#define  CMP0_CR1_PMODE_SHIFT        4
//   Power Mode Select
//     0b0 ==> Low-Speed (LS) Comparison mode selected. In this mode, CMP has slower output propagation delay and lower current consumption.
//     0b1 ==> High-Speed (HS) Comparison mode selected. In this mode, CMP has faster output propagation delay and higher current consumption.

#define  CMP0_CR1_WE_MASK            0x40u
#define  CMP0_CR1_WE_SHIFT           6
//   Windowing Enable
//     0b0 ==> Windowing mode is not selected.
//     0b1 ==> Windowing mode is selected.

#define  CMP0_CR1_SE_MASK            0x80u
#define  CMP0_CR1_SE_SHIFT           7
//   Sample Enable
//     0b0 ==> Sampling mode is not selected.
//     0b1 ==> Sampling mode is selected.

#define  CMP0_FPR_FILT_PER_MASK      0x8u
#define  CMP0_FPR_FILT_PER_SHIFT     0
#define  CMP0_FPR_FILT_PER(x)        (((uint8_t)(((uint8_t)(x))<<CMP0_FPR_FILT_PER_SHIFT))&CMP0_FPR_FILT_PER_MASK)
//   Filter Sample Period

#define  CMP0_SCR_COUT_MASK          0x1u
#define  CMP0_SCR_COUT_SHIFT         0
//   Analog Comparator Output

#define  CMP0_SCR_CFF_MASK           0x2u
#define  CMP0_SCR_CFF_SHIFT          1
//   Analog Comparator Flag Falling
//     0b0 ==> Falling-edge on COUT has not been detected.
//     0b1 ==> Falling-edge on COUT has occurred.

#define  CMP0_SCR_CFR_MASK           0x4u
#define  CMP0_SCR_CFR_SHIFT          2
//   Analog Comparator Flag Rising
//     0b0 ==> Rising-edge on COUT has not been detected.
//     0b1 ==> Rising-edge on COUT has occurred.

#define  CMP0_SCR_IEF_MASK           0x8u
#define  CMP0_SCR_IEF_SHIFT          3
//   Comparator Interrupt Enable Falling
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  CMP0_SCR_IER_MASK           0x10u
#define  CMP0_SCR_IER_SHIFT          4
//   Comparator Interrupt Enable Rising
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

