Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  CMP0_SCR_DMAEN_MASK         0x40u
#define  CMP0_SCR_DMAEN_SHIFT        6
//   DMA Enable Control
//     0b0 ==> DMA is disabled.
//     0b1 ==> DMA is enabled.

#define  CMP0_DACCR_VOSEL_MASK       0x6u
#define  CMP0_DACCR_VOSEL_SHIFT      0
#define  CMP0_DACCR_VOSEL(x)         (((uint8_t)(((uint8_t)(x))<<CMP0_DACCR_VOSEL_SHIFT))&CMP0_DACCR_VOSEL_MASK)
//   DAC Output Voltage Select

#define  CMP0_DACCR_VRSEL_MASK       0x40u
#define  CMP0_DACCR_VRSEL_SHIFT      6
//   Supply Voltage Reference Source Select
//     0b0 ==> V is selected as resistor ladder network supply reference V. in1 in
//     0b1 ==> V is selected as resistor ladder network supply reference V. in2 in

#define  CMP0_DACCR_DACEN_MASK       0x80u
#define  CMP0_DACCR_DACEN_SHIFT      7
//   DAC Enable
//     0b0 ==> DAC is disabled.
//     0b1 ==> DAC is enabled.

#define  CMP0_MUXCR_MSEL_MASK        0x3u
#define  CMP0_MUXCR_MSEL_SHIFT       0
#define  CMP0_MUXCR_MSEL(x)          (((uint8_t)(((uint8_t)(x))<<CMP0_MUXCR_MSEL_SHIFT))&CMP0_MUXCR_MSEL_MASK)
//   Minus Input Mux Control
//     0b000 ==> IN0
//     0b001 ==> IN1
//     0b010 ==> IN2
//     0b011 ==> IN3
//     0b100 ==> IN4
//     0b101 ==> IN5
//     0b110 ==> IN6
//     0b111 ==> IN7

#define  CMP0_MUXCR_PSEL_MASK        0x18u
#define  CMP0_MUXCR_PSEL_SHIFT       3
#define  CMP0_MUXCR_PSEL(x)          (((uint8_t)(((uint8_t)(x))<<CMP0_MUXCR_PSEL_SHIFT))&CMP0_MUXCR_PSEL_MASK)
//   Plus Input Mux Control
//     0b000 ==> IN0
//     0b001 ==> IN1
//     0b010 ==> IN2
//     0b011 ==> IN3
//     0b100 ==> IN4
//     0b101 ==> IN5
//     0b110 ==> IN6
//     0b111 ==> IN7

#define  CMP0_MUXCR_PSTM_MASK        0x40u
#define  CMP0_MUXCR_PSTM_SHIFT       6
//   Pass Through Mode Enable
//     0b0 ==> Pass Through Mode is disabled.
//     0b1 ==> Pass Through Mode is enabled.

#define  DAC_DAT0L_DATA_MASK         0x8u
#define  DAC_DAT0L_DATA_SHIFT        0
#define  DAC_DAT0L_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT0L_DATA_SHIFT))&DAC_DAT0L_DATA_MASK)

#define  DAC_DAT0H_DATA_MASK         0x4u
#define  DAC_DAT0H_DATA_SHIFT        0
#define  DAC_DAT0H_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT0H_DATA_SHIFT))&DAC_DAT0H_DATA_MASK)

#define  DAC_DAT1L_DATA_MASK         0x8u
#define  DAC_DAT1L_DATA_SHIFT        0
#define  DAC_DAT1L_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT1L_DATA_SHIFT))&DAC_DAT1L_DATA_MASK)

#define  DAC_DAT1H_DATA_MASK         0x4u
#define  DAC_DAT1H_DATA_SHIFT        0
#define  DAC_DAT1H_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT1H_DATA_SHIFT))&DAC_DAT1H_DATA_MASK)

#define  DAC_DAT2L_DATA_MASK         0x8u
#define  DAC_DAT2L_DATA_SHIFT        0
#define  DAC_DAT2L_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT2L_DATA_SHIFT))&DAC_DAT2L_DATA_MASK)

#define  DAC_DAT2H_DATA_MASK         0x4u
#define  DAC_DAT2H_DATA_SHIFT        0
#define  DAC_DAT2H_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT2H_DATA_SHIFT))&DAC_DAT2H_DATA_MASK)

#define  DAC_DAT3L_DATA_MASK         0x8u
#define  DAC_DAT3L_DATA_SHIFT        0
#define  DAC_DAT3L_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT3L_DATA_SHIFT))&DAC_DAT3L_DATA_MASK)

#define  DAC_DAT3H_DATA_MASK         0x4u
#define  DAC_DAT3H_DATA_SHIFT        0
#define  DAC_DAT3H_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT3H_DATA_SHIFT))&DAC_DAT3H_DATA_MASK)

#define  DAC_DAT4L_DATA_MASK         0x8u
#define  DAC_DAT4L_DATA_SHIFT        0
#define  DAC_DAT4L_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT4L_DATA_SHIFT))&DAC_DAT4L_DATA_MASK)

#define  DAC_DAT4H_DATA_MASK         0x4u
#define  DAC_DAT4H_DATA_SHIFT        0
#define  DAC_DAT4H_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT4H_DATA_SHIFT))&DAC_DAT4H_DATA_MASK)

#define  DAC_DAT5L_DATA_MASK         0x8u
#define  DAC_DAT5L_DATA_SHIFT        0
#define  DAC_DAT5L_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT5L_DATA_SHIFT))&DAC_DAT5L_DATA_MASK)

#define  DAC_DAT5H_DATA_MASK         0x4u
#define  DAC_DAT5H_DATA_SHIFT        0
#define  DAC_DAT5H_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT5H_DATA_SHIFT))&DAC_DAT5H_DATA_MASK)

#define  DAC_DAT6L_DATA_MASK         0x8u
#define  DAC_DAT6L_DATA_SHIFT        0
#define  DAC_DAT6L_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT6L_DATA_SHIFT))&DAC_DAT6L_DATA_MASK)

#define  DAC_DAT6H_DATA_MASK         0x4u
#define  DAC_DAT6H_DATA_SHIFT        0
#define  DAC_DAT6H_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT6H_DATA_SHIFT))&DAC_DAT6H_DATA_MASK)

#define  DAC_DAT7L_DATA_MASK         0x8u
#define  DAC_DAT7L_DATA_SHIFT        0
#define  DAC_DAT7L_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT7L_DATA_SHIFT))&DAC_DAT7L_DATA_MASK)

#define  DAC_DAT7H_DATA_MASK         0x4u
#define  DAC_DAT7H_DATA_SHIFT        0
#define  DAC_DAT7H_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT7H_DATA_SHIFT))&DAC_DAT7H_DATA_MASK)

#define  DAC_DAT8L_DATA_MASK         0x8u
#define  DAC_DAT8L_DATA_SHIFT        0
#define  DAC_DAT8L_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT8L_DATA_SHIFT))&DAC_DAT8L_DATA_MASK)

#define  DAC_DAT8H_DATA_MASK         0x4u
#define  DAC_DAT8H_DATA_SHIFT        0
#define  DAC_DAT8H_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT8H_DATA_SHIFT))&DAC_DAT8H_DATA_MASK)

#define  DAC_DAT9L_DATA_MASK         0x8u
#define  DAC_DAT9L_DATA_SHIFT        0
#define  DAC_DAT9L_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT9L_DATA_SHIFT))&DAC_DAT9L_DATA_MASK)

#define  DAC_DAT9H_DATA_MASK         0x4u
#define  DAC_DAT9H_DATA_SHIFT        0
#define  DAC_DAT9H_DATA(x)           (((uint8_t)(((uint8_t)(x))<<DAC_DAT9H_DATA_SHIFT))&DAC_DAT9H_DATA_MASK)

#define  DAC_DAT10L_DATA_MASK        0x8u
#define  DAC_DAT10L_DATA_SHIFT       0
#define  DAC_DAT10L_DATA(x)          (((uint8_t)(((uint8_t)(x))<<DAC_DAT10L_DATA_SHIFT))&DAC_DAT10L_DATA_MASK)

#define  DAC_DAT10H_DATA_MASK        0x4u
#define  DAC_DAT10H_DATA_SHIFT       0
#define  DAC_DAT10H_DATA(x)          (((uint8_t)(((uint8_t)(x))<<DAC_DAT10H_DATA_SHIFT))&DAC_DAT10H_DATA_MASK)

#define  DAC_DAT11L_DATA_MASK        0x8u
#define  DAC_DAT11L_DATA_SHIFT       0
#define  DAC_DAT11L_DATA(x)          (((uint8_t)(((uint8_t)(x))<<DAC_DAT11L_DATA_SHIFT))&DAC_DAT11L_DATA_MASK)

#define  DAC_DAT11H_DATA_MASK        0x4u
#define  DAC_DAT11H_DATA_SHIFT       0
#define  DAC_DAT11H_DATA(x)          (((uint8_t)(((uint8_t)(x))<<DAC_DAT11H_DATA_SHIFT))&DAC_DAT11H_DATA_MASK)

#define  DAC_DAT12L_DATA_MASK        0x8u
#define  DAC_DAT12L_DATA_SHIFT       0
#define  DAC_DAT12L_DATA(x)          (((uint8_t)(((uint8_t)(x))<<DAC_DAT12L_DATA_SHIFT))&DAC_DAT12L_DATA_MASK)

#define  DAC_DAT12H_DATA_MASK        0x4u
#define  DAC_DAT12H_DATA_SHIFT       0
#define  DAC_DAT12H_DATA(x)          (((uint8_t)(((uint8_t)(x))<<DAC_DAT12H_DATA_SHIFT))&DAC_DAT12H_DATA_MASK)

#define  DAC_DAT13L_DATA_MASK        0x8u
#define  DAC_DAT13L_DATA_SHIFT       0
#define  DAC_DAT13L_DATA(x)          (((uint8_t)(((uint8_t)(x))<<DAC_DAT13L_DATA_SHIFT))&DAC_DAT13L_DATA_MASK)

#define  DAC_DAT13H_DATA_MASK        0x4u
#define  DAC_DAT13H_DATA_SHIFT       0
#define  DAC_DAT13H_DATA(x)          (((uint8_t)(((uint8_t)(x))<<DAC_DAT13H_DATA_SHIFT))&DAC_DAT13H_DATA_MASK)

#define  DAC_DAT14L_DATA_MASK        0x8u
#define  DAC_DAT14L_DATA_SHIFT       0
#define  DAC_DAT14L_DATA(x)          (((uint8_t)(((uint8_t)(x))<<DAC_DAT14L_DATA_SHIFT))&DAC_DAT14L_DATA_MASK)

#define  DAC_DAT14H_DATA_MASK        0x4u
#define  DAC_DAT14H_DATA_SHIFT       0
#define  DAC_DAT14H_DATA(x)          (((uint8_t)(((uint8_t)(x))<<DAC_DAT14H_DATA_SHIFT))&DAC_DAT14H_DATA_MASK)

#define  DAC_DAT15L_DATA_MASK        0x8u
#define  DAC_DAT15L_DATA_SHIFT       0
#define  DAC_DAT15L_DATA(x)          (((uint8_t)(((uint8_t)(x))<<DAC_DAT15L_DATA_SHIFT))&DAC_DAT15L_DATA_MASK)

#define  DAC_DAT15H_DATA_MASK        0x4u
#define  DAC_DAT15H_DATA_SHIFT       0
#define  DAC_DAT15H_DATA(x)          (((uint8_t)(((uint8_t)(x))<<DAC_DAT15H_DATA_SHIFT))&DAC_DAT15H_DATA_MASK)

