Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  DMA_DCR3_SMOD_MASK          0x4000u
#define  DMA_DCR3_SMOD_SHIFT         12
#define  DMA_DCR3_SMOD(x)            (((uint32_t)(((uint32_t)(x))<<DMA_DCR3_SMOD_SHIFT))&DMA_DCR3_SMOD_MASK)
//   Source address modulo
//     0b0000 ==> Buffer disabled
//     0b0001 ==> Circular buffer size is 16 bytes
//     0b0010 ==> Circular buffer size is 32 bytes
//     0b0011 ==> Circular buffer size is 64 bytes
//     0b0100 ==> Circular buffer size is 128 bytes
//     0b0101 ==> Circular buffer size is 256 bytes
//     0b0110 ==> Circular buffer size is 512 bytes
//     0b0111 ==> Circular buffer size is 1 KB
//     0b1000 ==> Circular buffer size is 2 KB
//     0b1001 ==> Circular buffer size is 4 KB
//     0b1010 ==> Circular buffer size is 8 KB
//     0b1011 ==> Circular buffer size is 16 KB
//     0b1100 ==> Circular buffer size is 32 KB
//     0b1101 ==> Circular buffer size is 64 KB
//     0b1110 ==> Circular buffer size is 128 KB
//     0b1111 ==> Circular buffer size is 256 KB

#define  DMA_DCR3_START_MASK         0x10000u
#define  DMA_DCR3_START_SHIFT        16
//   Start transfer
//     0b0 ==> DMA inactive
//     0b1 ==> The DMA begins the transfer in accordance to the values in the TCDn. START is cleared automatically after one module clock and always reads as logic 0.

#define  DMA_DCR3_DSIZE_MASK         0x40000u
#define  DMA_DCR3_DSIZE_SHIFT        17
#define  DMA_DCR3_DSIZE(x)           (((uint32_t)(((uint32_t)(x))<<DMA_DCR3_DSIZE_SHIFT))&DMA_DCR3_DSIZE_MASK)
//   Destination size
//     0b00 ==> Longword
//     0b01 ==> Byte
//     0b10 ==> Word
//     0b11 ==> Reserved (generates a configuration error (DSRn[CE]) if incorrectly specified at time of channel activation)

#define  DMA_DCR3_DINC_MASK          0x80000u
#define  DMA_DCR3_DINC_SHIFT         19
//   Destination increment
//     0b0 ==> No change to the DAR after a successful transfer.
//     0b1 ==> The DAR increments by 1, 2, 4 depending upon the size of the transfer.

#define  DMA_DCR3_SSIZE_MASK         0x200000u
#define  DMA_DCR3_SSIZE_SHIFT        20
#define  DMA_DCR3_SSIZE(x)           (((uint32_t)(((uint32_t)(x))<<DMA_DCR3_SSIZE_SHIFT))&DMA_DCR3_SSIZE_MASK)
//   Source size
//     0b00 ==> Longword
//     0b01 ==> Byte
//     0b10 ==> Word
//     0b11 ==> Reserved (generates a configuration error (DSRn[CE]) if incorrectly specified at time of channel activation)

#define  DMA_DCR3_SINC_MASK          0x400000u
#define  DMA_DCR3_SINC_SHIFT         22
//   Source increment
//     0b0 ==> No change to SAR after a successful transfer.
//     0b1 ==> The SAR increments by 1, 2, 4 as determined by the transfer size.

#define  DMA_DCR3_AA_MASK            0x10000000u
#define  DMA_DCR3_AA_SHIFT           28
//   Auto-align
//     0b0 ==> Auto-align disabled
//     0b1 ==> If SSIZE indicates a transfer no smaller than DSIZE, source accesses are auto-aligned; otherwise, destination accesses are auto-aligned. Source alignment takes precedence over destination alignment. If auto-alignment is enabled, the appropriate address register increments, regardless of DINC or SINC.

#define  DMA_DCR3_CS_MASK            0x20000000u
#define  DMA_DCR3_CS_SHIFT           29
//   Cycle steal
//     0b0 ==> DMA continuously makes read/write transfers until the BCR decrements to 0.
//     0b1 ==> Forces a single read/write transfer per request.

#define  DMA_DCR3_ERQ_MASK           0x40000000u
#define  DMA_DCR3_ERQ_SHIFT          30
//   Enable peripheral request
//     0b0 ==> Peripheral request is ignored.
//     0b1 ==> Enables peripheral request to initiate transfer. A software-initiated request (setting the START bit) is always enabled.

#define  DMA_DCR3_EINT_MASK          0x80000000u
#define  DMA_DCR3_EINT_SHIFT         31
//   Enable interrupt on completion of transfer
//     0b0 ==> No interrupt is generated.
//     0b1 ==> Interrupt signal is enabled.

#define  DMAMUX0_CHCFG0_SOURCE_MASK  0x6u
#define  DMAMUX0_CHCFG0_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG0_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG0_SOURCE_SHIFT))&DMAMUX0_CHCFG0_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG0_TRIG_MASK    0x40u
#define  DMAMUX0_CHCFG0_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG0_ENBL_MASK    0x80u
#define  DMAMUX0_CHCFG0_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX0_CHCFG1_SOURCE_MASK  0x6u
#define  DMAMUX0_CHCFG1_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG1_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG1_SOURCE_SHIFT))&DMAMUX0_CHCFG1_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG1_TRIG_MASK    0x40u
#define  DMAMUX0_CHCFG1_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG1_ENBL_MASK    0x80u
#define  DMAMUX0_CHCFG1_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX0_CHCFG2_SOURCE_MASK  0x6u
#define  DMAMUX0_CHCFG2_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG2_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG2_SOURCE_SHIFT))&DMAMUX0_CHCFG2_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG2_TRIG_MASK    0x40u
#define  DMAMUX0_CHCFG2_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG2_ENBL_MASK    0x80u
#define  DMAMUX0_CHCFG2_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

