Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  DMAMUX0_CHCFG3_SOURCE_MASK  0x6u
#define  DMAMUX0_CHCFG3_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG3_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG3_SOURCE_SHIFT))&DMAMUX0_CHCFG3_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG3_TRIG_MASK    0x40u
#define  DMAMUX0_CHCFG3_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG3_ENBL_MASK    0x80u
#define  DMAMUX0_CHCFG3_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX0_CHCFG4_SOURCE_MASK  0x6u
#define  DMAMUX0_CHCFG4_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG4_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG4_SOURCE_SHIFT))&DMAMUX0_CHCFG4_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG4_TRIG_MASK    0x40u
#define  DMAMUX0_CHCFG4_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG4_ENBL_MASK    0x80u
#define  DMAMUX0_CHCFG4_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX0_CHCFG5_SOURCE_MASK  0x6u
#define  DMAMUX0_CHCFG5_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG5_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG5_SOURCE_SHIFT))&DMAMUX0_CHCFG5_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG5_TRIG_MASK    0x40u
#define  DMAMUX0_CHCFG5_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG5_ENBL_MASK    0x80u
#define  DMAMUX0_CHCFG5_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX0_CHCFG6_SOURCE_MASK  0x6u
#define  DMAMUX0_CHCFG6_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG6_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG6_SOURCE_SHIFT))&DMAMUX0_CHCFG6_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG6_TRIG_MASK    0x40u
#define  DMAMUX0_CHCFG6_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG6_ENBL_MASK    0x80u
#define  DMAMUX0_CHCFG6_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX0_CHCFG7_SOURCE_MASK  0x6u
#define  DMAMUX0_CHCFG7_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG7_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG7_SOURCE_SHIFT))&DMAMUX0_CHCFG7_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG7_TRIG_MASK    0x40u
#define  DMAMUX0_CHCFG7_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG7_ENBL_MASK    0x80u
#define  DMAMUX0_CHCFG7_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX0_CHCFG8_SOURCE_MASK  0x6u
#define  DMAMUX0_CHCFG8_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG8_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG8_SOURCE_SHIFT))&DMAMUX0_CHCFG8_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG8_TRIG_MASK    0x40u
#define  DMAMUX0_CHCFG8_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG8_ENBL_MASK    0x80u
#define  DMAMUX0_CHCFG8_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

