Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  DMAMUX0_CHCFG9_SOURCE_MASK  0x6u
#define  DMAMUX0_CHCFG9_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG9_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG9_SOURCE_SHIFT))&DMAMUX0_CHCFG9_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG9_TRIG_MASK    0x40u
#define  DMAMUX0_CHCFG9_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG9_ENBL_MASK    0x80u
#define  DMAMUX0_CHCFG9_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX0_CHCFG10_SOURCE_MASK 0x6u
#define  DMAMUX0_CHCFG10_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG10_SOURCE(x)   (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG10_SOURCE_SHIFT))&DMAMUX0_CHCFG10_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG10_TRIG_MASK   0x40u
#define  DMAMUX0_CHCFG10_TRIG_SHIFT  6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG10_ENBL_MASK   0x80u
#define  DMAMUX0_CHCFG10_ENBL_SHIFT  7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX0_CHCFG11_SOURCE_MASK 0x6u
#define  DMAMUX0_CHCFG11_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG11_SOURCE(x)   (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG11_SOURCE_SHIFT))&DMAMUX0_CHCFG11_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG11_TRIG_MASK   0x40u
#define  DMAMUX0_CHCFG11_TRIG_SHIFT  6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG11_ENBL_MASK   0x80u
#define  DMAMUX0_CHCFG11_ENBL_SHIFT  7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX0_CHCFG12_SOURCE_MASK 0x6u
#define  DMAMUX0_CHCFG12_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG12_SOURCE(x)   (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG12_SOURCE_SHIFT))&DMAMUX0_CHCFG12_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG12_TRIG_MASK   0x40u
#define  DMAMUX0_CHCFG12_TRIG_SHIFT  6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG12_ENBL_MASK   0x80u
#define  DMAMUX0_CHCFG12_ENBL_SHIFT  7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX0_CHCFG13_SOURCE_MASK 0x6u
#define  DMAMUX0_CHCFG13_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG13_SOURCE(x)   (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG13_SOURCE_SHIFT))&DMAMUX0_CHCFG13_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG13_TRIG_MASK   0x40u
#define  DMAMUX0_CHCFG13_TRIG_SHIFT  6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG13_ENBL_MASK   0x80u
#define  DMAMUX0_CHCFG13_ENBL_SHIFT  7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX0_CHCFG14_SOURCE_MASK 0x6u
#define  DMAMUX0_CHCFG14_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG14_SOURCE(x)   (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG14_SOURCE_SHIFT))&DMAMUX0_CHCFG14_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG14_TRIG_MASK   0x40u
#define  DMAMUX0_CHCFG14_TRIG_SHIFT  6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG14_ENBL_MASK   0x80u
#define  DMAMUX0_CHCFG14_ENBL_SHIFT  7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX0_CHCFG15_SOURCE_MASK 0x6u
#define  DMAMUX0_CHCFG15_SOURCE_SHIFT 0
#define  DMAMUX0_CHCFG15_SOURCE(x)   (((uint8_t)(((uint8_t)(x))<<DMAMUX0_CHCFG15_SOURCE_SHIFT))&DMAMUX0_CHCFG15_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX0_CHCFG15_TRIG_MASK   0x40u
#define  DMAMUX0_CHCFG15_TRIG_SHIFT  6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX0_CHCFG15_ENBL_MASK   0x80u
#define  DMAMUX0_CHCFG15_ENBL_SHIFT  7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  FTFA_FSTAT_MGSTAT0_MASK     0x1u
#define  FTFA_FSTAT_MGSTAT0_SHIFT    0
//   Memory Controller Command Completion Status Flag

#define  FTFA_FSTAT_FPVIOL_MASK      0x10u
#define  FTFA_FSTAT_FPVIOL_SHIFT     4
//   Flash Protection Violation Flag
//     0b0 ==> No protection violation detected
//     0b1 ==> Protection violation detected

