Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  FTFA_FSTAT_ACCERR_MASK      0x20u
#define  FTFA_FSTAT_ACCERR_SHIFT     5
//   Flash Access Error Flag
//     0b0 ==> No access error detected
//     0b1 ==> Access error detected

#define  FTFA_FSTAT_RDCOLERR_MASK    0x40u
#define  FTFA_FSTAT_RDCOLERR_SHIFT   6
//   Flash Read Collision Error Flag
//     0b0 ==> No collision error detected
//     0b1 ==> Collision error detected

#define  FTFA_FSTAT_CCIF_MASK        0x80u
#define  FTFA_FSTAT_CCIF_SHIFT       7
//   Command Complete Interrupt Flag
//     0b0 ==> Flash command in progress
//     0b1 ==> Flash command has completed

#define  FTFA_FCNFG_ERSSUSP_MASK     0x10u
#define  FTFA_FCNFG_ERSSUSP_SHIFT    4
//   Erase Suspend
//     0b0 ==> No suspend requested
//     0b1 ==> Suspend the current Erase Flash Sector command execution.

#define  FTFA_FCNFG_ERSAREQ_MASK     0x20u
#define  FTFA_FCNFG_ERSAREQ_SHIFT    5
//   Erase All Request
//     0b0 ==> No request or request complete
//     0b1 ==> Request to: run the Erase All Blocks command, verify the erased state, program the security byte in the Flash Configuration Field to the unsecure state, and release MCU security by setting the FSEC[SEC] field to the unsecure state.

#define  FTFA_FCNFG_RDCOLLIE_MASK    0x40u
#define  FTFA_FCNFG_RDCOLLIE_SHIFT   6
//   Read Collision Error Interrupt Enable
//     0b0 ==> Read collision error interrupt disabled
//     0b1 ==> Read collision error interrupt enabled. An interrupt request is generated whenever a flash memory read collision error is detected (see the description of FSTAT[RDCOLERR]).

#define  FTFA_FCNFG_CCIE_MASK        0x80u
#define  FTFA_FCNFG_CCIE_SHIFT       7
//   Command Complete Interrupt Enable
//     0b0 ==> Command complete interrupt disabled
//     0b1 ==> Command complete interrupt enabled. An interrupt request is generated whenever the FSTAT[CCIF] flag is set.

#define  FTFA_FSEC_SEC_MASK          0x2u
#define  FTFA_FSEC_SEC_SHIFT         0
#define  FTFA_FSEC_SEC(x)            (((uint8_t)(((uint8_t)(x))<<FTFA_FSEC_SEC_SHIFT))&FTFA_FSEC_SEC_MASK)
//   Flash Security
//     0b00 ==> MCU security status is secure
//     0b01 ==> MCU security status is secure
//     0b10 ==> MCU security status is unsecure (The standard shipping condition of the flash memory module is unsecure.)
//     0b11 ==> MCU security status is secure

#define  FTFA_FSEC_FSLACC_MASK       0x8u
#define  FTFA_FSEC_FSLACC_SHIFT      2
#define  FTFA_FSEC_FSLACC(x)         (((uint8_t)(((uint8_t)(x))<<FTFA_FSEC_FSLACC_SHIFT))&FTFA_FSEC_FSLACC_MASK)
//   Freescale Failure Analysis Access Code
//     0b00 ==> Freescale factory access granted
//     0b01 ==> Freescale factory access denied
//     0b10 ==> Freescale factory access denied
//     0b11 ==> Freescale factory access granted

#define  FTFA_FSEC_MEEN_MASK         0x20u
#define  FTFA_FSEC_MEEN_SHIFT        4
#define  FTFA_FSEC_MEEN(x)           (((uint8_t)(((uint8_t)(x))<<FTFA_FSEC_MEEN_SHIFT))&FTFA_FSEC_MEEN_MASK)
//   Mass Erase Enable Bits
//     0b00 ==> Mass erase is enabled
//     0b01 ==> Mass erase is enabled
//     0b10 ==> Mass erase is disabled
//     0b11 ==> Mass erase is enabled

#define  FTFA_FSEC_KEYEN_MASK        0x80u
#define  FTFA_FSEC_KEYEN_SHIFT       6
#define  FTFA_FSEC_KEYEN(x)          (((uint8_t)(((uint8_t)(x))<<FTFA_FSEC_KEYEN_SHIFT))&FTFA_FSEC_KEYEN_MASK)
//   Backdoor Key Security Enable
//     0b00 ==> Backdoor key access disabled
//     0b01 ==> Backdoor key access disabled (preferred KEYEN state to disable backdoor key access)
//     0b10 ==> Backdoor key access enabled
//     0b11 ==> Backdoor key access disabled

#define  FTFA_FOPT_OPT_MASK          0x8u
#define  FTFA_FOPT_OPT_SHIFT         0
#define  FTFA_FOPT_OPT(x)            (((uint8_t)(((uint8_t)(x))<<FTFA_FOPT_OPT_SHIFT))&FTFA_FOPT_OPT_MASK)
//   Nonvolatile Option

#define  FTFA_FCCOB3_CCOBn_MASK      0x8u
#define  FTFA_FCCOB3_CCOBn_SHIFT     0
#define  FTFA_FCCOB3_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB3_CCOBn_SHIFT))&FTFA_FCCOB3_CCOBn_MASK)

#define  FTFA_FCCOB2_CCOBn_MASK      0x8u
#define  FTFA_FCCOB2_CCOBn_SHIFT     0
#define  FTFA_FCCOB2_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB2_CCOBn_SHIFT))&FTFA_FCCOB2_CCOBn_MASK)

#define  FTFA_FCCOB1_CCOBn_MASK      0x8u
#define  FTFA_FCCOB1_CCOBn_SHIFT     0
#define  FTFA_FCCOB1_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB1_CCOBn_SHIFT))&FTFA_FCCOB1_CCOBn_MASK)

#define  FTFA_FCCOB0_CCOBn_MASK      0x8u
#define  FTFA_FCCOB0_CCOBn_SHIFT     0
#define  FTFA_FCCOB0_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB0_CCOBn_SHIFT))&FTFA_FCCOB0_CCOBn_MASK)

#define  FTFA_FCCOB7_CCOBn_MASK      0x8u
#define  FTFA_FCCOB7_CCOBn_SHIFT     0
#define  FTFA_FCCOB7_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB7_CCOBn_SHIFT))&FTFA_FCCOB7_CCOBn_MASK)

#define  FTFA_FCCOB6_CCOBn_MASK      0x8u
#define  FTFA_FCCOB6_CCOBn_SHIFT     0
#define  FTFA_FCCOB6_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB6_CCOBn_SHIFT))&FTFA_FCCOB6_CCOBn_MASK)

#define  FTFA_FCCOB5_CCOBn_MASK      0x8u
#define  FTFA_FCCOB5_CCOBn_SHIFT     0
#define  FTFA_FCCOB5_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB5_CCOBn_SHIFT))&FTFA_FCCOB5_CCOBn_MASK)

#define  FTFA_FCCOB4_CCOBn_MASK      0x8u
#define  FTFA_FCCOB4_CCOBn_SHIFT     0
#define  FTFA_FCCOB4_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB4_CCOBn_SHIFT))&FTFA_FCCOB4_CCOBn_MASK)

#define  FTFA_FCCOBB_CCOBn_MASK      0x8u
#define  FTFA_FCCOBB_CCOBn_SHIFT     0
#define  FTFA_FCCOBB_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOBB_CCOBn_SHIFT))&FTFA_FCCOBB_CCOBn_MASK)

#define  FTFA_FCCOBA_CCOBn_MASK      0x8u
#define  FTFA_FCCOBA_CCOBn_SHIFT     0
#define  FTFA_FCCOBA_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOBA_CCOBn_SHIFT))&FTFA_FCCOBA_CCOBn_MASK)

#define  FTFA_FCCOB9_CCOBn_MASK      0x8u
#define  FTFA_FCCOB9_CCOBn_SHIFT     0
#define  FTFA_FCCOB9_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB9_CCOBn_SHIFT))&FTFA_FCCOB9_CCOBn_MASK)

#define  FTFA_FCCOB8_CCOBn_MASK      0x8u
#define  FTFA_FCCOB8_CCOBn_SHIFT     0
#define  FTFA_FCCOB8_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB8_CCOBn_SHIFT))&FTFA_FCCOB8_CCOBn_MASK)

