Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  FTFA_FPROT3_PROT_MASK       0x8u
#define  FTFA_FPROT3_PROT_SHIFT      0
#define  FTFA_FPROT3_PROT(x)         (((uint8_t)(((uint8_t)(x))<<FTFA_FPROT3_PROT_SHIFT))&FTFA_FPROT3_PROT_MASK)
//   Program Flash Region Protect
//     0b0 ==> Program flash region is protected.
//     0b1 ==> Program flash region is not protected

#define  FTFA_FPROT2_PROT_MASK       0x8u
#define  FTFA_FPROT2_PROT_SHIFT      0
#define  FTFA_FPROT2_PROT(x)         (((uint8_t)(((uint8_t)(x))<<FTFA_FPROT2_PROT_SHIFT))&FTFA_FPROT2_PROT_MASK)
//   Program Flash Region Protect
//     0b0 ==> Program flash region is protected.
//     0b1 ==> Program flash region is not protected

#define  FTFA_FPROT1_PROT_MASK       0x8u
#define  FTFA_FPROT1_PROT_SHIFT      0
#define  FTFA_FPROT1_PROT(x)         (((uint8_t)(((uint8_t)(x))<<FTFA_FPROT1_PROT_SHIFT))&FTFA_FPROT1_PROT_MASK)
//   Program Flash Region Protect
//     0b0 ==> Program flash region is protected.
//     0b1 ==> Program flash region is not protected

#define  FTFA_FPROT0_PROT_MASK       0x8u
#define  FTFA_FPROT0_PROT_SHIFT      0
#define  FTFA_FPROT0_PROT(x)         (((uint8_t)(((uint8_t)(x))<<FTFA_FPROT0_PROT_SHIFT))&FTFA_FPROT0_PROT_MASK)
//   Program Flash Region Protect
//     0b0 ==> Program flash region is protected.
//     0b1 ==> Program flash region is not protected

#define  GPIOA_PDOR_PDO_MASK         0x20u
#define  GPIOA_PDOR_PDO_SHIFT        0
#define  GPIOA_PDOR_PDO(x)           (((uint32_t)(((uint32_t)(x))<<GPIOA_PDOR_PDO_SHIFT))&GPIOA_PDOR_PDO_MASK)
//   Port Data Output
//     0b0 ==> Logic level 0 is driven on pin, provided pin is configured for general-purpose output.
//     0b1 ==> Logic level 1 is driven on pin, provided pin is configured for general-purpose output.

#define  GPIOA_PSOR_PTSO_MASK        0x20u
#define  GPIOA_PSOR_PTSO_SHIFT       0
#define  GPIOA_PSOR_PTSO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOA_PSOR_PTSO_SHIFT))&GPIOA_PSOR_PTSO_MASK)
//   Port Set Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to logic 1.

#define  GPIOA_PCOR_PTCO_MASK        0x20u
#define  GPIOA_PCOR_PTCO_SHIFT       0
#define  GPIOA_PCOR_PTCO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOA_PCOR_PTCO_SHIFT))&GPIOA_PCOR_PTCO_MASK)
//   Port Clear Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is cleared to logic 0.

#define  GPIOA_PTOR_PTTO_MASK        0x20u
#define  GPIOA_PTOR_PTTO_SHIFT       0
#define  GPIOA_PTOR_PTTO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOA_PTOR_PTTO_SHIFT))&GPIOA_PTOR_PTTO_MASK)
//   Port Toggle Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to the inverse of its existing logic state.

#define  GPIOA_PDIR_PDI_MASK         0x20u
#define  GPIOA_PDIR_PDI_SHIFT        0
#define  GPIOA_PDIR_PDI(x)           (((uint32_t)(((uint32_t)(x))<<GPIOA_PDIR_PDI_SHIFT))&GPIOA_PDIR_PDI_MASK)
//   Port Data Input
//     0b0 ==> Pin logic level is logic 0, or is not configured for use by digital function.
//     0b1 ==> Pin logic level is logic 1.

#define  GPIOA_PDDR_PDD_MASK         0x20u
#define  GPIOA_PDDR_PDD_SHIFT        0
#define  GPIOA_PDDR_PDD(x)           (((uint32_t)(((uint32_t)(x))<<GPIOA_PDDR_PDD_SHIFT))&GPIOA_PDDR_PDD_MASK)
//   Port Data Direction
//     0b0 ==> Pin is configured as general-purpose input, for the GPIO function.
//     0b1 ==> Pin is configured as general-purpose output, for the GPIO function.

#define  GPIOB_PDOR_PDO_MASK         0x20u
#define  GPIOB_PDOR_PDO_SHIFT        0
#define  GPIOB_PDOR_PDO(x)           (((uint32_t)(((uint32_t)(x))<<GPIOB_PDOR_PDO_SHIFT))&GPIOB_PDOR_PDO_MASK)
//   Port Data Output
//     0b0 ==> Logic level 0 is driven on pin, provided pin is configured for general-purpose output.
//     0b1 ==> Logic level 1 is driven on pin, provided pin is configured for general-purpose output.

#define  GPIOB_PSOR_PTSO_MASK        0x20u
#define  GPIOB_PSOR_PTSO_SHIFT       0
#define  GPIOB_PSOR_PTSO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOB_PSOR_PTSO_SHIFT))&GPIOB_PSOR_PTSO_MASK)
//   Port Set Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to logic 1.

#define  GPIOB_PCOR_PTCO_MASK        0x20u
#define  GPIOB_PCOR_PTCO_SHIFT       0
#define  GPIOB_PCOR_PTCO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOB_PCOR_PTCO_SHIFT))&GPIOB_PCOR_PTCO_MASK)
//   Port Clear Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is cleared to logic 0.

#define  GPIOB_PTOR_PTTO_MASK        0x20u
#define  GPIOB_PTOR_PTTO_SHIFT       0
#define  GPIOB_PTOR_PTTO(x)          (((uint32_t)(((uint32_t)(x))<<GPIOB_PTOR_PTTO_SHIFT))&GPIOB_PTOR_PTTO_MASK)
//   Port Toggle Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to the inverse of its existing logic state.

#define  GPIOB_PDIR_PDI_MASK         0x20u
#define  GPIOB_PDIR_PDI_SHIFT        0
#define  GPIOB_PDIR_PDI(x)           (((uint32_t)(((uint32_t)(x))<<GPIOB_PDIR_PDI_SHIFT))&GPIOB_PDIR_PDI_MASK)
//   Port Data Input
//     0b0 ==> Pin logic level is logic 0, or is not configured for use by digital function.
//     0b1 ==> Pin logic level is logic 1.

#define  GPIOB_PDDR_PDD_MASK         0x20u
#define  GPIOB_PDDR_PDD_SHIFT        0
#define  GPIOB_PDDR_PDD(x)           (((uint32_t)(((uint32_t)(x))<<GPIOB_PDDR_PDD_SHIFT))&GPIOB_PDDR_PDD_MASK)
//   Port Data Direction
//     0b0 ==> Pin is configured as general-purpose input, for the GPIO function.
//     0b1 ==> Pin is configured as general-purpose output, for the GPIO function.

#define  I2C0_A1_AD_MASK             0xEu
#define  I2C0_A1_AD_SHIFT            1
#define  I2C0_A1_AD(x)               (((uint8_t)(((uint8_t)(x))<<I2C0_A1_AD_SHIFT))&I2C0_A1_AD_MASK)
//   Address

#define  I2C0_F_ICR_MASK             0x6u
#define  I2C0_F_ICR_SHIFT            0
#define  I2C0_F_ICR(x)               (((uint8_t)(((uint8_t)(x))<<I2C0_F_ICR_SHIFT))&I2C0_F_ICR_MASK)
//   ClockRate

#define  I2C0_F_MULT_MASK            0x80u
#define  I2C0_F_MULT_SHIFT           6
#define  I2C0_F_MULT(x)              (((uint8_t)(((uint8_t)(x))<<I2C0_F_MULT_SHIFT))&I2C0_F_MULT_MASK)
//     0b00 ==> mul = 1
//     0b01 ==> mul = 2
//     0b10 ==> mul = 4
//     0b11 ==> Reserved

#define  I2C0_C1_DMAEN_MASK          0x1u
#define  I2C0_C1_DMAEN_SHIFT         0
//   DMA Enable
//     0b0 ==> All DMA signalling disabled.
//     0b1 ==> DMA transfer is enabled and the following conditions trigger the DMA request: While FACK = 0, a data byte is received, either address or data is transmitted. (ACK/NACK automatic) While FACK = 0, the first byte received matches the A1 register or is general call address. If any address matching occurs, IAAS and TCF are set. If the direction of transfer is known from master to slave, then it is not required to check the SRW. With this assumption, DMA can also be used in this
//             case. In other cases, if the master reads data from the slave, then it is required to rewrite the C1 register operation. With this assumption, DMA cannot be used. When FACK = 1, an address or a data byte is transmitted.

#define  I2C0_C1_WUEN_MASK           0x2u
#define  I2C0_C1_WUEN_SHIFT          1
//   Wakeup Enable
//     0b0 ==> Normal operation. No interrupt generated when address matching in low power mode.
//     0b1 ==> Enables the wakeup function in low power mode.

#define  I2C0_C1_RSTA_MASK           0x4u
#define  I2C0_C1_RSTA_SHIFT          2
//   Repeat START

