Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  I2C0_C1_TXAK_MASK           0x8u
#define  I2C0_C1_TXAK_SHIFT          3
//   Transmit Acknowledge Enable
//     0b0 ==> An acknowledge signal is sent to the bus on the following receiving byte (if FACK is cleared) or the current receiving byte (if FACK is set).
//     0b1 ==> No acknowledge signal is sent to the bus on the following receiving data byte (if FACK is cleared) or the current receiving data byte (if FACK is set).

#define  I2C0_C1_TX_MASK             0x10u
#define  I2C0_C1_TX_SHIFT            4
//   Transmit Mode Select
//     0b0 ==> Receive
//     0b1 ==> Transmit

#define  I2C0_C1_MST_MASK            0x20u
#define  I2C0_C1_MST_SHIFT           5
//   Master Mode Select
//     0b0 ==> Slave mode
//     0b1 ==> Master mode

#define  I2C0_C1_IICIE_MASK          0x40u
#define  I2C0_C1_IICIE_SHIFT         6
//   I2C Interrupt Enable
//     0b0 ==> Disabled
//     0b1 ==> Enabled

#define  I2C0_C1_IICEN_MASK          0x80u
#define  I2C0_C1_IICEN_SHIFT         7
//   I2C Enable
//     0b0 ==> Disabled
//     0b1 ==> Enabled

#define  I2C0_S_RXAK_MASK            0x1u
#define  I2C0_S_RXAK_SHIFT           0
//   Receive Acknowledge
//     0b0 ==> Acknowledge signal was received after the completion of one byte of data transmission on the bus
//     0b1 ==> No acknowledge signal detected

#define  I2C0_S_IICIF_MASK           0x2u
#define  I2C0_S_IICIF_SHIFT          1
//   Interrupt Flag
//     0b0 ==> No interrupt pending
//     0b1 ==> Interrupt pending

#define  I2C0_S_SRW_MASK             0x4u
#define  I2C0_S_SRW_SHIFT            2
//   Slave Read/Write
//     0b0 ==> Slave receive, master writing to slave
//     0b1 ==> Slave transmit, master reading from slave

#define  I2C0_S_RAM_MASK             0x8u
#define  I2C0_S_RAM_SHIFT            3
//   Range Address Match
//     0b0 ==> Not addressed
//     0b1 ==> Addressed as a slave

#define  I2C0_S_ARBL_MASK            0x10u
#define  I2C0_S_ARBL_SHIFT           4
//   Arbitration Lost
//     0b0 ==> Standard bus operation.
//     0b1 ==> Loss of arbitration.

#define  I2C0_S_BUSY_MASK            0x20u
#define  I2C0_S_BUSY_SHIFT           5
//   Bus Busy
//     0b0 ==> Bus is idle
//     0b1 ==> Bus is busy

#define  I2C0_S_IAAS_MASK            0x40u
#define  I2C0_S_IAAS_SHIFT           6
//   Addressed As A Slave
//     0b0 ==> Not addressed
//     0b1 ==> Addressed as a slave

#define  I2C0_S_TCF_MASK             0x80u
#define  I2C0_S_TCF_SHIFT            7
//   Transfer Complete Flag
//     0b0 ==> Transfer in progress
//     0b1 ==> Transfer complete

#define  I2C0_D_DATA_MASK            0x8u
#define  I2C0_D_DATA_SHIFT           0
#define  I2C0_D_DATA(x)              (((uint8_t)(((uint8_t)(x))<<I2C0_D_DATA_SHIFT))&I2C0_D_DATA_MASK)
//   Data

#define  I2C0_C2_AD_MASK             0x3u
#define  I2C0_C2_AD_SHIFT            0
#define  I2C0_C2_AD(x)               (((uint8_t)(((uint8_t)(x))<<I2C0_C2_AD_SHIFT))&I2C0_C2_AD_MASK)
//   Slave Address

#define  I2C0_C2_RMEN_MASK           0x8u
#define  I2C0_C2_RMEN_SHIFT          3
//   Range Address Matching Enable
//     0b0 ==> Range mode disabled. No address match occurs for an address within the range of values of the A1 and RA registers.
//     0b1 ==> Range mode enabled. Address matching occurs when a slave receives an address within the range of values of the A1 and RA registers.

#define  I2C0_C2_SBRC_MASK           0x10u
#define  I2C0_C2_SBRC_SHIFT          4
//   Slave Baud Rate Control
//     0b0 ==> The slave baud rate follows the master baud rate and clock stretching may occur
//     0b1 ==> Slave baud rate is independent of the master baud rate

#define  I2C0_C2_HDRS_MASK           0x20u
#define  I2C0_C2_HDRS_SHIFT          5
//   High Drive Select
//     0b0 ==> Normal drive mode
//     0b1 ==> High drive mode

#define  I2C0_C2_ADEXT_MASK          0x40u
#define  I2C0_C2_ADEXT_SHIFT         6
//   Address Extension
//     0b0 ==> 7-bit address scheme
//     0b1 ==> 10-bit address scheme

#define  I2C0_C2_GCAEN_MASK          0x80u
#define  I2C0_C2_GCAEN_SHIFT         7
//   General Call Address Enable
//     0b0 ==> Disabled
//     0b1 ==> Enabled

#define  I2C0_FLT_FLT_MASK           0x5u
#define  I2C0_FLT_FLT_SHIFT          0
#define  I2C0_FLT_FLT(x)             (((uint8_t)(((uint8_t)(x))<<I2C0_FLT_FLT_SHIFT))&I2C0_FLT_FLT_MASK)
//   I2C Programmable Filter Factor
//     0b0 ==> No filter/bypass

#define  I2C0_FLT_STOPIE_MASK        0x20u
#define  I2C0_FLT_STOPIE_SHIFT       5
//   I2C Bus Stop Interrupt Enable
//     0b0 ==> Stop detection interrupt is disabled
//     0b1 ==> Stop detection interrupt is enabled

#define  I2C0_FLT_STOPF_MASK         0x40u
#define  I2C0_FLT_STOPF_SHIFT        6
//   I2C Bus Stop Detect Flag
//     0b0 ==> No stop happens on I2C bus
//     0b1 ==> Stop detected on I2C bus

#define  I2C0_FLT_SHEN_MASK          0x80u
#define  I2C0_FLT_SHEN_SHIFT         7
//   Stop Hold Enable
//     0b0 ==> Stop holdoff is disabled. The MCU's entry to stop mode is not gated.
//     0b1 ==> Stop holdoff is enabled.

#define  I2C0_RA_RAD_MASK            0xEu
#define  I2C0_RA_RAD_SHIFT           1
#define  I2C0_RA_RAD(x)              (((uint8_t)(((uint8_t)(x))<<I2C0_RA_RAD_SHIFT))&I2C0_RA_RAD_MASK)
//   Range Slave Address

#define  I2C0_SMB_SHTF2IE_MASK       0x1u
#define  I2C0_SMB_SHTF2IE_SHIFT      0
//   SHTF2 Interrupt Enable
//     0b0 ==> SHTF2 interrupt is disabled
//     0b1 ==> SHTF2 interrupt is enabled

#define  I2C0_SMB_SHTF2_MASK         0x2u
#define  I2C0_SMB_SHTF2_SHIFT        1
//   SCL High Timeout Flag 2
//     0b0 ==> No SCL high and SDA low timeout occurs
//     0b1 ==> SCL high and SDA low timeout occurs

#define  I2C0_SMB_SHTF1_MASK         0x4u
#define  I2C0_SMB_SHTF1_SHIFT        2
//   SCL High Timeout Flag 1
//     0b0 ==> No SCL high and SDA high timeout occurs
//     0b1 ==> SCL high and SDA high timeout occurs

#define  I2C0_SMB_SLTF_MASK          0x8u
#define  I2C0_SMB_SLTF_SHIFT         3
//   SCL Low Timeout Flag
//     0b0 ==> No low timeout occurs
//     0b1 ==> Low timeout occurs

#define  I2C0_SMB_TCKSEL_MASK        0x10u
#define  I2C0_SMB_TCKSEL_SHIFT       4
//   Timeout Counter Clock Select
//     0b0 ==> Timeout counter counts at the frequency of the bus clock / 64
//     0b1 ==> Timeout counter counts at the frequency of the bus clock

