Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  LLWU_PE4_WUPE12_MASK        0x2u
#define  LLWU_PE4_WUPE12_SHIFT       0
#define  LLWU_PE4_WUPE12(x)          (((uint8_t)(((uint8_t)(x))<<LLWU_PE4_WUPE12_SHIFT))&LLWU_PE4_WUPE12_MASK)
//   Wakeup Pin Enable For LLWU_P12
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE4_WUPE13_MASK        0x8u
#define  LLWU_PE4_WUPE13_SHIFT       2
#define  LLWU_PE4_WUPE13(x)          (((uint8_t)(((uint8_t)(x))<<LLWU_PE4_WUPE13_SHIFT))&LLWU_PE4_WUPE13_MASK)
//   Wakeup Pin Enable For LLWU_P13
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE4_WUPE14_MASK        0x20u
#define  LLWU_PE4_WUPE14_SHIFT       4
#define  LLWU_PE4_WUPE14(x)          (((uint8_t)(((uint8_t)(x))<<LLWU_PE4_WUPE14_SHIFT))&LLWU_PE4_WUPE14_MASK)
//   Wakeup Pin Enable For LLWU_P14
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE4_WUPE15_MASK        0x80u
#define  LLWU_PE4_WUPE15_SHIFT       6
#define  LLWU_PE4_WUPE15(x)          (((uint8_t)(((uint8_t)(x))<<LLWU_PE4_WUPE15_SHIFT))&LLWU_PE4_WUPE15_MASK)
//   Wakeup Pin Enable For LLWU_P15
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_ME_WUME0_MASK          0x1u
#define  LLWU_ME_WUME0_SHIFT         0
//   Wakeup Module Enable For Module 0
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_ME_WUME1_MASK          0x2u
#define  LLWU_ME_WUME1_SHIFT         1
//   Wakeup Module Enable for Module 1
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_ME_WUME2_MASK          0x4u
#define  LLWU_ME_WUME2_SHIFT         2
//   Wakeup Module Enable For Module 2
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_ME_WUME3_MASK          0x8u
#define  LLWU_ME_WUME3_SHIFT         3
//   Wakeup Module Enable For Module 3
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_ME_WUME4_MASK          0x10u
#define  LLWU_ME_WUME4_SHIFT         4
//   Wakeup Module Enable For Module 4
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_ME_WUME5_MASK          0x20u
#define  LLWU_ME_WUME5_SHIFT         5
//   Wakeup Module Enable For Module 5
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_ME_WUME6_MASK          0x40u
#define  LLWU_ME_WUME6_SHIFT         6
//   Wakeup Module Enable For Module 6
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_ME_WUME7_MASK          0x80u
#define  LLWU_ME_WUME7_SHIFT         7
//   Wakeup Module Enable For Module 7
//     0b0 ==> Internal module flag not used as wakeup source
//     0b1 ==> Internal module flag used as wakeup source

#define  LLWU_F1_WUF0_MASK           0x1u
#define  LLWU_F1_WUF0_SHIFT          0
//   Wakeup Flag For LLWU_P0
//     0b0 ==> LLWU_P0 input was not a wakeup source
//     0b1 ==> LLWU_P0 input was a wakeup source

#define  LLWU_F1_WUF1_MASK           0x2u
#define  LLWU_F1_WUF1_SHIFT          1
//   Wakeup Flag For LLWU_P1
//     0b0 ==> LLWU_P1 input was not a wakeup source
//     0b1 ==> LLWU_P1 input was a wakeup source

#define  LLWU_F1_WUF2_MASK           0x4u
#define  LLWU_F1_WUF2_SHIFT          2
//   Wakeup Flag For LLWU_P2
//     0b0 ==> LLWU_P2 input was not a wakeup source
//     0b1 ==> LLWU_P2 input was a wakeup source

#define  LLWU_F1_WUF3_MASK           0x8u
#define  LLWU_F1_WUF3_SHIFT          3
//   Wakeup Flag For LLWU_P3
//     0b0 ==> LLWU_P3 input was not a wakeup source
//     0b1 ==> LLWU_P3 input was a wakeup source

#define  LLWU_F1_WUF4_MASK           0x10u
#define  LLWU_F1_WUF4_SHIFT          4
//   Wakeup Flag For LLWU_P4
//     0b0 ==> LLWU_P4 input was not a wakeup source
//     0b1 ==> LLWU_P4 input was a wakeup source

#define  LLWU_F1_WUF5_MASK           0x20u
#define  LLWU_F1_WUF5_SHIFT          5
//   Wakeup Flag For LLWU_P5
//     0b0 ==> LLWU_P5 input was not a wakeup source
//     0b1 ==> LLWU_P5 input was a wakeup source

#define  LLWU_F1_WUF6_MASK           0x40u
#define  LLWU_F1_WUF6_SHIFT          6
//   Wakeup Flag For LLWU_P6
//     0b0 ==> LLWU_P6 input was not a wakeup source
//     0b1 ==> LLWU_P6 input was a wakeup source

#define  LLWU_F1_WUF7_MASK           0x80u
#define  LLWU_F1_WUF7_SHIFT          7
//   Wakeup Flag For LLWU_P7
//     0b0 ==> LLWU_P7 input was not a wakeup source
//     0b1 ==> LLWU_P7 input was a wakeup source

#define  LLWU_F2_WUF8_MASK           0x1u
#define  LLWU_F2_WUF8_SHIFT          0
//   Wakeup Flag For LLWU_P8
//     0b0 ==> LLWU_P8 input was not a wakeup source
//     0b1 ==> LLWU_P8 input was a wakeup source

#define  LLWU_F2_WUF9_MASK           0x2u
#define  LLWU_F2_WUF9_SHIFT          1
//   Wakeup Flag For LLWU_P9
//     0b0 ==> LLWU_P9 input was not a wakeup source
//     0b1 ==> LLWU_P9 input was a wakeup source

#define  LLWU_F2_WUF10_MASK          0x4u
#define  LLWU_F2_WUF10_SHIFT         2
//   Wakeup Flag For LLWU_P10
//     0b0 ==> LLWU_P10 input was not a wakeup source
//     0b1 ==> LLWU_P10 input was a wakeup source

