Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  LLWU_F2_WUF11_MASK          0x8u
#define  LLWU_F2_WUF11_SHIFT         3
//   Wakeup Flag For LLWU_P11
//     0b0 ==> LLWU_P11 input was not a wakeup source
//     0b1 ==> LLWU_P11 input was a wakeup source

#define  LLWU_F2_WUF12_MASK          0x10u
#define  LLWU_F2_WUF12_SHIFT         4
//   Wakeup Flag For LLWU_P12
//     0b0 ==> LLWU_P12 input was not a wakeup source
//     0b1 ==> LLWU_P12 input was a wakeup source

#define  LLWU_F2_WUF13_MASK          0x20u
#define  LLWU_F2_WUF13_SHIFT         5
//   Wakeup Flag For LLWU_P13
//     0b0 ==> LLWU_P13 input was not a wakeup source
//     0b1 ==> LLWU_P13 input was a wakeup source

#define  LLWU_F2_WUF14_MASK          0x40u
#define  LLWU_F2_WUF14_SHIFT         6
//   Wakeup Flag For LLWU_P14
//     0b0 ==> LLWU_P14 input was not a wakeup source
//     0b1 ==> LLWU_P14 input was a wakeup source

#define  LLWU_F2_WUF15_MASK          0x80u
#define  LLWU_F2_WUF15_SHIFT         7
//   Wakeup Flag For LLWU_P15
//     0b0 ==> LLWU_P15 input was not a wakeup source
//     0b1 ==> LLWU_P15 input was a wakeup source

#define  LLWU_F3_MWUF0_MASK          0x1u
#define  LLWU_F3_MWUF0_SHIFT         0
//   Wakeup flag For module 0
//     0b0 ==> Module 0 input was not a wakeup source
//     0b1 ==> Module 0 input was a wakeup source

#define  LLWU_F3_MWUF1_MASK          0x2u
#define  LLWU_F3_MWUF1_SHIFT         1
//   Wakeup flag For module 1
//     0b0 ==> Module 1 input was not a wakeup source
//     0b1 ==> Module 1 input was a wakeup source

#define  LLWU_F3_MWUF2_MASK          0x4u
#define  LLWU_F3_MWUF2_SHIFT         2
//   Wakeup flag For module 2
//     0b0 ==> Module 2 input was not a wakeup source
//     0b1 ==> Module 2 input was a wakeup source

#define  LLWU_F3_MWUF3_MASK          0x8u
#define  LLWU_F3_MWUF3_SHIFT         3
//   Wakeup flag For module 3
//     0b0 ==> Module 3 input was not a wakeup source
//     0b1 ==> Module 3 input was a wakeup source

#define  LLWU_F3_MWUF4_MASK          0x10u
#define  LLWU_F3_MWUF4_SHIFT         4
//   Wakeup flag For module 4
//     0b0 ==> Module 4 input was not a wakeup source
//     0b1 ==> Module 4 input was a wakeup source

#define  LLWU_F3_MWUF5_MASK          0x20u
#define  LLWU_F3_MWUF5_SHIFT         5
//   Wakeup flag For module 5
//     0b0 ==> Module 5 input was not a wakeup source
//     0b1 ==> Module 5 input was a wakeup source

#define  LLWU_F3_MWUF6_MASK          0x40u
#define  LLWU_F3_MWUF6_SHIFT         6
//   Wakeup flag For module 6
//     0b0 ==> Module 6 input was not a wakeup source
//     0b1 ==> Module 6 input was a wakeup source

#define  LLWU_F3_MWUF7_MASK          0x80u
#define  LLWU_F3_MWUF7_SHIFT         7
//   Wakeup flag For module 7
//     0b0 ==> Module 7 input was not a wakeup source
//     0b1 ==> Module 7 input was a wakeup source

#define  LLWU_FILT1_FILTSEL_MASK     0x4u
#define  LLWU_FILT1_FILTSEL_SHIFT    0
#define  LLWU_FILT1_FILTSEL(x)       (((uint8_t)(((uint8_t)(x))<<LLWU_FILT1_FILTSEL_SHIFT))&LLWU_FILT1_FILTSEL_MASK)
//   Filter Pin Select
//     0b0000 ==> Select LLWU_P0 for filter
//     0b1111 ==> Select LLWU_P15 for filter

#define  LLWU_FILT1_FILTE_MASK       0x40u
#define  LLWU_FILT1_FILTE_SHIFT      5
#define  LLWU_FILT1_FILTE(x)         (((uint8_t)(((uint8_t)(x))<<LLWU_FILT1_FILTE_SHIFT))&LLWU_FILT1_FILTE_MASK)
//   Digital Filter On External Pin
//     0b00 ==> Filter disabled
//     0b01 ==> Filter posedge detect enabled
//     0b10 ==> Filter negedge detect enabled
//     0b11 ==> Filter any edge detect enabled

#define  LLWU_FILT1_FILTF_MASK       0x80u
#define  LLWU_FILT1_FILTF_SHIFT      7
//   Filter Detect Flag
//     0b0 ==> Pin Filter 1 was not a wakeup source
//     0b1 ==> Pin Filter 1 was a wakeup source

#define  LLWU_FILT2_FILTSEL_MASK     0x4u
#define  LLWU_FILT2_FILTSEL_SHIFT    0
#define  LLWU_FILT2_FILTSEL(x)       (((uint8_t)(((uint8_t)(x))<<LLWU_FILT2_FILTSEL_SHIFT))&LLWU_FILT2_FILTSEL_MASK)
//   Filter Pin Select
//     0b0000 ==> Select LLWU_P0 for filter
//     0b1111 ==> Select LLWU_P15 for filter

#define  LLWU_FILT2_FILTE_MASK       0x40u
#define  LLWU_FILT2_FILTE_SHIFT      5
#define  LLWU_FILT2_FILTE(x)         (((uint8_t)(((uint8_t)(x))<<LLWU_FILT2_FILTE_SHIFT))&LLWU_FILT2_FILTE_MASK)
//   Digital Filter On External Pin
//     0b00 ==> Filter disabled
//     0b01 ==> Filter posedge detect enabled
//     0b10 ==> Filter negedge detect enabled
//     0b11 ==> Filter any edge detect enabled

#define  LLWU_FILT2_FILTF_MASK       0x80u
#define  LLWU_FILT2_FILTF_SHIFT      7
//   Filter Detect Flag
//     0b0 ==> Pin Filter 2 was not a wakeup source
//     0b1 ==> Pin Filter 2 was a wakeup source

#define  LPSCI0_BDH_SBR_MASK         0x5u
#define  LPSCI0_BDH_SBR_SHIFT        0
#define  LPSCI0_BDH_SBR(x)           (((uint8_t)(((uint8_t)(x))<<LPSCI0_BDH_SBR_SHIFT))&LPSCI0_BDH_SBR_MASK)
//   Baud Rate Modulo Divisor.

#define  LPSCI0_BDH_SBNS_MASK        0x20u
#define  LPSCI0_BDH_SBNS_SHIFT       5
//   Stop Bit Number Select
//     0b0 ==> One stop bit.
//     0b1 ==> Two stop bit.

#define  LPSCI0_BDH_RXEDGIE_MASK     0x40u
#define  LPSCI0_BDH_RXEDGIE_SHIFT    6
//   RX Input Active Edge Interrupt Enable (for RXEDGIF)
//     0b0 ==> Hardware interrupts from LPSCI_S2[RXEDGIF] disabled (use polling).
//     0b1 ==> Hardware interrupt requested when LPSCI_S2[RXEDGIF] flag is 1.

#define  LPSCI0_BDH_LBKDIE_MASK      0x80u
#define  LPSCI0_BDH_LBKDIE_SHIFT     7
//   LIN Break Detect Interrupt Enable (for LBKDIF)
//     0b0 ==> Hardware interrupts from LPSCI_S2[LBKDIF] disabled (use polling).
//     0b1 ==> Hardware interrupt requested when LPSCI_S2[LBKDIF] flag is 1.

#define  LPSCI0_BDL_SBR_MASK         0x8u
#define  LPSCI0_BDL_SBR_SHIFT        0
#define  LPSCI0_BDL_SBR(x)           (((uint8_t)(((uint8_t)(x))<<LPSCI0_BDL_SBR_SHIFT))&LPSCI0_BDL_SBR_MASK)
//   Baud Rate Modulo Divisor

#define  LPSCI0_C1_PT_MASK           0x1u
#define  LPSCI0_C1_PT_SHIFT          0
//   Parity Type
//     0b0 ==> Even parity.
//     0b1 ==> Odd parity.

#define  LPSCI0_C1_PE_MASK           0x2u
#define  LPSCI0_C1_PE_SHIFT          1
//   Parity Enable
//     0b0 ==> No hardware parity generation or checking.
//     0b1 ==> Parity enabled.

#define  LPSCI0_C1_ILT_MASK          0x4u
#define  LPSCI0_C1_ILT_SHIFT         2
//   Idle Line Type Select
//     0b0 ==> Idle character bit count starts after start bit.
//     0b1 ==> Idle character bit count starts after stop bit.

#define  LPSCI0_C1_WAKE_MASK         0x8u
#define  LPSCI0_C1_WAKE_SHIFT        3
//   Receiver Wakeup Method Select
//     0b0 ==> Idle-line wakeup.
//     0b1 ==> Address-mark wakeup.

