Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  LPSCI0_C1_M_MASK            0x10u
#define  LPSCI0_C1_M_SHIFT           4
//   9-Bit or 8-Bit Mode Select
//     0b0 ==> Receiver and transmitter use 8-bit data characters.
//     0b1 ==> Receiver and transmitter use 9-bit data characters.

#define  LPSCI0_C1_RSRC_MASK         0x20u
#define  LPSCI0_C1_RSRC_SHIFT        5
//   Receiver Source Select
//     0b0 ==> Provided LOOPS is set, RSRC is cleared, selects internal loop back mode and the LPSCI does not use the LPSCI_RX pins.
//     0b1 ==> Single-wire LPSCI mode where the LPSCI_TX pin is connected to the transmitter output and receiver input.

#define  LPSCI0_C1_DOZEEN_MASK       0x40u
#define  LPSCI0_C1_DOZEEN_SHIFT      6
//   Doze Enable
//     0b0 ==> LPSCI is enabled in Wait mode.
//     0b1 ==> LPSCI is disabled in Wait mode.

#define  LPSCI0_C1_LOOPS_MASK        0x80u
#define  LPSCI0_C1_LOOPS_SHIFT       7
//   Loop Mode Select
//     0b0 ==> Normal operation - LPSCI_RX and LPSCI_TX use separate pins.
//     0b1 ==> Loop mode or single-wire mode where transmitter outputs are internally connected to receiver input. (See RSRC bit.) LPSCI_RX pin is not used by LPSCI.

#define  LPSCI0_C2_SBK_MASK          0x1u
#define  LPSCI0_C2_SBK_SHIFT         0
//   Send Break
//     0b0 ==> Normal transmitter operation.
//     0b1 ==> Queue break character(s) to be sent.

#define  LPSCI0_C2_RWU_MASK          0x2u
#define  LPSCI0_C2_RWU_SHIFT         1
//   Receiver Wakeup Control
//     0b0 ==> Normal LPSCI receiver operation.
//     0b1 ==> LPSCI receiver in standby waiting for wakeup condition.

#define  LPSCI0_C2_RE_MASK           0x4u
#define  LPSCI0_C2_RE_SHIFT          2
//   Receiver Enable
//     0b0 ==> Receiver disabled.
//     0b1 ==> Receiver enabled.

#define  LPSCI0_C2_TE_MASK           0x8u
#define  LPSCI0_C2_TE_SHIFT          3
//   Transmitter Enable
//     0b0 ==> Transmitter disabled.
//     0b1 ==> Transmitter enabled.

#define  LPSCI0_C2_ILIE_MASK         0x10u
#define  LPSCI0_C2_ILIE_SHIFT        4
//   Idle Line Interrupt Enable for IDLE
//     0b0 ==> Hardware interrupts from IDLE disabled; use polling.
//     0b1 ==> Hardware interrupt requested when IDLE flag is 1.

#define  LPSCI0_C2_RIE_MASK          0x20u
#define  LPSCI0_C2_RIE_SHIFT         5
//   Receiver Interrupt Enable for RDRF
//     0b0 ==> Hardware interrupts from RDRF disabled; use polling.
//     0b1 ==> Hardware interrupt requested when RDRF flag is 1.

#define  LPSCI0_C2_TCIE_MASK         0x40u
#define  LPSCI0_C2_TCIE_SHIFT        6
//   Transmission Complete Interrupt Enable for TC
//     0b0 ==> Hardware interrupts from TC disabled; use polling.
//     0b1 ==> Hardware interrupt requested when TC flag is 1.

#define  LPSCI0_C2_TIE_MASK          0x80u
#define  LPSCI0_C2_TIE_SHIFT         7
//   Transmit Interrupt Enable for TDRE
//     0b0 ==> Hardware interrupts from TDRE disabled; use polling.
//     0b1 ==> Hardware interrupt requested when TDRE flag is 1.

#define  LPSCI0_S1_PF_MASK           0x1u
#define  LPSCI0_S1_PF_SHIFT          0
//   Parity Error Flag
//     0b0 ==> No parity error.
//     0b1 ==> Parity error.

#define  LPSCI0_S1_FE_MASK           0x2u
#define  LPSCI0_S1_FE_SHIFT          1
//   Framing Error Flag
//     0b0 ==> No framing error detected. This does not guarantee the framing is correct.
//     0b1 ==> Framing error.

#define  LPSCI0_S1_NF_MASK           0x4u
#define  LPSCI0_S1_NF_SHIFT          2
//   Noise Flag
//     0b0 ==> No noise detected.
//     0b1 ==> Noise detected in the received character in LPSCI_D.

#define  LPSCI0_S1_OR_MASK           0x8u
#define  LPSCI0_S1_OR_SHIFT          3
//   Receiver Overrun Flag
//     0b0 ==> No overrun.
//     0b1 ==> Receive overrun (new SCI data lost).

#define  LPSCI0_S1_IDLE_MASK         0x10u
#define  LPSCI0_S1_IDLE_SHIFT        4
//   Idle Line Flag
//     0b0 ==> No idle line detected.
//     0b1 ==> Idle line was detected.

#define  LPSCI0_S1_RDRF_MASK         0x20u
#define  LPSCI0_S1_RDRF_SHIFT        5
//   Receive Data Register Full Flag
//     0b0 ==> Receive data buffer empty.
//     0b1 ==> Receive data buffer full.

#define  LPSCI0_S1_TC_MASK           0x40u
#define  LPSCI0_S1_TC_SHIFT          6
//   Transmission Complete Flag
//     0b0 ==> Transmitter active (sending data, a preamble, or a break).
//     0b1 ==> Transmitter idle (transmission activity complete).

#define  LPSCI0_S1_TDRE_MASK         0x80u
#define  LPSCI0_S1_TDRE_SHIFT        7
//   Transmit Data Register Empty Flag
//     0b0 ==> Transmit data buffer full.
//     0b1 ==> Transmit data buffer empty.

#define  LPSCI0_S2_RAF_MASK          0x1u
#define  LPSCI0_S2_RAF_SHIFT         0
//   Receiver Active Flag
//     0b0 ==> SCI receiver idle waiting for a start bit.
//     0b1 ==> SCI receiver active (LPSCI_RXD input not idle).

#define  LPSCI0_S2_LBKDE_MASK        0x2u
#define  LPSCI0_S2_LBKDE_SHIFT       1
//   LIN Break Detection Enable
//     0b0 ==> Break character is detected at length 10 bit times (if M = 0, SBNS = 0) or 11 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 12 (if M = 1, SBNS = 1 or M10 = 1, SNBS = 0) or 13 (if M10 = 1, SNBS = 1).
//     0b1 ==> Break character is detected at length of 11 bit times (if M = 0, SBNS = 0) or 12 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 14 (if M = 1, SBNS = 1 or M10 = 1, SNBS = 0) or 15 (if M10 = 1, SNBS = 1).

#define  LPSCI0_S2_BRK13_MASK        0x4u
#define  LPSCI0_S2_BRK13_SHIFT       2
//   Break Character Generation Length
//     0b0 ==> Break character is transmitted with length of 10 bit times (if M = 0, SBNS = 0) or 11 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 12 (if M = 1, SBNS = 1 or M10 = 1, SNBS = 0) or 13 (if M10 = 1, SNBS = 1).
//     0b1 ==> Break character is transmitted with length of 13 bit times (if M = 0, SBNS = 0) or 14 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 15 (if M = 1, SBNS = 1 or M10 = 1, SNBS = 0) or 16 (if M10 = 1, SNBS = 1).

#define  LPSCI0_S2_RWUID_MASK        0x8u
#define  LPSCI0_S2_RWUID_SHIFT       3
//   Receive Wake Up Idle Detect
//     0b0 ==> During receive standby state (RWU = 1), the IDLE bit does not get set upon detection of an idle character.
//     0b1 ==> During receive standby state (RWU = 1), the IDLE bit gets set upon detection of an idle character.

#define  LPSCI0_S2_RXINV_MASK        0x10u
#define  LPSCI0_S2_RXINV_SHIFT       4
//   Receive Data Inversion
//     0b0 ==> Receive data not inverted.
//     0b1 ==> Receive data inverted.

#define  LPSCI0_S2_MSBF_MASK         0x20u
#define  LPSCI0_S2_MSBF_SHIFT        5
//   MSB First
//     0b0 ==> LSB (bit0) is the first bit that is transmitted following the start bit. Further, the first bit received after the start bit is identified as bit0.
//     0b1 ==> MSB (bit9, bit8, bit7 or bit6) is the first bit that is transmitted following the start bit depending on the setting of C1[M], C1[PE] and C4[M10]. Further, the first bit received after the start bit is identified as bit9, bit8, bit7 or bit6 depending on the setting of C1[M] and C1[PE].

#define  LPSCI0_S2_RXEDGIF_MASK      0x40u
#define  LPSCI0_S2_RXEDGIF_SHIFT     6
//   LPSCI_RX Pin Active Edge Interrupt Flag
//     0b0 ==> No active edge on the receive pin has occurred.
//     0b1 ==> An active edge on the receive pin has occurred.

#define  LPSCI0_S2_LBKDIF_MASK       0x80u
#define  LPSCI0_S2_LBKDIF_SHIFT      7
//   LIN Break Detect Interrupt Flag
//     0b0 ==> No LIN break character has been detected.
//     0b1 ==> LIN break character has been detected.

