Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  LPSCI0_C3_PEIE_MASK         0x1u
#define  LPSCI0_C3_PEIE_SHIFT        0
//   Parity Error Interrupt Enable
//     0b0 ==> PF interrupts disabled; use polling).
//     0b1 ==> Hardware interrupt requested when PF is set.

#define  LPSCI0_C3_FEIE_MASK         0x2u
#define  LPSCI0_C3_FEIE_SHIFT        1
//   Framing Error Interrupt Enable
//     0b0 ==> FE interrupts disabled; use polling).
//     0b1 ==> Hardware interrupt requested when FE is set.

#define  LPSCI0_C3_NEIE_MASK         0x4u
#define  LPSCI0_C3_NEIE_SHIFT        2
//   Noise Error Interrupt Enable
//     0b0 ==> NF interrupts disabled; use polling).
//     0b1 ==> Hardware interrupt requested when NF is set.

#define  LPSCI0_C3_ORIE_MASK         0x8u
#define  LPSCI0_C3_ORIE_SHIFT        3
//   Overrun Interrupt Enable
//     0b0 ==> OR interrupts disabled; use polling.
//     0b1 ==> Hardware interrupt requested when OR is set.

#define  LPSCI0_C3_TXINV_MASK        0x10u
#define  LPSCI0_C3_TXINV_SHIFT       4
//   Transmit Data Inversion
//     0b0 ==> Transmit data not inverted.
//     0b1 ==> Transmit data inverted.

#define  LPSCI0_C3_TXDIR_MASK        0x20u
#define  LPSCI0_C3_TXDIR_SHIFT       5
//   LPSCI_TX Pin Direction in Single-Wire Mode
//     0b0 ==> LPSCI_TXD pin is an input in single-wire mode.
//     0b1 ==> LPSCI_TXD pin is an output in single-wire mode.

#define  LPSCI0_C3_R9T8_MASK         0x40u
#define  LPSCI0_C3_R9T8_SHIFT        6
//   Receive Bit 9 / Transmit Bit 8

#define  LPSCI0_C3_R8T9_MASK         0x80u
#define  LPSCI0_C3_R8T9_SHIFT        7
//   Receive Bit 8 / Transmit Bit 9

#define  LPSCI0_D_R0T0_MASK          0x1u
#define  LPSCI0_D_R0T0_SHIFT         0

#define  LPSCI0_D_R1T1_MASK          0x2u
#define  LPSCI0_D_R1T1_SHIFT         1

#define  LPSCI0_D_R2T2_MASK          0x4u
#define  LPSCI0_D_R2T2_SHIFT         2

#define  LPSCI0_D_R3T3_MASK          0x8u
#define  LPSCI0_D_R3T3_SHIFT         3

#define  LPSCI0_D_R4T4_MASK          0x10u
#define  LPSCI0_D_R4T4_SHIFT         4

#define  LPSCI0_D_R5T5_MASK          0x20u
#define  LPSCI0_D_R5T5_SHIFT         5

#define  LPSCI0_D_R6T6_MASK          0x40u
#define  LPSCI0_D_R6T6_SHIFT         6

#define  LPSCI0_D_R7T7_MASK          0x80u
#define  LPSCI0_D_R7T7_SHIFT         7

#define  LPSCI0_MA1_MA_MASK          0x8u
#define  LPSCI0_MA1_MA_SHIFT         0
#define  LPSCI0_MA1_MA(x)            (((uint8_t)(((uint8_t)(x))<<LPSCI0_MA1_MA_SHIFT))&LPSCI0_MA1_MA_MASK)
//   Match Address

#define  LPSCI0_MA2_MA_MASK          0x8u
#define  LPSCI0_MA2_MA_SHIFT         0
#define  LPSCI0_MA2_MA(x)            (((uint8_t)(((uint8_t)(x))<<LPSCI0_MA2_MA_SHIFT))&LPSCI0_MA2_MA_MASK)
//   Match Address

#define  LPSCI0_C4_OSR_MASK          0x5u
#define  LPSCI0_C4_OSR_SHIFT         0
#define  LPSCI0_C4_OSR(x)            (((uint8_t)(((uint8_t)(x))<<LPSCI0_C4_OSR_SHIFT))&LPSCI0_C4_OSR_MASK)
//   Over Sampling Ratio

#define  LPSCI0_C4_M10_MASK          0x20u
#define  LPSCI0_C4_M10_SHIFT         5
//   10-bit Mode select
//     0b0 ==> Receiver and transmitter use 8-bit or 9-bit data characters.
//     0b1 ==> Receiver and transmitter use 10-bit data characters.

#define  LPSCI0_C4_MAEN2_MASK        0x40u
#define  LPSCI0_C4_MAEN2_SHIFT       6
//   Match Address Mode Enable 2
//     0b0 ==> All data received is transferred to the data buffer if MAEN1 is cleared.
//     0b1 ==> All data received with the most significant bit cleared, is discarded. All data received with the most significant bit set, is compared with contents of MA2 register. If no match occurs, the data is discarded. If match occurs, data is transferred to the data buffer.

#define  LPSCI0_C4_MAEN1_MASK        0x80u
#define  LPSCI0_C4_MAEN1_SHIFT       7
//   Match Address Mode Enable 1
//     0b0 ==> All data received is transferred to the data buffer if MAEN2 is cleared.
//     0b1 ==> All data received with the most significant bit cleared, is discarded. All data received with the most significant bit set, is compared with contents of MA1 register. If no match occurs, the data is discarded. If match occurs, data is transferred to the data buffer.

#define  LPSCI0_C5_RESYNCDIS_MASK    0x1u
#define  LPSCI0_C5_RESYNCDIS_SHIFT   0
//   Resynchronization Disable
//     0b0 ==> Resynchronization during received data word is supported
//     0b1 ==> Resynchronization during received data word is disabled

#define  LPSCI0_C5_BOTHEDGE_MASK     0x2u
#define  LPSCI0_C5_BOTHEDGE_SHIFT    1
//   Both Edge Sampling
//     0b0 ==> Receiver samples input data using the rising edge of the baud rate clock.
//     0b1 ==> Receiver samples input data using the rising and falling edge of the baud rate clock.

#define  LPSCI0_C5_RDMAE_MASK        0x20u
#define  LPSCI0_C5_RDMAE_SHIFT       5
//   Receiver Full DMA Enable
//     0b0 ==> DMA request disabled.
//     0b1 ==> DMA request enabled.

#define  LPSCI0_C5_TDMAE_MASK        0x80u
#define  LPSCI0_C5_TDMAE_SHIFT       7
//   Transmitter DMA Enable
//     0b0 ==> DMA request disabled.
//     0b1 ==> DMA request enabled.

#define  LPTMR0_CSR_TEN_MASK         0x1u
#define  LPTMR0_CSR_TEN_SHIFT        0
//   Timer Enable
//     0b0 ==> LPTMR is disabled and internal logic is reset.
//     0b1 ==> LPTMR is enabled.

#define  LPTMR0_CSR_TMS_MASK         0x2u
#define  LPTMR0_CSR_TMS_SHIFT        1
//   Timer Mode Select
//     0b0 ==> Time Counter mode.
//     0b1 ==> Pulse Counter mode.

#define  LPTMR0_CSR_TFC_MASK         0x4u
#define  LPTMR0_CSR_TFC_SHIFT        2
//   Timer Free-Running Counter
//     0b0 ==> CNR is reset whenever TCF is set.
//     0b1 ==> CNR is reset on overflow.

#define  LPTMR0_CSR_TPP_MASK         0x8u
#define  LPTMR0_CSR_TPP_SHIFT        3
//   Timer Pin Polarity
//     0b0 ==> Pulse Counter input source is active-high, and the CNR will increment on the rising-edge.
//     0b1 ==> Pulse Counter input source is active-low, and the CNR will increment on the falling-edge.

#define  LPTMR0_CSR_TPS_MASK         0x20u
#define  LPTMR0_CSR_TPS_SHIFT        4
#define  LPTMR0_CSR_TPS(x)           (((uint32_t)(((uint32_t)(x))<<LPTMR0_CSR_TPS_SHIFT))&LPTMR0_CSR_TPS_MASK)
//   Timer Pin Select
//     0b00 ==> Pulse counter input 0 is selected.
//     0b01 ==> Pulse counter input 1 is selected.
//     0b10 ==> Pulse counter input 2 is selected.
//     0b11 ==> Pulse counter input 3 is selected.

#define  LPTMR0_CSR_TIE_MASK         0x40u
#define  LPTMR0_CSR_TIE_SHIFT        6
//   Timer Interrupt Enable
//     0b0 ==> Timer interrupt disabled.
//     0b1 ==> Timer interrupt enabled.

#define  LPTMR0_CSR_TCF_MASK         0x80u
#define  LPTMR0_CSR_TCF_SHIFT        7
//   Timer Compare Flag
//     0b0 ==> The value of CNR is not equal to CMR and increments.
//     0b1 ==> The value of CNR is equal to CMR and increments.

#define  LPTMR0_PSR_PCS_MASK         0x2u
#define  LPTMR0_PSR_PCS_SHIFT        0
#define  LPTMR0_PSR_PCS(x)           (((uint32_t)(((uint32_t)(x))<<LPTMR0_PSR_PCS_SHIFT))&LPTMR0_PSR_PCS_MASK)
//   Prescaler Clock Select
//     0b00 ==> Prescaler/glitch filter clock 0 selected.
//     0b01 ==> Prescaler/glitch filter clock 1 selected.
//     0b10 ==> Prescaler/glitch filter clock 2 selected.
//     0b11 ==> Prescaler/glitch filter clock 3 selected.

#define  LPTMR0_PSR_PBYP_MASK        0x4u
#define  LPTMR0_PSR_PBYP_SHIFT       2
//   Prescaler Bypass
//     0b0 ==> Prescaler/glitch filter is enabled.
//     0b1 ==> Prescaler/glitch filter is bypassed.

#define  LPTMR0_PSR_PRESCALE_MASK    0x20u
#define  LPTMR0_PSR_PRESCALE_SHIFT   3
#define  LPTMR0_PSR_PRESCALE(x)      (((uint32_t)(((uint32_t)(x))<<LPTMR0_PSR_PRESCALE_SHIFT))&LPTMR0_PSR_PRESCALE_MASK)
//   Prescale Value
//     0b0000 ==> Prescaler divides the prescaler clock by 2; glitch filter does not support this configuration.
//     0b0001 ==> Prescaler divides the prescaler clock by 4; glitch filter recognizes change on input pin after 2 rising clock edges.
//     0b0010 ==> Prescaler divides the prescaler clock by 8; glitch filter recognizes change on input pin after 4 rising clock edges.
//     0b0011 ==> Prescaler divides the prescaler clock by 16; glitch filter recognizes change on input pin after 8 rising clock edges.
//     0b0100 ==> Prescaler divides the prescaler clock by 32; glitch filter recognizes change on input pin after 16 rising clock edges.
//     0b0101 ==> Prescaler divides the prescaler clock by 64; glitch filter recognizes change on input pin after 32 rising clock edges.
//     0b0110 ==> Prescaler divides the prescaler clock by 128; glitch filter recognizes change on input pin after 64 rising clock edges.
//     0b0111 ==> Prescaler divides the prescaler clock by 256; glitch filter recognizes change on input pin after 128 rising clock edges.
//     0b1000 ==> Prescaler divides the prescaler clock by 512; glitch filter recognizes change on input pin after 256 rising clock edges.
//     0b1001 ==> Prescaler divides the prescaler clock by 1024; glitch filter recognizes change on input pin after 512 rising clock edges.
//     0b1010 ==> Prescaler divides the prescaler clock by 2048; glitch filter recognizes change on input pin after 1024 rising clock edges.
//     0b1011 ==> Prescaler divides the prescaler clock by 4096; glitch filter recognizes change on input pin after 2048 rising clock edges.
//     0b1100 ==> Prescaler divides the prescaler clock by 8192; glitch filter recognizes change on input pin after 4096 rising clock edges.
//     0b1101 ==> Prescaler divides the prescaler clock by 16,384; glitch filter recognizes change on input pin after 8192 rising clock edges.
//     0b1110 ==> Prescaler divides the prescaler clock by 32,768; glitch filter recognizes change on input pin after 16,384 rising clock edges.
//     0b1111 ==> Prescaler divides the prescaler clock by 65,536; glitch filter recognizes change on input pin after 32,768 rising clock edges.

#define  LPTMR0_CMR_COMPARE_MASK     0x10u
#define  LPTMR0_CMR_COMPARE_SHIFT    0
#define  LPTMR0_CMR_COMPARE(x)       (((uint32_t)(((uint32_t)(x))<<LPTMR0_CMR_COMPARE_SHIFT))&LPTMR0_CMR_COMPARE_MASK)
//   Compare Value

#define  LPTMR0_CNR_COUNTER_MASK     0x10u
#define  LPTMR0_CNR_COUNTER_SHIFT    0
#define  LPTMR0_CNR_COUNTER(x)       (((uint32_t)(((uint32_t)(x))<<LPTMR0_CNR_COUNTER_SHIFT))&LPTMR0_CNR_COUNTER_MASK)
//   Counter Value

#define  LPTPM0_SC_PS_MASK           0x3u
#define  LPTPM0_SC_PS_SHIFT          0
#define  LPTPM0_SC_PS(x)             (((uint32_t)(((uint32_t)(x))<<LPTPM0_SC_PS_SHIFT))&LPTPM0_SC_PS_MASK)
//   Prescale Factor Selection
//     0b000 ==> Divide by 1
//     0b001 ==> Divide by 2
//     0b010 ==> Divide by 4
//     0b011 ==> Divide by 8
//     0b100 ==> Divide by 16
//     0b101 ==> Divide by 32
//     0b110 ==> Divide by 64
//     0b111 ==> Divide by 128

