Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  LPTPM0_CONF_TRGSEL_MASK     0x4000000u
#define  LPTPM0_CONF_TRGSEL_SHIFT    24
#define  LPTPM0_CONF_TRGSEL(x)       (((uint32_t)(((uint32_t)(x))<<LPTPM0_CONF_TRGSEL_SHIFT))&LPTPM0_CONF_TRGSEL_MASK)
//   Trigger Select

#define  LPTPM1_SC_PS_MASK           0x3u
#define  LPTPM1_SC_PS_SHIFT          0
#define  LPTPM1_SC_PS(x)             (((uint32_t)(((uint32_t)(x))<<LPTPM1_SC_PS_SHIFT))&LPTPM1_SC_PS_MASK)
//   Prescale Factor Selection
//     0b000 ==> Divide by 1
//     0b001 ==> Divide by 2
//     0b010 ==> Divide by 4
//     0b011 ==> Divide by 8
//     0b100 ==> Divide by 16
//     0b101 ==> Divide by 32
//     0b110 ==> Divide by 64
//     0b111 ==> Divide by 128

#define  LPTPM1_SC_CMOD_MASK         0x10u
#define  LPTPM1_SC_CMOD_SHIFT        3
#define  LPTPM1_SC_CMOD(x)           (((uint32_t)(((uint32_t)(x))<<LPTPM1_SC_CMOD_SHIFT))&LPTPM1_SC_CMOD_MASK)
//   Clock Mode Selection
//     0b00 ==> LPTPM counter is disabled
//     0b01 ==> LPTPM counter increments on every LPTPM counter clock
//     0b10 ==> LPTPM counter increments on rising edge of LPTPM_EXTCLK synchronized to the LPTPM counter clock
//     0b11 ==> Reserved

#define  LPTPM1_SC_CPWMS_MASK        0x20u
#define  LPTPM1_SC_CPWMS_SHIFT       5
//   Center-aligned PWM Select
//     0b0 ==> LPTPM counter operates in up counting mode.
//     0b1 ==> LPTPM counter operates in up-down counting mode.

#define  LPTPM1_SC_TOIE_MASK         0x40u
#define  LPTPM1_SC_TOIE_SHIFT        6
//   Timer Overflow Interrupt Enable
//     0b0 ==> Disable TOF interrupts. Use software polling or DMA request.
//     0b1 ==> Enable TOF interrupts. An interrupt is generated when TOF equals one.

#define  LPTPM1_SC_TOF_MASK          0x80u
#define  LPTPM1_SC_TOF_SHIFT         7
//   Timer Overflow Flag
//     0b0 ==> LPTPM counter has not overflowed.
//     0b1 ==> LPTPM counter has overflowed.

#define  LPTPM1_SC_DMA_MASK          0x100u
#define  LPTPM1_SC_DMA_SHIFT         8
//   DMA Enable
//     0b0 ==> Disables DMA transfers.
//     0b1 ==> Enables DMA transfers.

#define  LPTPM1_CNT_COUNT_MASK       0x10u
#define  LPTPM1_CNT_COUNT_SHIFT      0
#define  LPTPM1_CNT_COUNT(x)         (((uint32_t)(((uint32_t)(x))<<LPTPM1_CNT_COUNT_SHIFT))&LPTPM1_CNT_COUNT_MASK)
//   Counter value

#define  LPTPM1_MOD_MOD_MASK         0x10u
#define  LPTPM1_MOD_MOD_SHIFT        0
#define  LPTPM1_MOD_MOD(x)           (((uint32_t)(((uint32_t)(x))<<LPTPM1_MOD_MOD_SHIFT))&LPTPM1_MOD_MOD_MASK)
//   Modulo value

#define  LPTPM1_C0SC_DMA_MASK        0x1u
#define  LPTPM1_C0SC_DMA_SHIFT       0
//   DMA Enable
//     0b0 ==> Disable DMA transfers.
//     0b1 ==> Enable DMA transfers.

#define  LPTPM1_C0SC_ELSA_MASK       0x4u
#define  LPTPM1_C0SC_ELSA_SHIFT      2
//   Edge or Level Select

#define  LPTPM1_C0SC_ELSB_MASK       0x8u
#define  LPTPM1_C0SC_ELSB_SHIFT      3
//   Edge or Level Select

#define  LPTPM1_C0SC_MSA_MASK        0x10u
#define  LPTPM1_C0SC_MSA_SHIFT       4
//   Channel Mode Select

#define  LPTPM1_C0SC_MSB_MASK        0x20u
#define  LPTPM1_C0SC_MSB_SHIFT       5
//   Channel Mode Select

#define  LPTPM1_C0SC_CHIE_MASK       0x40u
#define  LPTPM1_C0SC_CHIE_SHIFT      6
//   Channel Interrupt Enable
//     0b0 ==> Disable channel interrupts.
//     0b1 ==> Enable channel interrupts.

#define  LPTPM1_C0SC_CHF_MASK        0x80u
#define  LPTPM1_C0SC_CHF_SHIFT       7
//   Channel Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  LPTPM1_C0V_VAL_MASK         0x10u
#define  LPTPM1_C0V_VAL_SHIFT        0
#define  LPTPM1_C0V_VAL(x)           (((uint32_t)(((uint32_t)(x))<<LPTPM1_C0V_VAL_SHIFT))&LPTPM1_C0V_VAL_MASK)
//   Channel Value

#define  LPTPM1_C1SC_DMA_MASK        0x1u
#define  LPTPM1_C1SC_DMA_SHIFT       0
//   DMA Enable
//     0b0 ==> Disable DMA transfers.
//     0b1 ==> Enable DMA transfers.

#define  LPTPM1_C1SC_ELSA_MASK       0x4u
#define  LPTPM1_C1SC_ELSA_SHIFT      2
//   Edge or Level Select

#define  LPTPM1_C1SC_ELSB_MASK       0x8u
#define  LPTPM1_C1SC_ELSB_SHIFT      3
//   Edge or Level Select

#define  LPTPM1_C1SC_MSA_MASK        0x10u
#define  LPTPM1_C1SC_MSA_SHIFT       4
//   Channel Mode Select

#define  LPTPM1_C1SC_MSB_MASK        0x20u
#define  LPTPM1_C1SC_MSB_SHIFT       5
//   Channel Mode Select

#define  LPTPM1_C1SC_CHIE_MASK       0x40u
#define  LPTPM1_C1SC_CHIE_SHIFT      6
//   Channel Interrupt Enable
//     0b0 ==> Disable channel interrupts.
//     0b1 ==> Enable channel interrupts.

#define  LPTPM1_C1SC_CHF_MASK        0x80u
#define  LPTPM1_C1SC_CHF_SHIFT       7
//   Channel Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  LPTPM1_C1V_VAL_MASK         0x10u
#define  LPTPM1_C1V_VAL_SHIFT        0
#define  LPTPM1_C1V_VAL(x)           (((uint32_t)(((uint32_t)(x))<<LPTPM1_C1V_VAL_SHIFT))&LPTPM1_C1V_VAL_MASK)
//   Channel Value

#define  LPTPM1_C2SC_DMA_MASK        0x1u
#define  LPTPM1_C2SC_DMA_SHIFT       0
//   DMA Enable
//     0b0 ==> Disable DMA transfers.
//     0b1 ==> Enable DMA transfers.

#define  LPTPM1_C2SC_ELSA_MASK       0x4u
#define  LPTPM1_C2SC_ELSA_SHIFT      2
//   Edge or Level Select

#define  LPTPM1_C2SC_ELSB_MASK       0x8u
#define  LPTPM1_C2SC_ELSB_SHIFT      3
//   Edge or Level Select

#define  LPTPM1_C2SC_MSA_MASK        0x10u
#define  LPTPM1_C2SC_MSA_SHIFT       4
//   Channel Mode Select

#define  LPTPM1_C2SC_MSB_MASK        0x20u
#define  LPTPM1_C2SC_MSB_SHIFT       5
//   Channel Mode Select

#define  LPTPM1_C2SC_CHIE_MASK       0x40u
#define  LPTPM1_C2SC_CHIE_SHIFT      6
//   Channel Interrupt Enable
//     0b0 ==> Disable channel interrupts.
//     0b1 ==> Enable channel interrupts.

#define  LPTPM1_C2SC_CHF_MASK        0x80u
#define  LPTPM1_C2SC_CHF_SHIFT       7
//   Channel Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  LPTPM1_C2V_VAL_MASK         0x10u
#define  LPTPM1_C2V_VAL_SHIFT        0
#define  LPTPM1_C2V_VAL(x)           (((uint32_t)(((uint32_t)(x))<<LPTPM1_C2V_VAL_SHIFT))&LPTPM1_C2V_VAL_MASK)
//   Channel Value

#define  LPTPM1_C3SC_DMA_MASK        0x1u
#define  LPTPM1_C3SC_DMA_SHIFT       0
//   DMA Enable
//     0b0 ==> Disable DMA transfers.
//     0b1 ==> Enable DMA transfers.

#define  LPTPM1_C3SC_ELSA_MASK       0x4u
#define  LPTPM1_C3SC_ELSA_SHIFT      2
//   Edge or Level Select

#define  LPTPM1_C3SC_ELSB_MASK       0x8u
#define  LPTPM1_C3SC_ELSB_SHIFT      3
//   Edge or Level Select

#define  LPTPM1_C3SC_MSA_MASK        0x10u
#define  LPTPM1_C3SC_MSA_SHIFT       4
//   Channel Mode Select

#define  LPTPM1_C3SC_MSB_MASK        0x20u
#define  LPTPM1_C3SC_MSB_SHIFT       5
//   Channel Mode Select

#define  LPTPM1_C3SC_CHIE_MASK       0x40u
#define  LPTPM1_C3SC_CHIE_SHIFT      6
//   Channel Interrupt Enable
//     0b0 ==> Disable channel interrupts.
//     0b1 ==> Enable channel interrupts.

#define  LPTPM1_C3SC_CHF_MASK        0x80u
#define  LPTPM1_C3SC_CHF_SHIFT       7
//   Channel Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  LPTPM1_C3V_VAL_MASK         0x10u
#define  LPTPM1_C3V_VAL_SHIFT        0
#define  LPTPM1_C3V_VAL(x)           (((uint32_t)(((uint32_t)(x))<<LPTPM1_C3V_VAL_SHIFT))&LPTPM1_C3V_VAL_MASK)
//   Channel Value

#define  LPTPM1_C4SC_DMA_MASK        0x1u
#define  LPTPM1_C4SC_DMA_SHIFT       0
//   DMA Enable
//     0b0 ==> Disable DMA transfers.
//     0b1 ==> Enable DMA transfers.

