Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  LPTPM1_C4SC_ELSA_MASK       0x4u
#define  LPTPM1_C4SC_ELSA_SHIFT      2
//   Edge or Level Select

#define  LPTPM1_C4SC_ELSB_MASK       0x8u
#define  LPTPM1_C4SC_ELSB_SHIFT      3
//   Edge or Level Select

#define  LPTPM1_C4SC_MSA_MASK        0x10u
#define  LPTPM1_C4SC_MSA_SHIFT       4
//   Channel Mode Select

#define  LPTPM1_C4SC_MSB_MASK        0x20u
#define  LPTPM1_C4SC_MSB_SHIFT       5
//   Channel Mode Select

#define  LPTPM1_C4SC_CHIE_MASK       0x40u
#define  LPTPM1_C4SC_CHIE_SHIFT      6
//   Channel Interrupt Enable
//     0b0 ==> Disable channel interrupts.
//     0b1 ==> Enable channel interrupts.

#define  LPTPM1_C4SC_CHF_MASK        0x80u
#define  LPTPM1_C4SC_CHF_SHIFT       7
//   Channel Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  LPTPM1_C4V_VAL_MASK         0x10u
#define  LPTPM1_C4V_VAL_SHIFT        0
#define  LPTPM1_C4V_VAL(x)           (((uint32_t)(((uint32_t)(x))<<LPTPM1_C4V_VAL_SHIFT))&LPTPM1_C4V_VAL_MASK)
//   Channel Value

#define  LPTPM1_C5SC_DMA_MASK        0x1u
#define  LPTPM1_C5SC_DMA_SHIFT       0
//   DMA Enable
//     0b0 ==> Disable DMA transfers.
//     0b1 ==> Enable DMA transfers.

#define  LPTPM1_C5SC_ELSA_MASK       0x4u
#define  LPTPM1_C5SC_ELSA_SHIFT      2
//   Edge or Level Select

#define  LPTPM1_C5SC_ELSB_MASK       0x8u
#define  LPTPM1_C5SC_ELSB_SHIFT      3
//   Edge or Level Select

#define  LPTPM1_C5SC_MSA_MASK        0x10u
#define  LPTPM1_C5SC_MSA_SHIFT       4
//   Channel Mode Select

#define  LPTPM1_C5SC_MSB_MASK        0x20u
#define  LPTPM1_C5SC_MSB_SHIFT       5
//   Channel Mode Select

#define  LPTPM1_C5SC_CHIE_MASK       0x40u
#define  LPTPM1_C5SC_CHIE_SHIFT      6
//   Channel Interrupt Enable
//     0b0 ==> Disable channel interrupts.
//     0b1 ==> Enable channel interrupts.

#define  LPTPM1_C5SC_CHF_MASK        0x80u
#define  LPTPM1_C5SC_CHF_SHIFT       7
//   Channel Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  LPTPM1_C5V_VAL_MASK         0x10u
#define  LPTPM1_C5V_VAL_SHIFT        0
#define  LPTPM1_C5V_VAL(x)           (((uint32_t)(((uint32_t)(x))<<LPTPM1_C5V_VAL_SHIFT))&LPTPM1_C5V_VAL_MASK)
//   Channel Value

#define  LPTPM1_STATUS_CH0F_MASK     0x1u
#define  LPTPM1_STATUS_CH0F_SHIFT    0
//   Channel 0 Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  LPTPM1_STATUS_CH1F_MASK     0x2u
#define  LPTPM1_STATUS_CH1F_SHIFT    1
//   Channel 1 Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  LPTPM1_STATUS_CH2F_MASK     0x4u
#define  LPTPM1_STATUS_CH2F_SHIFT    2
//   Channel 2 Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  LPTPM1_STATUS_CH3F_MASK     0x8u
#define  LPTPM1_STATUS_CH3F_SHIFT    3
//   Channel 3 Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  LPTPM1_STATUS_CH4F_MASK     0x10u
#define  LPTPM1_STATUS_CH4F_SHIFT    4
//   Channel 4 Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  LPTPM1_STATUS_CH5F_MASK     0x20u
#define  LPTPM1_STATUS_CH5F_SHIFT    5
//   Channel 5 Flag
//     0b0 ==> No channel event has occurred.
//     0b1 ==> A channel event has occurred.

#define  LPTPM1_STATUS_TOF_MASK      0x100u
#define  LPTPM1_STATUS_TOF_SHIFT     8
//   Timer Overflow Flag
//     0b0 ==> LPTPM counter has not overflowed.
//     0b1 ==> LPTPM counter has overflowed.

#define  LPTPM1_CONF_DOZEEN_MASK     0x20u
#define  LPTPM1_CONF_DOZEEN_SHIFT    5
//   Doze Enable
//     0b0 ==> Internal LPTPM counter continues in Doze mode.
//     0b1 ==> Internal LPTPM counter is paused and does not increment during Doze mode. Trigger inputs and input capture events are also ignored.

#define  LPTPM1_CONF_DBGMODE_MASK    0x80u
#define  LPTPM1_CONF_DBGMODE_SHIFT   6
#define  LPTPM1_CONF_DBGMODE(x)      (((uint32_t)(((uint32_t)(x))<<LPTPM1_CONF_DBGMODE_SHIFT))&LPTPM1_CONF_DBGMODE_MASK)
//   Debug Mode
//     0b00 ==> LPTPM counter is paused and does not increment during debug mode. Trigger inputs and input capture events are also ignored.
//     0b11 ==> LPTPM counter continues in debug mode.

#define  LPTPM1_CONF_GTBEEN_MASK     0x200u
#define  LPTPM1_CONF_GTBEEN_SHIFT    9
//   Global time base enable
//     0b0 ==> All channels use the internally generated LPTPM counter as their timebase
//     0b1 ==> All channels use an externally generated global timebase as their timebase

#define  LPTPM1_CONF_CSOT_MASK       0x10000u
#define  LPTPM1_CONF_CSOT_SHIFT      16
//   Counter Start on Trigger
//     0b0 ==> LPTPM counter starts to increment immediately, once it is enabled.
//     0b1 ==> LPTPM counter only starts to increment when it a rising edge on the selected input trigger is detected, after it has been enabled or after it has stopped due to overflow.

#define  LPTPM1_CONF_CSOO_MASK       0x20000u
#define  LPTPM1_CONF_CSOO_SHIFT      17
//   Counter Stop On Overflow
//     0b0 ==> LPTPM counter continues incrementing or decrementing after overflow
//     0b1 ==> LPTPM counter stops incrementing or decrementing after overflow.

#define  LPTPM1_CONF_CROT_MASK       0x40000u
#define  LPTPM1_CONF_CROT_SHIFT      18
//   Counter Reload On Trigger
//     0b0 ==> Counter is not reloaded due to a rising edge on the selected input trigger
//     0b1 ==> Counter is reloaded when a rising edge is detected on the selected input trigger

#define  LPTPM1_CONF_TRGSEL_MASK     0x4000000u
#define  LPTPM1_CONF_TRGSEL_SHIFT    24
#define  LPTPM1_CONF_TRGSEL(x)       (((uint32_t)(((uint32_t)(x))<<LPTPM1_CONF_TRGSEL_SHIFT))&LPTPM1_CONF_TRGSEL_MASK)
//   Trigger Select

#define  MCG_C1_IREFSTEN_MASK        0x1u
#define  MCG_C1_IREFSTEN_SHIFT       0
//   Internal Reference Stop Enable
//     0b0 ==> Internal reference clock is disabled in Stop mode.
//     0b1 ==> Internal reference clock is enabled in Stop mode if IRCLKEN is set or if MCG is in FEI, FBI, or BLPI modes before entering Stop mode.

