Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  MCG_SC_ATMS_MASK            0x40u
#define  MCG_SC_ATMS_SHIFT           6
//   Automatic Trim Machine Select
//     0b0 ==> 32 kHz Internal Reference Clock selected.
//     0b1 ==> 4 MHz Internal Reference Clock selected.

#define  MCG_SC_ATME_MASK            0x80u
#define  MCG_SC_ATME_SHIFT           7
//   Automatic Trim Machine Enable
//     0b0 ==> Auto Trim Machine disabled.
//     0b1 ==> Auto Trim Machine enabled.

#define  MCG_ATCVH_ATCVH_MASK        0x8u
#define  MCG_ATCVH_ATCVH_SHIFT       0
#define  MCG_ATCVH_ATCVH(x)          (((uint8_t)(((uint8_t)(x))<<MCG_ATCVH_ATCVH_SHIFT))&MCG_ATCVH_ATCVH_MASK)
//   ATM Compare Value High

#define  MCG_ATCVL_ATCVL_MASK        0x8u
#define  MCG_ATCVL_ATCVL_SHIFT       0
#define  MCG_ATCVL_ATCVL(x)          (((uint8_t)(((uint8_t)(x))<<MCG_ATCVL_ATCVL_SHIFT))&MCG_ATCVL_ATCVL_MASK)
//   ATM Compare Value Low

#define  MCG_C7_OSCSEL_MASK          0x1u
#define  MCG_C7_OSCSEL_SHIFT         0
//   MCG OSC Clock Select
//     0b0 ==> Selects System Oscillator (OSCCLK).
//     0b1 ==> Selects 32 kHz RTC Oscillator.

#define  MCG_C8_LOCS1_MASK           0x1u
#define  MCG_C8_LOCS1_SHIFT          0
//   RTC Loss of Clock Status
//     0b0 ==> Loss of RTC has not occur.
//     0b1 ==> Loss of RTC has occur

#define  MCG_C8_CME1_MASK            0x20u
#define  MCG_C8_CME1_SHIFT           5
//   Clock Monitor Enable1
//     0b0 ==> External clock monitor is disabled for RTC clock.
//     0b1 ==> External clock monitor is enabled for RTC clock.

#define  MCG_C8_LOCRE1_MASK          0x80u
#define  MCG_C8_LOCRE1_SHIFT         7
//   Loss of Clock Reset Enable
//     0b0 ==> Interrupt request is generated on a loss of RTC external reference clock.
//     0b1 ==> Generate a reset request on a loss of RTC external reference clock

#define  OSC0_CR_SC16P_MASK          0x1u
#define  OSC0_CR_SC16P_SHIFT         0
//   Oscillator 16 pF Capacitor Load Configure
//     0b0 ==> Disable the selection.
//     0b1 ==> Add 16 pF capacitor to the oscillator load.

#define  OSC0_CR_SC8P_MASK           0x2u
#define  OSC0_CR_SC8P_SHIFT          1
//   Oscillator 8 pF Capacitor Load Configure
//     0b0 ==> Disable the selection.
//     0b1 ==> Add 8 pF capacitor to the oscillator load.

#define  OSC0_CR_SC4P_MASK           0x4u
#define  OSC0_CR_SC4P_SHIFT          2
//   Oscillator 4 pF Capacitor Load Configure
//     0b0 ==> Disable the selection.
//     0b1 ==> Add 4 pF capacitor to the oscillator load.

#define  OSC0_CR_SC2P_MASK           0x8u
#define  OSC0_CR_SC2P_SHIFT          3
//   Oscillator 2 pF Capacitor Load Configure
//     0b0 ==> Disable the selection.
//     0b1 ==> Add 2 pF capacitor to the oscillator load.

#define  OSC0_CR_EREFSTEN_MASK       0x20u
#define  OSC0_CR_EREFSTEN_SHIFT      5
//   External Reference Stop Enable
//     0b0 ==> External reference clock is disabled in Stop mode.
//     0b1 ==> External reference clock stays enabled in Stop mode if ERCLKEN is set before entering Stop mode.

#define  OSC0_CR_ERCLKEN_MASK        0x80u
#define  OSC0_CR_ERCLKEN_SHIFT       7
//   External Reference Enable
//     0b0 ==> External reference clock is inactive.
//     0b1 ==> External reference clock is enabled.

#define  PIT_MCR_FRZ_MASK            0x1u
#define  PIT_MCR_FRZ_SHIFT           0
//   Freeze
//     0b0 ==> Timers continue to run in Debug mode.
//     0b1 ==> Timers are stopped in Debug mode.

#define  PIT_MCR_MDIS_MASK           0x2u
#define  PIT_MCR_MDIS_SHIFT          1
//   Module Disable
//     0b0 ==> Clock for PIT timers is enabled.
//     0b1 ==> Clock for PIT timers is disabled.

#define  PIT_LTMR64H_LTH_MASK        0x20u
#define  PIT_LTMR64H_LTH_SHIFT       0
#define  PIT_LTMR64H_LTH(x)          (((uint32_t)(((uint32_t)(x))<<PIT_LTMR64H_LTH_SHIFT))&PIT_LTMR64H_LTH_MASK)
//   Life Timer value

#define  PIT_LTMR64L_LTL_MASK        0x20u
#define  PIT_LTMR64L_LTL_SHIFT       0
#define  PIT_LTMR64L_LTL(x)          (((uint32_t)(((uint32_t)(x))<<PIT_LTMR64L_LTL_SHIFT))&PIT_LTMR64L_LTL_MASK)
//   Life Timer value

#define  PIT_LDVAL0_TSV_MASK         0x20u
#define  PIT_LDVAL0_TSV_SHIFT        0
#define  PIT_LDVAL0_TSV(x)           (((uint32_t)(((uint32_t)(x))<<PIT_LDVAL0_TSV_SHIFT))&PIT_LDVAL0_TSV_MASK)
//   Timer Start Value

#define  PIT_CVAL0_TVL_MASK          0x20u
#define  PIT_CVAL0_TVL_SHIFT         0
#define  PIT_CVAL0_TVL(x)            (((uint32_t)(((uint32_t)(x))<<PIT_CVAL0_TVL_SHIFT))&PIT_CVAL0_TVL_MASK)
//   Current Timer Value

#define  PIT_TCTRL0_TEN_MASK         0x1u
#define  PIT_TCTRL0_TEN_SHIFT        0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT_TCTRL0_TIE_MASK         0x2u
#define  PIT_TCTRL0_TIE_SHIFT        1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT_TCTRL0_CHN_MASK         0x4u
#define  PIT_TCTRL0_CHN_SHIFT        2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

#define  PIT_TFLG0_TIF_MASK          0x1u
#define  PIT_TFLG0_TIF_SHIFT         0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

#define  PIT_LDVAL1_TSV_MASK         0x20u
#define  PIT_LDVAL1_TSV_SHIFT        0
#define  PIT_LDVAL1_TSV(x)           (((uint32_t)(((uint32_t)(x))<<PIT_LDVAL1_TSV_SHIFT))&PIT_LDVAL1_TSV_MASK)
//   Timer Start Value

#define  PIT_CVAL1_TVL_MASK          0x20u
#define  PIT_CVAL1_TVL_SHIFT         0
#define  PIT_CVAL1_TVL(x)            (((uint32_t)(((uint32_t)(x))<<PIT_CVAL1_TVL_SHIFT))&PIT_CVAL1_TVL_MASK)
//   Current Timer Value

#define  PIT_TCTRL1_TEN_MASK         0x1u
#define  PIT_TCTRL1_TEN_SHIFT        0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT_TCTRL1_TIE_MASK         0x2u
#define  PIT_TCTRL1_TIE_SHIFT        1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT_TCTRL1_CHN_MASK         0x4u
#define  PIT_TCTRL1_CHN_SHIFT        2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

#define  PIT_TFLG1_TIF_MASK          0x1u
#define  PIT_TFLG1_TIF_SHIFT         0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

#define  PIT_LDVAL2_TSV_MASK         0x20u
#define  PIT_LDVAL2_TSV_SHIFT        0
#define  PIT_LDVAL2_TSV(x)           (((uint32_t)(((uint32_t)(x))<<PIT_LDVAL2_TSV_SHIFT))&PIT_LDVAL2_TSV_MASK)
//   Timer Start Value

