Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  PIT_CVAL2_TVL_MASK          0x20u
#define  PIT_CVAL2_TVL_SHIFT         0
#define  PIT_CVAL2_TVL(x)            (((uint32_t)(((uint32_t)(x))<<PIT_CVAL2_TVL_SHIFT))&PIT_CVAL2_TVL_MASK)
//   Current Timer Value

#define  PIT_TCTRL2_TEN_MASK         0x1u
#define  PIT_TCTRL2_TEN_SHIFT        0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT_TCTRL2_TIE_MASK         0x2u
#define  PIT_TCTRL2_TIE_SHIFT        1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT_TCTRL2_CHN_MASK         0x4u
#define  PIT_TCTRL2_CHN_SHIFT        2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

#define  PIT_TFLG2_TIF_MASK          0x1u
#define  PIT_TFLG2_TIF_SHIFT         0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

#define  PIT_LDVAL3_TSV_MASK         0x20u
#define  PIT_LDVAL3_TSV_SHIFT        0
#define  PIT_LDVAL3_TSV(x)           (((uint32_t)(((uint32_t)(x))<<PIT_LDVAL3_TSV_SHIFT))&PIT_LDVAL3_TSV_MASK)
//   Timer Start Value

#define  PIT_CVAL3_TVL_MASK          0x20u
#define  PIT_CVAL3_TVL_SHIFT         0
#define  PIT_CVAL3_TVL(x)            (((uint32_t)(((uint32_t)(x))<<PIT_CVAL3_TVL_SHIFT))&PIT_CVAL3_TVL_MASK)
//   Current Timer Value

#define  PIT_TCTRL3_TEN_MASK         0x1u
#define  PIT_TCTRL3_TEN_SHIFT        0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT_TCTRL3_TIE_MASK         0x2u
#define  PIT_TCTRL3_TIE_SHIFT        1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT_TCTRL3_CHN_MASK         0x4u
#define  PIT_TCTRL3_CHN_SHIFT        2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

#define  PIT_TFLG3_TIF_MASK          0x1u
#define  PIT_TFLG3_TIF_SHIFT         0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

#define  PMC_LVDSC1_LVDV_MASK        0x2u
#define  PMC_LVDSC1_LVDV_SHIFT       0
#define  PMC_LVDSC1_LVDV(x)          (((uint8_t)(((uint8_t)(x))<<PMC_LVDSC1_LVDV_SHIFT))&PMC_LVDSC1_LVDV_MASK)
//   Low-Voltage Detect Voltage Select
//     0b00 ==> Low trip point selected (V LVD = V LVDL )
//     0b01 ==> High trip point selected (V LVD = V LVDH )
//     0b10 ==> Reserved
//     0b11 ==> Reserved

#define  PMC_LVDSC1_LVDRE_MASK       0x10u
#define  PMC_LVDSC1_LVDRE_SHIFT      4
//   Low-Voltage Detect Reset Enable
//     0b0 ==> LVDF does not generate hardware resets
//     0b1 ==> Force an MCU reset when LVDF = 1

#define  PMC_LVDSC1_LVDIE_MASK       0x20u
#define  PMC_LVDSC1_LVDIE_SHIFT      5
//   Low-Voltage Detect Interrupt Enable
//     0b0 ==> Hardware interrupt disabled (use polling)
//     0b1 ==> Request a hardware interrupt when LVDF = 1

#define  PMC_LVDSC1_LVDACK_MASK      0x40u
#define  PMC_LVDSC1_LVDACK_SHIFT     6
//   Low-Voltage Detect Acknowledge

#define  PMC_LVDSC1_LVDF_MASK        0x80u
#define  PMC_LVDSC1_LVDF_SHIFT       7
//   Low-Voltage Detect Flag
//     0b0 ==> Low-voltage event not detected
//     0b1 ==> Low-voltage event detected

#define  PMC_LVDSC2_LVWV_MASK        0x2u
#define  PMC_LVDSC2_LVWV_SHIFT       0
#define  PMC_LVDSC2_LVWV(x)          (((uint8_t)(((uint8_t)(x))<<PMC_LVDSC2_LVWV_SHIFT))&PMC_LVDSC2_LVWV_MASK)
//   Low-Voltage Warning Voltage Select
//     0b00 ==> Low trip point selected (VLVW = VLVW1)
//     0b01 ==> Mid 1 trip point selected (VLVW = VLVW2)
//     0b10 ==> Mid 2 trip point selected (VLVW = VLVW3)
//     0b11 ==> High trip point selected (VLVW = VLVW4)

#define  PMC_LVDSC2_LVWIE_MASK       0x20u
#define  PMC_LVDSC2_LVWIE_SHIFT      5
//   Low-Voltage Warning Interrupt Enable
//     0b0 ==> Hardware interrupt disabled (use polling)
//     0b1 ==> Request a hardware interrupt when LVWF = 1

#define  PMC_LVDSC2_LVWACK_MASK      0x40u
#define  PMC_LVDSC2_LVWACK_SHIFT     6
//   Low-Voltage Warning Acknowledge

#define  PMC_LVDSC2_LVWF_MASK        0x80u
#define  PMC_LVDSC2_LVWF_SHIFT       7
//   Low-Voltage Warning Flag
//     0b0 ==> Low-voltage warning event not detected
//     0b1 ==> Low-voltage warning event detected

#define  PMC_REGSC_BGBE_MASK         0x1u
#define  PMC_REGSC_BGBE_SHIFT        0
//   Bandgap Buffer Enable
//     0b0 ==> Bandgap buffer not enabled
//     0b1 ==> Bandgap buffer enabled

#define  PMC_REGSC_REGONS_MASK       0x4u
#define  PMC_REGSC_REGONS_SHIFT      2
//   Regulator In Run Regulation Status
//     0b0 ==> Regulator is in stop regulation or in transition to/from it
//     0b1 ==> Regulator is in run regulation

#define  PMC_REGSC_ACKISO_MASK       0x8u
#define  PMC_REGSC_ACKISO_SHIFT      3
//   Acknowledge Isolation
//     0b0 ==> Peripherals and I/O pads are in normal run state
//     0b1 ==> Certain peripherals and I/O pads are in an isolated and latched state

#define  PMC_REGSC_BGEN_MASK         0x10u
#define  PMC_REGSC_BGEN_SHIFT        4
//   Bandgap Enable In VLPx Operation
//     0b0 ==> Bandgap voltage reference is disabled in VLPx , LLS , and VLLSx modes
//     0b1 ==> Bandgap voltage reference is enabled in VLPx , LLS , and VLLSx modes

#define  PORTA_PCR0_PE_MASK          0x2u
#define  PORTA_PCR0_PE_SHIFT         1
//   Pull Enable
//     0b0 ==> Internal pullup or pulldown resistor is not enabled on the corresponding pin.
//     0b1 ==> Internal pullup or pulldown resistor is enabled on the corresponding pin, if the pin is configured as a digital input.

#define  PORTA_PCR0_MUX_MASK         0x300u
#define  PORTA_PCR0_MUX_SHIFT        8
#define  PORTA_PCR0_MUX(x)           (((uint32_t)(((uint32_t)(x))<<PORTA_PCR0_MUX_SHIFT))&PORTA_PCR0_MUX_MASK)
//   Pin Mux Control
//     0b000 ==> Pin disabled (analog).
//     0b001 ==> Alternative 1 (GPIO).
//     0b010 ==> Alternative 2 (chip-specific).
//     0b011 ==> Alternative 3 (chip-specific).
//     0b100 ==> Alternative 4 (chip-specific).
//     0b101 ==> Alternative 5 (chip-specific).
//     0b110 ==> Alternative 6 (chip-specific).
//     0b111 ==> Alternative 7 (chip-specific).

#define  PORTA_PCR0_IRQC_MASK        0x40000u
#define  PORTA_PCR0_IRQC_SHIFT       16
#define  PORTA_PCR0_IRQC(x)          (((uint32_t)(((uint32_t)(x))<<PORTA_PCR0_IRQC_SHIFT))&PORTA_PCR0_IRQC_MASK)
//   Interrupt Configuration
//     0b0000 ==> Interrupt/DMA request disabled.
//     0b0001 ==> DMA request on rising edge.
//     0b0010 ==> DMA request on falling edge.
//     0b0011 ==> DMA request on either edge.
//     0b0100 ==> Reserved.
//     0b1000 ==> Interrupt when logic zero.
//     0b1001 ==> Interrupt on rising edge.
//     0b1010 ==> Interrupt on falling edge.
//     0b1011 ==> Interrupt on either edge.
//     0b1100 ==> Interrupt when logic one.

#define  PORTA_PCR0_ISF_MASK         0x1000000u
#define  PORTA_PCR0_ISF_SHIFT        24
//   Interrupt Status Flag
//     0b0 ==> Configured interrupt is not detected.
//     0b1 ==> Configured interrupt is detected. If the pin is configured to generate a DMA request, then the corresponding flag will be cleared automatically at the completion of the requested DMA transfer. Otherwise, the flag remains set until a logic one is written to the flag. If the pin is configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately after it is cleared.

#define  PORTA_PCR1_PE_MASK          0x2u
#define  PORTA_PCR1_PE_SHIFT         1
//   Pull Enable
//     0b0 ==> Internal pullup or pulldown resistor is not enabled on the corresponding pin.
//     0b1 ==> Internal pullup or pulldown resistor is enabled on the corresponding pin, if the pin is configured as a digital input.

#define  PORTA_PCR1_MUX_MASK         0x300u
#define  PORTA_PCR1_MUX_SHIFT        8
#define  PORTA_PCR1_MUX(x)           (((uint32_t)(((uint32_t)(x))<<PORTA_PCR1_MUX_SHIFT))&PORTA_PCR1_MUX_MASK)
//   Pin Mux Control
//     0b000 ==> Pin disabled (analog).
//     0b001 ==> Alternative 1 (GPIO).
//     0b010 ==> Alternative 2 (chip-specific).
//     0b011 ==> Alternative 3 (chip-specific).
//     0b100 ==> Alternative 4 (chip-specific).
//     0b101 ==> Alternative 5 (chip-specific).
//     0b110 ==> Alternative 6 (chip-specific).
//     0b111 ==> Alternative 7 (chip-specific).

