Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  PORTA_PCR23_MUX_MASK        0x300u
#define  PORTA_PCR23_MUX_SHIFT       8
#define  PORTA_PCR23_MUX(x)          (((uint32_t)(((uint32_t)(x))<<PORTA_PCR23_MUX_SHIFT))&PORTA_PCR23_MUX_MASK)
//   Pin Mux Control
//     0b000 ==> Pin disabled (analog).
//     0b001 ==> Alternative 1 (GPIO).
//     0b010 ==> Alternative 2 (chip-specific).
//     0b011 ==> Alternative 3 (chip-specific).
//     0b100 ==> Alternative 4 (chip-specific).
//     0b101 ==> Alternative 5 (chip-specific).
//     0b110 ==> Alternative 6 (chip-specific).
//     0b111 ==> Alternative 7 (chip-specific).

#define  PORTA_PCR23_IRQC_MASK       0x40000u
#define  PORTA_PCR23_IRQC_SHIFT      16
#define  PORTA_PCR23_IRQC(x)         (((uint32_t)(((uint32_t)(x))<<PORTA_PCR23_IRQC_SHIFT))&PORTA_PCR23_IRQC_MASK)
//   Interrupt Configuration
//     0b0000 ==> Interrupt/DMA request disabled.
//     0b0001 ==> DMA request on rising edge.
//     0b0010 ==> DMA request on falling edge.
//     0b0011 ==> DMA request on either edge.
//     0b0100 ==> Reserved.
//     0b1000 ==> Interrupt when logic zero.
//     0b1001 ==> Interrupt on rising edge.
//     0b1010 ==> Interrupt on falling edge.
//     0b1011 ==> Interrupt on either edge.
//     0b1100 ==> Interrupt when logic one.

#define  PORTA_PCR23_ISF_MASK        0x1000000u
#define  PORTA_PCR23_ISF_SHIFT       24
//   Interrupt Status Flag
//     0b0 ==> Configured interrupt is not detected.
//     0b1 ==> Configured interrupt is detected. If the pin is configured to generate a DMA request, then the corresponding flag will be cleared automatically at the completion of the requested DMA transfer. Otherwise, the flag remains set until a logic one is written to the flag. If the pin is configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately after it is cleared.

#define  PORTA_PCR24_PE_MASK         0x2u
#define  PORTA_PCR24_PE_SHIFT        1
//   Pull Enable
//     0b0 ==> Internal pullup or pulldown resistor is not enabled on the corresponding pin.
//     0b1 ==> Internal pullup or pulldown resistor is enabled on the corresponding pin, if the pin is configured as a digital input.

#define  PORTA_PCR24_MUX_MASK        0x300u
#define  PORTA_PCR24_MUX_SHIFT       8
#define  PORTA_PCR24_MUX(x)          (((uint32_t)(((uint32_t)(x))<<PORTA_PCR24_MUX_SHIFT))&PORTA_PCR24_MUX_MASK)
//   Pin Mux Control
//     0b000 ==> Pin disabled (analog).
//     0b001 ==> Alternative 1 (GPIO).
//     0b010 ==> Alternative 2 (chip-specific).
//     0b011 ==> Alternative 3 (chip-specific).
//     0b100 ==> Alternative 4 (chip-specific).
//     0b101 ==> Alternative 5 (chip-specific).
//     0b110 ==> Alternative 6 (chip-specific).
//     0b111 ==> Alternative 7 (chip-specific).

#define  PORTA_PCR24_IRQC_MASK       0x40000u
#define  PORTA_PCR24_IRQC_SHIFT      16
#define  PORTA_PCR24_IRQC(x)         (((uint32_t)(((uint32_t)(x))<<PORTA_PCR24_IRQC_SHIFT))&PORTA_PCR24_IRQC_MASK)
//   Interrupt Configuration
//     0b0000 ==> Interrupt/DMA request disabled.
//     0b0001 ==> DMA request on rising edge.
//     0b0010 ==> DMA request on falling edge.
//     0b0011 ==> DMA request on either edge.
//     0b0100 ==> Reserved.
//     0b1000 ==> Interrupt when logic zero.
//     0b1001 ==> Interrupt on rising edge.
//     0b1010 ==> Interrupt on falling edge.
//     0b1011 ==> Interrupt on either edge.
//     0b1100 ==> Interrupt when logic one.

#define  PORTA_PCR24_ISF_MASK        0x1000000u
#define  PORTA_PCR24_ISF_SHIFT       24
//   Interrupt Status Flag
//     0b0 ==> Configured interrupt is not detected.
//     0b1 ==> Configured interrupt is detected. If the pin is configured to generate a DMA request, then the corresponding flag will be cleared automatically at the completion of the requested DMA transfer. Otherwise, the flag remains set until a logic one is written to the flag. If the pin is configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately after it is cleared.

#define  PORTA_PCR25_PE_MASK         0x2u
#define  PORTA_PCR25_PE_SHIFT        1
//   Pull Enable
//     0b0 ==> Internal pullup or pulldown resistor is not enabled on the corresponding pin.
//     0b1 ==> Internal pullup or pulldown resistor is enabled on the corresponding pin, if the pin is configured as a digital input.

#define  PORTA_PCR25_MUX_MASK        0x300u
#define  PORTA_PCR25_MUX_SHIFT       8
#define  PORTA_PCR25_MUX(x)          (((uint32_t)(((uint32_t)(x))<<PORTA_PCR25_MUX_SHIFT))&PORTA_PCR25_MUX_MASK)
//   Pin Mux Control
//     0b000 ==> Pin disabled (analog).
//     0b001 ==> Alternative 1 (GPIO).
//     0b010 ==> Alternative 2 (chip-specific).
//     0b011 ==> Alternative 3 (chip-specific).
//     0b100 ==> Alternative 4 (chip-specific).
//     0b101 ==> Alternative 5 (chip-specific).
//     0b110 ==> Alternative 6 (chip-specific).
//     0b111 ==> Alternative 7 (chip-specific).

#define  PORTA_PCR25_IRQC_MASK       0x40000u
#define  PORTA_PCR25_IRQC_SHIFT      16
#define  PORTA_PCR25_IRQC(x)         (((uint32_t)(((uint32_t)(x))<<PORTA_PCR25_IRQC_SHIFT))&PORTA_PCR25_IRQC_MASK)
//   Interrupt Configuration
//     0b0000 ==> Interrupt/DMA request disabled.
//     0b0001 ==> DMA request on rising edge.
//     0b0010 ==> DMA request on falling edge.
//     0b0011 ==> DMA request on either edge.
//     0b0100 ==> Reserved.
//     0b1000 ==> Interrupt when logic zero.
//     0b1001 ==> Interrupt on rising edge.
//     0b1010 ==> Interrupt on falling edge.
//     0b1011 ==> Interrupt on either edge.
//     0b1100 ==> Interrupt when logic one.

#define  PORTA_PCR25_ISF_MASK        0x1000000u
#define  PORTA_PCR25_ISF_SHIFT       24
//   Interrupt Status Flag
//     0b0 ==> Configured interrupt is not detected.
//     0b1 ==> Configured interrupt is detected. If the pin is configured to generate a DMA request, then the corresponding flag will be cleared automatically at the completion of the requested DMA transfer. Otherwise, the flag remains set until a logic one is written to the flag. If the pin is configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately after it is cleared.

#define  PORTA_PCR26_PE_MASK         0x2u
#define  PORTA_PCR26_PE_SHIFT        1
//   Pull Enable
//     0b0 ==> Internal pullup or pulldown resistor is not enabled on the corresponding pin.
//     0b1 ==> Internal pullup or pulldown resistor is enabled on the corresponding pin, if the pin is configured as a digital input.

