Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  PORTB_PCR31_IRQC_MASK       0x40000u
#define  PORTB_PCR31_IRQC_SHIFT      16
#define  PORTB_PCR31_IRQC(x)         (((uint32_t)(((uint32_t)(x))<<PORTB_PCR31_IRQC_SHIFT))&PORTB_PCR31_IRQC_MASK)
//   Interrupt Configuration
//     0b0000 ==> Interrupt/DMA request disabled.
//     0b0001 ==> DMA request on rising edge.
//     0b0010 ==> DMA request on falling edge.
//     0b0011 ==> DMA request on either edge.
//     0b0100 ==> Reserved.
//     0b1000 ==> Interrupt when logic zero.
//     0b1001 ==> Interrupt on rising edge.
//     0b1010 ==> Interrupt on falling edge.
//     0b1011 ==> Interrupt on either edge.
//     0b1100 ==> Interrupt when logic one.

#define  PORTB_PCR31_ISF_MASK        0x1000000u
#define  PORTB_PCR31_ISF_SHIFT       24
//   Interrupt Status Flag
//     0b0 ==> Configured interrupt is not detected.
//     0b1 ==> Configured interrupt is detected. If the pin is configured to generate a DMA request, then the corresponding flag will be cleared automatically at the completion of the requested DMA transfer. Otherwise, the flag remains set until a logic one is written to the flag. If the pin is configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately after it is cleared.

#define  PORTB_GPCLR_GPWD_MASK       0x10u
#define  PORTB_GPCLR_GPWD_SHIFT      0
#define  PORTB_GPCLR_GPWD(x)         (((uint32_t)(((uint32_t)(x))<<PORTB_GPCLR_GPWD_SHIFT))&PORTB_GPCLR_GPWD_MASK)
//   Global Pin Write Data

#define  PORTB_GPCLR_GPWE_MASK       0x100000u
#define  PORTB_GPCLR_GPWE_SHIFT      16
#define  PORTB_GPCLR_GPWE(x)         (((uint32_t)(((uint32_t)(x))<<PORTB_GPCLR_GPWE_SHIFT))&PORTB_GPCLR_GPWE_MASK)
//   Global Pin Write Enable
//     0b0 ==> Corresponding Pin Control Register is not updated with the value in GPWD.
//     0b1 ==> Corresponding Pin Control Register is updated with the value in GPWD.

#define  PORTB_GPCHR_GPWD_MASK       0x10u
#define  PORTB_GPCHR_GPWD_SHIFT      0
#define  PORTB_GPCHR_GPWD(x)         (((uint32_t)(((uint32_t)(x))<<PORTB_GPCHR_GPWD_SHIFT))&PORTB_GPCHR_GPWD_MASK)
//   Global Pin Write Data

#define  PORTB_GPCHR_GPWE_MASK       0x100000u
#define  PORTB_GPCHR_GPWE_SHIFT      16
#define  PORTB_GPCHR_GPWE(x)         (((uint32_t)(((uint32_t)(x))<<PORTB_GPCHR_GPWE_SHIFT))&PORTB_GPCHR_GPWE_MASK)
//   Global Pin Write Enable
//     0b0 ==> Corresponding Pin Control Register is not updated with the value in GPWD.
//     0b1 ==> Corresponding Pin Control Register is updated with the value in GPWD.

#define  PORTB_ISFR_ISF_MASK         0x20u
#define  PORTB_ISFR_ISF_SHIFT        0
#define  PORTB_ISFR_ISF(x)           (((uint32_t)(((uint32_t)(x))<<PORTB_ISFR_ISF_SHIFT))&PORTB_ISFR_ISF_MASK)
//   Interrupt Status Flag
//     0b0 ==> Configured interrupt is not detected.
//     0b1 ==> Configured interrupt is detected. If the pin is configured to generate a DMA request, then the corresponding flag will be cleared automatically at the completion of the requested DMA transfer. Otherwise, the flag remains set until a logic one is written to the flag. If the pin is configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately after it is cleared.

#define  RCM_SRS0_WAKEUP_MASK        0x1u
#define  RCM_SRS0_WAKEUP_SHIFT       0
//   Low Leakage Wakeup Reset
//     0b0 ==> Reset not caused by LLWU module wakeup source
//     0b1 ==> Reset caused by LLWU module wakeup source

#define  RCM_SRS0_LVD_MASK           0x2u
#define  RCM_SRS0_LVD_SHIFT          1
//   Low-Voltage Detect Reset
//     0b0 ==> Reset not caused by LVD trip or POR
//     0b1 ==> Reset caused by LVD trip or POR

#define  RCM_SRS0_LOC_MASK           0x4u
#define  RCM_SRS0_LOC_SHIFT          2
//   Loss-of-Clock Reset
//     0b0 ==> Reset not caused by a loss of external clock.
//     0b1 ==> Reset caused by a loss of external clock.

#define  RCM_SRS0_WDOG_MASK          0x20u
#define  RCM_SRS0_WDOG_SHIFT         5
//   Watchdog
//     0b0 ==> Reset not caused by watchdog timeout
//     0b1 ==> Reset caused by watchdog timeout

#define  RCM_SRS0_PIN_MASK           0x40u
#define  RCM_SRS0_PIN_SHIFT          6
//   External Reset Pin
//     0b0 ==> Reset not caused by external reset pin
//     0b1 ==> Reset caused by external reset pin

#define  RCM_SRS0_POR_MASK           0x80u
#define  RCM_SRS0_POR_SHIFT          7
//   Power-On Reset
//     0b0 ==> Reset not caused by POR
//     0b1 ==> Reset caused by POR

#define  RCM_SRS1_LOCKUP_MASK        0x2u
#define  RCM_SRS1_LOCKUP_SHIFT       1
//   Core Lockup
//     0b0 ==> Reset not caused by core LOCKUP event
//     0b1 ==> Reset caused by core LOCKUP event

#define  RCM_SRS1_SW_MASK            0x4u
#define  RCM_SRS1_SW_SHIFT           2
//   Software
//     0b0 ==> Reset not caused by software setting of SYSRESETREQ bit
//     0b1 ==> Reset caused by software setting of SYSRESETREQ bit

#define  RCM_SRS1_MDM_AP_MASK        0x8u
#define  RCM_SRS1_MDM_AP_SHIFT       3
//   MDM-AP System Reset Request
//     0b0 ==> Reset not caused by host debugger system setting of the System Reset Request bit
//     0b1 ==> Reset caused by host debugger system setting of the System Reset Request bit

#define  RCM_SRS1_SACKERR_MASK       0x20u
#define  RCM_SRS1_SACKERR_SHIFT      5
//   Stop Mode Acknowledge Error Reset
//     0b0 ==> Reset not caused by peripheral failure to acknowledge attempt to enter stop mode
//     0b1 ==> Reset caused by peripheral failure to acknowledge attempt to enter stop mode

#define  RCM_RPFC_RSTFLTSRW_MASK     0x2u
#define  RCM_RPFC_RSTFLTSRW_SHIFT    0
#define  RCM_RPFC_RSTFLTSRW(x)       (((uint8_t)(((uint8_t)(x))<<RCM_RPFC_RSTFLTSRW_SHIFT))&RCM_RPFC_RSTFLTSRW_MASK)
//   Reset Pin Filter Select in Run and Wait Modes
//     0b00 ==> All filtering disabled
//     0b01 ==> Bus clock filter enabled for normal operation
//     0b10 ==> LPO clock filter enabled for normal operation
//     0b11 ==> Reserved

#define  RCM_RPFC_RSTFLTSS_MASK      0x4u
#define  RCM_RPFC_RSTFLTSS_SHIFT     2
//   Reset Pin Filter Select in Stop Mode
//     0b0 ==> All filtering disabled
//     0b1 ==> LPO clock filter enabled

#define  RCM_RPFW_RSTFLTSEL_MASK     0x5u
#define  RCM_RPFW_RSTFLTSEL_SHIFT    0
#define  RCM_RPFW_RSTFLTSEL(x)       (((uint8_t)(((uint8_t)(x))<<RCM_RPFW_RSTFLTSEL_SHIFT))&RCM_RPFW_RSTFLTSEL_MASK)
//   Reset Pin Filter Bus Clock Select
//     0b00000 ==> Bus clock filter count is 1
//     0b00001 ==> Bus clock filter count is 2
//     0b00010 ==> Bus clock filter count is 3
//     0b00011 ==> Bus clock filter count is 4
//     0b00100 ==> Bus clock filter count is 5
//     0b00101 ==> Bus clock filter count is 6
//     0b00110 ==> Bus clock filter count is 7
//     0b00111 ==> Bus clock filter count is 8
//     0b01000 ==> Bus clock filter count is 9
//     0b01001 ==> Bus clock filter count is 10
//     0b01010 ==> Bus clock filter count is 11
//     0b01011 ==> Bus clock filter count is 12
//     0b01100 ==> Bus clock filter count is 13
//     0b01101 ==> Bus clock filter count is 14
//     0b01110 ==> Bus clock filter count is 15
//     0b01111 ==> Bus clock filter count is 16
//     0b10000 ==> Bus clock filter count is 17
//     0b10001 ==> Bus clock filter count is 18
//     0b10010 ==> Bus clock filter count is 19
//     0b10011 ==> Bus clock filter count is 20
//     0b10100 ==> Bus clock filter count is 21
//     0b10101 ==> Bus clock filter count is 22
//     0b10110 ==> Bus clock filter count is 23
//     0b10111 ==> Bus clock filter count is 24
//     0b11000 ==> Bus clock filter count is 25
//     0b11001 ==> Bus clock filter count is 26
//     0b11010 ==> Bus clock filter count is 27
//     0b11011 ==> Bus clock filter count is 28
//     0b11100 ==> Bus clock filter count is 29
//     0b11101 ==> Bus clock filter count is 30
//     0b11110 ==> Bus clock filter count is 31
//     0b11111 ==> Bus clock filter count is 32

#define  RTC_TSR_TSR_MASK            0x20u
#define  RTC_TSR_TSR_SHIFT           0
#define  RTC_TSR_TSR(x)              (((uint32_t)(((uint32_t)(x))<<RTC_TSR_TSR_SHIFT))&RTC_TSR_TSR_MASK)
//   Time Seconds Register

#define  RTC_TPR_TPR_MASK            0x10u
#define  RTC_TPR_TPR_SHIFT           0
#define  RTC_TPR_TPR(x)              (((uint32_t)(((uint32_t)(x))<<RTC_TPR_TPR_SHIFT))&RTC_TPR_TPR_MASK)
//   Time Prescaler Register

#define  RTC_TAR_TAR_MASK            0x20u
#define  RTC_TAR_TAR_SHIFT           0
#define  RTC_TAR_TAR(x)              (((uint32_t)(((uint32_t)(x))<<RTC_TAR_TAR_SHIFT))&RTC_TAR_TAR_MASK)
//   Time Alarm Register

