Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  RTC_TCR_TCR_MASK            0x8u
#define  RTC_TCR_TCR_SHIFT           0
#define  RTC_TCR_TCR(x)              (((uint32_t)(((uint32_t)(x))<<RTC_TCR_TCR_SHIFT))&RTC_TCR_TCR_MASK)
//   Time Compensation Register
//     0b10000000 ==> Time Prescaler Register overflows every 32896 clock cycles.
//     0b11111111 ==> Time Prescaler Register overflows every 32769 clock cycles.
//     0b0 ==> Time Prescaler Register overflows every 32768 clock cycles.
//     0b1 ==> Time Prescaler Register overflows every 32767 clock cycles.
//     0b1111111 ==> Time Prescaler Register overflows every 32641 clock cycles.

#define  RTC_TCR_CIR_MASK            0x800u
#define  RTC_TCR_CIR_SHIFT           8
#define  RTC_TCR_CIR(x)              (((uint32_t)(((uint32_t)(x))<<RTC_TCR_CIR_SHIFT))&RTC_TCR_CIR_MASK)
//   Compensation Interval Register

#define  RTC_TCR_TCV_MASK            0x80000u
#define  RTC_TCR_TCV_SHIFT           16
#define  RTC_TCR_TCV(x)              (((uint32_t)(((uint32_t)(x))<<RTC_TCR_TCV_SHIFT))&RTC_TCR_TCV_MASK)
//   Time Compensation Value

#define  RTC_TCR_CIC_MASK            0x8000000u
#define  RTC_TCR_CIC_SHIFT           24
#define  RTC_TCR_CIC(x)              (((uint32_t)(((uint32_t)(x))<<RTC_TCR_CIC_SHIFT))&RTC_TCR_CIC_MASK)
//   Compensation Interval Counter

#define  RTC_CR_SWR_MASK             0x1u
#define  RTC_CR_SWR_SHIFT            0
//   Software Reset
//     0b0 ==> No effect.
//     0b1 ==> Resets all RTC registers except for the SWR bit . The SWR bit is cleared by POR and by software explicitly clearing it.

#define  RTC_CR_WPE_MASK             0x2u
#define  RTC_CR_WPE_SHIFT            1
//   Wakeup Pin Enable
//     0b0 ==> Wakeup pin is disabled.
//     0b1 ==> Wakeup pin is enabled and wakeup pin asserts if the RTC interrupt asserts .

#define  RTC_CR_SUP_MASK             0x4u
#define  RTC_CR_SUP_SHIFT            2
//   Supervisor Access
//     0b0 ==> Non-supervisor mode write accesses are not supported and generate a bus error.
//     0b1 ==> Non-supervisor mode write accesses are supported.

#define  RTC_CR_UM_MASK              0x8u
#define  RTC_CR_UM_SHIFT             3
//   Update Mode
//     0b0 ==> Registers cannot be written when locked.
//     0b1 ==> Registers can be written when locked under limited conditions.

#define  RTC_CR_OSCE_MASK            0x100u
#define  RTC_CR_OSCE_SHIFT           8
//   Oscillator Enable
//     0b0 ==> 32.768 kHz oscillator is disabled.
//     0b1 ==> 32.768 kHz oscillator is enabled. After setting this bit, wait the oscillator startup time before enabling the time counter to allow the 32.768 kHz clock time to stabilize.

#define  RTC_CR_CLKO_MASK            0x200u
#define  RTC_CR_CLKO_SHIFT           9
//   Clock Output
//     0b0 ==> The 32 kHz clock is output to other peripherals.
//     0b1 ==> The 32 kHz clock is not output to other peripherals.

#define  RTC_CR_SC16P_MASK           0x400u
#define  RTC_CR_SC16P_SHIFT          10
//   Oscillator 16pF Load Configure
//     0b0 ==> Disable the load.
//     0b1 ==> Enable the additional load.

#define  RTC_CR_SC8P_MASK            0x800u
#define  RTC_CR_SC8P_SHIFT           11
//   Oscillator 8pF Load Configure
//     0b0 ==> Disable the load.
//     0b1 ==> Enable the additional load.

#define  RTC_CR_SC4P_MASK            0x1000u
#define  RTC_CR_SC4P_SHIFT           12
//   Oscillator 4pF Load Configure
//     0b0 ==> Disable the load.
//     0b1 ==> Enable the additional load.

#define  RTC_CR_SC2P_MASK            0x2000u
#define  RTC_CR_SC2P_SHIFT           13
//   Oscillator 2pF Load Configure
//     0b0 ==> Disable the load.
//     0b1 ==> Enable the additional load.

#define  RTC_SR_TIF_MASK             0x1u
#define  RTC_SR_TIF_SHIFT            0
//   Time Invalid Flag
//     0b0 ==> Time is valid.
//     0b1 ==> Time is invalid and time counter is read as zero.

#define  RTC_SR_TOF_MASK             0x2u
#define  RTC_SR_TOF_SHIFT            1
//   Time Overflow Flag
//     0b0 ==> Time overflow has not occurred.
//     0b1 ==> Time overflow has occurred and time counter is read as zero.

#define  RTC_SR_TAF_MASK             0x4u
#define  RTC_SR_TAF_SHIFT            2
//   Time Alarm Flag
//     0b0 ==> Time alarm has not occurred.
//     0b1 ==> Time alarm has occurred.

#define  RTC_SR_TCE_MASK             0x10u
#define  RTC_SR_TCE_SHIFT            4
//   Time Counter Enable
//     0b0 ==> Time counter is disabled.
//     0b1 ==> Time counter is enabled.

#define  RTC_LR_TCL_MASK             0x8u
#define  RTC_LR_TCL_SHIFT            3
//   Time Compensation Lock
//     0b0 ==> Time Compensation Register is locked and writes are ignored.
//     0b1 ==> Time Compensation Register is not locked and writes complete as normal.

#define  RTC_LR_CRL_MASK             0x10u
#define  RTC_LR_CRL_SHIFT            4
//   Control Register Lock
//     0b0 ==> Control Register is locked and writes are ignored.
//     0b1 ==> Control Register is not locked and writes complete as normal.

#define  RTC_LR_SRL_MASK             0x20u
#define  RTC_LR_SRL_SHIFT            5
//   Status Register Lock
//     0b0 ==> Status Register is locked and writes are ignored.
//     0b1 ==> Status Register is not locked and writes complete as normal.

#define  RTC_LR_LRL_MASK             0x40u
#define  RTC_LR_LRL_SHIFT            6
//   Lock Register Lock
//     0b0 ==> Lock Register is locked and writes are ignored.
//     0b1 ==> Lock Register is not locked and writes complete as normal.

#define  RTC_IER_TIIE_MASK           0x1u
#define  RTC_IER_TIIE_SHIFT          0
//   Time Invalid Interrupt Enable
//     0b0 ==> Time invalid flag does not generate an interrupt.
//     0b1 ==> Time invalid flag does generate an interrupt.

#define  RTC_IER_TOIE_MASK           0x2u
#define  RTC_IER_TOIE_SHIFT          1
//   Time Overflow Interrupt Enable
//     0b0 ==> Time overflow flag does not generate an interrupt.
//     0b1 ==> Time overflow flag does generate an interrupt.

#define  RTC_IER_TAIE_MASK           0x4u
#define  RTC_IER_TAIE_SHIFT          2
//   Time Alarm Interrupt Enable
//     0b0 ==> Time alarm flag does not generate an interrupt.
//     0b1 ==> Time alarm flag does generate an interrupt.

#define  RTC_IER_TSIE_MASK           0x10u
#define  RTC_IER_TSIE_SHIFT          4
//   Time Seconds Interrupt Enable
//     0b0 ==> Seconds interrupt is disabled.
//     0b1 ==> Seconds interrupt is enabled.

#define  SIM_SOPT1_OSC32KSEL_MASK    0x80000u
#define  SIM_SOPT1_OSC32KSEL_SHIFT   18
#define  SIM_SOPT1_OSC32KSEL(x)      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_OSC32KSEL_SHIFT))&SIM_SOPT1_OSC32KSEL_MASK)
//   32K oscillator clock select
//     0b00 ==> System oscillator (OSC32KCLK)
//     0b01 ==> Reserved
//     0b10 ==> RTC_CLKIN
//     0b11 ==> LPO 1kHz

#define  SIM_SOPT2_RTCCLKOUTSEL_MASK 0x10u
#define  SIM_SOPT2_RTCCLKOUTSEL_SHIFT 4
//   RTC clock out select
//     0b0 ==> RTC 1 Hz clock is output on the RTC_CLKOUT pin.
//     0b1 ==> OSCERCLK0 clock is output on the RTC_CLKOUT pin.

#define  SIM_SOPT2_CLKOUTSEL_MASK    0x60u
#define  SIM_SOPT2_CLKOUTSEL_SHIFT   5
#define  SIM_SOPT2_CLKOUTSEL(x)      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_CLKOUTSEL_SHIFT))&SIM_SOPT2_CLKOUTSEL_MASK)
//   CLKOUT select
//     0b000 ==> Reserved
//     0b001 ==> Reserved
//     0b010 ==> Bus clock
//     0b011 ==> LPO clock (1 kHz)
//     0b100 ==> MCGIRCLK
//     0b101 ==> Reserved
//     0b110 ==> OSCERCLK0
//     0b111 ==> Reserved

#define  SIM_SOPT2_LPTPMSRC_MASK     0x2000000u
#define  SIM_SOPT2_LPTPMSRC_SHIFT    24
#define  SIM_SOPT2_LPTPMSRC(x)       (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_LPTPMSRC_SHIFT))&SIM_SOPT2_LPTPMSRC_MASK)
//   LPTPM clock source select
//     0b00 ==> Clock disabled
//     0b01 ==> MCGFLLCLK clock
//     0b10 ==> OSCERCLK clock
//     0b11 ==> MCGIRCLK clock

#define  SIM_SOPT2_UART0SRC_MASK     0x8000000u
#define  SIM_SOPT2_UART0SRC_SHIFT    26
#define  SIM_SOPT2_UART0SRC(x)       (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_UART0SRC_SHIFT))&SIM_SOPT2_UART0SRC_MASK)
//   UART0 clock source select
//     0b00 ==> Clock disabled
//     0b01 ==> MCGFLLCLK clock
//     0b10 ==> OSCERCLK clock
//     0b11 ==> MCGIRCLK clock

#define  SIM_SOPT4_LPTPM1CH0SRC_MASK 0x40000u
#define  SIM_SOPT4_LPTPM1CH0SRC_SHIFT 18
//   LPTPM1 channel 0 input capture source select
//     0b0 ==> LPTPM1_CH0 signal
//     0b1 ==> CMP0 output

