Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  SIM_SCGC6_FTF_MASK          0x1u
#define  SIM_SCGC6_FTF_SHIFT         0
//   Flash Memory Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC6_DMAMUX_MASK       0x2u
#define  SIM_SCGC6_DMAMUX_SHIFT      1
//   DMA Mux Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC6_PIT_MASK          0x800000u
#define  SIM_SCGC6_PIT_SHIFT         23
//   PIT Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC6_LPTPM0_MASK       0x1000000u
#define  SIM_SCGC6_LPTPM0_SHIFT      24
//   LPTPM0 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC6_LPTPM1_MASK       0x2000000u
#define  SIM_SCGC6_LPTPM1_SHIFT      25
//   LPTPM1 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC6_ADC0_MASK         0x8000000u
#define  SIM_SCGC6_ADC0_SHIFT        27
//   ADC0 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC6_RTC_MASK          0x20000000u
#define  SIM_SCGC6_RTC_SHIFT         29
//   RTC Access Control
//     0b0 ==> Access and interrupts disabled
//     0b1 ==> Access and interrupts enabled

#define  SIM_SCGC6_DAC0_MASK         0x80000000u
#define  SIM_SCGC6_DAC0_SHIFT        31
//   DAC0 Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_SCGC7_DMA_MASK          0x100u
#define  SIM_SCGC7_DMA_SHIFT         8
//   DMA Clock Gate Control
//     0b0 ==> Clock disabled
//     0b1 ==> Clock enabled

#define  SIM_CLKDIV1_OUTDIV4_MASK    0x30000u
#define  SIM_CLKDIV1_OUTDIV4_SHIFT   16
#define  SIM_CLKDIV1_OUTDIV4(x)      (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV4_SHIFT))&SIM_CLKDIV1_OUTDIV4_MASK)
//   Clock 4 output divider value
//     0b000 ==> Divide-by-1.
//     0b001 ==> Divide-by-2.
//     0b010 ==> Divide-by-3.
//     0b011 ==> Divide-by-4.
//     0b100 ==> Divide-by-5.
//     0b101 ==> Divide-by-6.
//     0b110 ==> Divide-by-7.
//     0b111 ==> Divide-by-8.

#define  SIM_CLKDIV1_OUTDIV1_MASK    0x40000000u
#define  SIM_CLKDIV1_OUTDIV1_SHIFT   28
#define  SIM_CLKDIV1_OUTDIV1(x)      (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV1_SHIFT))&SIM_CLKDIV1_OUTDIV1_MASK)
//   Clock 1 output divider value
//     0b0000 ==> Divide-by-1.
//     0b0001 ==> Divide-by-2.
//     0b0010 ==> Divide-by-3.
//     0b0011 ==> Divide-by-4.
//     0b0100 ==> Divide-by-5.
//     0b0101 ==> Divide-by-6.
//     0b0110 ==> Divide-by-7.
//     0b0111 ==> Divide-by-8.
//     0b1000 ==> Divide-by-9.
//     0b1001 ==> Divide-by-10.
//     0b1010 ==> Divide-by-11.
//     0b1011 ==> Divide-by-12.
//     0b1100 ==> Divide-by-13.
//     0b1101 ==> Divide-by-14.
//     0b1110 ==> Divide-by-15.
//     0b1111 ==> Divide-by-16.

#define  SIM_FCFG1_FLASHDIS_MASK     0x1u
#define  SIM_FCFG1_FLASHDIS_SHIFT    0
//   Flash Disable
//     0b0 ==> Flash is enabled
//     0b1 ==> Flash is disabled

#define  SIM_FCFG1_FLASHDOZE_MASK    0x2u
#define  SIM_FCFG1_FLASHDOZE_SHIFT   1
//   Flash Doze
//     0b0 ==> Flash remains enabled during Doze mode
//     0b1 ==> Flash is disabled for the duration of Doze mode

#define  SIM_FCFG1_PFSIZE_MASK       0x4000000u
#define  SIM_FCFG1_PFSIZE_SHIFT      24
#define  SIM_FCFG1_PFSIZE(x)         (((uint32_t)(((uint32_t)(x))<<SIM_FCFG1_PFSIZE_SHIFT))&SIM_FCFG1_PFSIZE_MASK)
//   Program flash size
//     0b0000 ==> 8 KB of program flash memory, 0.25 KB protection region
//     0b0001 ==> 16 KB of program flash memory, 0.5 KB protection region
//     0b0011 ==> 32 KB of program flash memory, 1 KB protection region
//     0b0101 ==> 64 KB of program flash memory, 2 KB protection region
//     0b0111 ==> 128 KB of program flash memory, 4 KB protection region
//     0b1001 ==> 256 KB of program flash memory, 4 KB protection region
//     0b1111 ==> 32 KB of program flash memory, 1 KB protection region

#define  SIM_FCFG2_MAXADDR_MASK      0x7000000u
#define  SIM_FCFG2_MAXADDR_SHIFT     24
#define  SIM_FCFG2_MAXADDR(x)        (((uint32_t)(((uint32_t)(x))<<SIM_FCFG2_MAXADDR_SHIFT))&SIM_FCFG2_MAXADDR_MASK)
//   Max address block

#define  SIM_UIDMH_UID_MASK          0x10u
#define  SIM_UIDMH_UID_SHIFT         0
#define  SIM_UIDMH_UID(x)            (((uint32_t)(((uint32_t)(x))<<SIM_UIDMH_UID_SHIFT))&SIM_UIDMH_UID_MASK)
//   Unique Identification

#define  SIM_UIDML_UID_MASK          0x20u
#define  SIM_UIDML_UID_SHIFT         0
#define  SIM_UIDML_UID(x)            (((uint32_t)(((uint32_t)(x))<<SIM_UIDML_UID_SHIFT))&SIM_UIDML_UID_MASK)
//   Unique Identification

#define  SIM_UIDL_UID_MASK           0x20u
#define  SIM_UIDL_UID_SHIFT          0
#define  SIM_UIDL_UID(x)             (((uint32_t)(((uint32_t)(x))<<SIM_UIDL_UID_SHIFT))&SIM_UIDL_UID_MASK)
//   Unique Identification

#define  SIM_COPC_COPW_MASK          0x1u
#define  SIM_COPC_COPW_SHIFT         0
//   COP windowed mode
//     0b0 ==> Normal mode
//     0b1 ==> Windowed mode

#define  SIM_COPC_COPCLKS_MASK       0x2u
#define  SIM_COPC_COPCLKS_SHIFT      1
//   COP Clock Select
//     0b0 ==> Internal 1 kHz clock is source to COP
//     0b1 ==> Bus clock is source to COP

#define  SIM_COPC_COPT_MASK          0x8u
#define  SIM_COPC_COPT_SHIFT         2
#define  SIM_COPC_COPT(x)            (((uint32_t)(((uint32_t)(x))<<SIM_COPC_COPT_SHIFT))&SIM_COPC_COPT_MASK)
//   COP Watchdog Timeout
//     0b00 ==> COP disabled
//     0b01 ==> COP timeout after 2^5 LPO cycles or 2^13 bus clock cycles
//     0b10 ==> COP timeout after 2^8 LPO cycles or 2^16 bus clock cycles
//     0b11 ==> COP timeout after 2^10 LPO cycles or 2^18 bus clock cycles

#define  SIM_SRVCOP_SRVCOP_MASK      0x8u
#define  SIM_SRVCOP_SRVCOP_SHIFT     0
#define  SIM_SRVCOP_SRVCOP(x)        (((uint32_t)(((uint32_t)(x))<<SIM_SRVCOP_SRVCOP_SHIFT))&SIM_SRVCOP_SRVCOP_MASK)
//   Sevice COP Register

#define  SMC_PMPROT_AVLLS_MASK       0x2u
#define  SMC_PMPROT_AVLLS_SHIFT      1
//   Allow Very-Low-Leakage Stop Mode
//     0b0 ==> Any VLLSx mode is not allowed
//     0b1 ==> Any VLLSx mode is allowed

#define  SMC_PMPROT_ALLS_MASK        0x8u
#define  SMC_PMPROT_ALLS_SHIFT       3
//   Allow Low-Leakage Stop Mode
//     0b0 ==> LLS is not allowed
//     0b1 ==> LLS is allowed

