Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  SMC_PMPROT_AVLP_MASK        0x20u
#define  SMC_PMPROT_AVLP_SHIFT       5
//   Allow Very-Low-Power Modes
//     0b0 ==> VLPR, VLPW and VLPS are not allowed
//     0b1 ==> VLPR, VLPW and VLPS are allowed

#define  SMC_PMCTRL_STOPM_MASK       0x3u
#define  SMC_PMCTRL_STOPM_SHIFT      0
#define  SMC_PMCTRL_STOPM(x)         (((uint8_t)(((uint8_t)(x))<<SMC_PMCTRL_STOPM_SHIFT))&SMC_PMCTRL_STOPM_MASK)
//   Stop Mode Control
//     0b000 ==> Normal Stop (STOP)
//     0b001 ==> Reserved
//     0b010 ==> Very-Low-Power Stop (VLPS)
//     0b011 ==> Low-Leakage Stop (LLS)
//     0b100 ==> Very-Low-Leakage Stop (VLLSx)
//     0b101 ==> Reserved
//     0b110 ==> Reseved
//     0b111 ==> Reserved

#define  SMC_PMCTRL_STOPA_MASK       0x8u
#define  SMC_PMCTRL_STOPA_SHIFT      3
//   Stop Aborted
//     0b0 ==> The previous stop mode entry was successsful.
//     0b1 ==> The previous stop mode entry was aborted.

#define  SMC_PMCTRL_RUNM_MASK        0x40u
#define  SMC_PMCTRL_RUNM_SHIFT       5
#define  SMC_PMCTRL_RUNM(x)          (((uint8_t)(((uint8_t)(x))<<SMC_PMCTRL_RUNM_SHIFT))&SMC_PMCTRL_RUNM_MASK)
//   Run Mode Control
//     0b00 ==> Normal Run mode (RUN)
//     0b01 ==> Reserved
//     0b10 ==> Very-Low-Power Run mode (VLPR)
//     0b11 ==> Reserved

#define  SMC_STOPCTRL_VLLSM_MASK     0x3u
#define  SMC_STOPCTRL_VLLSM_SHIFT    0
#define  SMC_STOPCTRL_VLLSM(x)       (((uint8_t)(((uint8_t)(x))<<SMC_STOPCTRL_VLLSM_SHIFT))&SMC_STOPCTRL_VLLSM_MASK)
//   VLLS Mode Control.
//     0b000 ==> VLLS0
//     0b001 ==> VLLS1
//     0b010 ==> VLLS2
//     0b011 ==> VLLS3
//     0b100 ==> Reserved
//     0b101 ==> Reserved
//     0b110 ==> Reserved
//     0b111 ==> Reserved

#define  SMC_STOPCTRL_PORPO_MASK     0x20u
#define  SMC_STOPCTRL_PORPO_SHIFT    5
//   POR Power Option
//     0b0 ==> POR detect circuit is enabled in VLLS0
//     0b1 ==> POR detect circuit is disabled in VLLS0

#define  SMC_STOPCTRL_PSTOPO_MASK    0x80u
#define  SMC_STOPCTRL_PSTOPO_SHIFT   6
#define  SMC_STOPCTRL_PSTOPO(x)      (((uint8_t)(((uint8_t)(x))<<SMC_STOPCTRL_PSTOPO_SHIFT))&SMC_STOPCTRL_PSTOPO_MASK)
//   Partial Stop Option
//     0b00 ==> STOP - Normal Stop mode
//     0b01 ==> PSTOP1 - Partial Stop with both system and bus clocks disabled
//     0b10 ==> PSTOP2 - Partial Stop with system clock disabled and bus clock enabled
//     0b11 ==> Reserved

#define  SMC_PMSTAT_PMSTAT_MASK      0x7u
#define  SMC_PMSTAT_PMSTAT_SHIFT     0
#define  SMC_PMSTAT_PMSTAT(x)        (((uint8_t)(((uint8_t)(x))<<SMC_PMSTAT_PMSTAT_SHIFT))&SMC_PMSTAT_PMSTAT_MASK)

#define  SPI0_C1_LSBFE_MASK          0x1u
#define  SPI0_C1_LSBFE_SHIFT         0
//   LSB first (shifter direction)
//     0b0 ==> SPI serial data transfers start with most significant bit
//     0b1 ==> SPI serial data transfers start with least significant bit

#define  SPI0_C1_SSOE_MASK           0x2u
#define  SPI0_C1_SSOE_SHIFT          1
//   Slave select output enable
//     0b0 ==> When MODFEN is 0: In master mode, SS pin function is general-purpose I/O (not SPI). In slave mode, SS pin function is slave select input. When MODFEN is 1: In master mode, SS pin function is SS input for mode fault. In slave mode, SS pin function is slave select input.
//     0b1 ==> When MODFEN is 0: In master mode, SS pin function is general-purpose I/O (not SPI). In slave mode, SS pin function is slave select input. When MODFEN is 1: In master mode, SS pin function is automatic SS output. In slave mode: SS pin function is slave select input.

#define  SPI0_C1_CPHA_MASK           0x4u
#define  SPI0_C1_CPHA_SHIFT          2
//   Clock phase
//     0b0 ==> First edge on SPSCK occurs at the middle of the first cycle of a data transfer
//     0b1 ==> First edge on SPSCK occurs at the start of the first cycle of a data transfer

#define  SPI0_C1_CPOL_MASK           0x8u
#define  SPI0_C1_CPOL_SHIFT          3
//   Clock polarity
//     0b0 ==> Active-high SPI clock (idles low)
//     0b1 ==> Active-low SPI clock (idles high)

#define  SPI0_C1_MSTR_MASK           0x10u
#define  SPI0_C1_MSTR_SHIFT          4
//   Master/slave mode select
//     0b0 ==> SPI module configured as a slave SPI device
//     0b1 ==> SPI module configured as a master SPI device

#define  SPI0_C1_SPTIE_MASK          0x20u
#define  SPI0_C1_SPTIE_SHIFT         5
//   SPI transmit interrupt enable
//     0b0 ==> Interrupts from SPTEF inhibited (use polling)
//     0b1 ==> When SPTEF is 1, hardware interrupt requested

#define  SPI0_C1_SPE_MASK            0x40u
#define  SPI0_C1_SPE_SHIFT           6
//   SPI system enable
//     0b0 ==> SPI system inactive
//     0b1 ==> SPI system enabled

#define  SPI0_C1_SPIE_MASK           0x80u
#define  SPI0_C1_SPIE_SHIFT          7
//   SPI interrupt enable: for SPRF and MODF
//     0b0 ==> Interrupts from SPRF and MODF are inhibited-use polling
//     0b1 ==> Request a hardware interrupt when SPRF or MODF is 1

#define  SPI0_C2_SPC0_MASK           0x1u
#define  SPI0_C2_SPC0_SHIFT          0
//   SPI pin control 0
//     0b0 ==> SPI uses separate pins for data input and data output (pin mode is normal). In master mode of operation: MISO is master in and MOSI is master out. In slave mode of operation: MISO is slave out and MOSI is slave in.
//     0b1 ==> SPI configured for single-wire bidirectional operation (pin mode is bidirectional). In master mode of operation: MISO is not used by SPI; MOSI is master in when BIDIROE is 0 or master I/O when BIDIROE is 1. In slave mode of operation: MISO is slave in when BIDIROE is 0 or slave I/O when BIDIROE is 1; MOSI is not used by SPI.

#define  SPI0_C2_SPISWAI_MASK        0x2u
#define  SPI0_C2_SPISWAI_SHIFT       1
//   SPI stop in wait mode
//     0b0 ==> SPI clocks continue to operate in wait mode
//     0b1 ==> SPI clocks stop when the MCU enters wait mode

#define  SPI0_C2_RXDMAE_MASK         0x4u
#define  SPI0_C2_RXDMAE_SHIFT        2
//   Receive DMA enable
//     0b0 ==> DMA request for receive is disabled and interrupt from SPRF is allowed
//     0b1 ==> DMA request for receive is enabled and interrupt from SPRF is disabled

#define  SPI0_C2_BIDIROE_MASK        0x8u
#define  SPI0_C2_BIDIROE_SHIFT       3
//   Bidirectional mode output enable
//     0b0 ==> Output driver disabled so SPI data I/O pin acts as an input
//     0b1 ==> SPI I/O pin enabled as an output

