Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  SPI0_C2_MODFEN_MASK         0x10u
#define  SPI0_C2_MODFEN_SHIFT        4
//   Master mode-fault function enable
//     0b0 ==> Mode fault function disabled, master SS pin reverts to general-purpose I/O not controlled by SPI
//     0b1 ==> Mode fault function enabled, master SS pin acts as the mode fault input or the slave select output

#define  SPI0_C2_TXDMAE_MASK         0x20u
#define  SPI0_C2_TXDMAE_SHIFT        5
//   Transmit DMA enable
//     0b0 ==> DMA request for transmit is disabled and interrupt from SPTEF is allowed
//     0b1 ==> DMA request for transmit is enabled and interrupt from SPTEF is disabled

#define  SPI0_C2_SPLPIE_MASK         0x40u
#define  SPI0_C2_SPLPIE_SHIFT        6
//   SPI low power interrupt enable bit
//     0b0 ==> The SPI module cannot generate an asynchronous interrupt to wake the CPU from wait mode or stop mode.
//     0b1 ==> Under specific conditions, the SPI module can generate an asynchronous interrupt to wake the CPU from wait mode or stop mode.

#define  SPI0_C2_SPMIE_MASK          0x80u
#define  SPI0_C2_SPMIE_SHIFT         7
//   SPI match interrupt enable
//     0b0 ==> Interrupts from SPMF inhibited (use polling)
//     0b1 ==> When SPMF is 1, requests a hardware interrupt

#define  SPI0_BR_SPR_MASK            0x4u
#define  SPI0_BR_SPR_SHIFT           0
#define  SPI0_BR_SPR(x)              (((uint8_t)(((uint8_t)(x))<<SPI0_BR_SPR_SHIFT))&SPI0_BR_SPR_MASK)
//   SPI baud rate divisor
//     0b0000 ==> Baud rate divisor is 2
//     0b0001 ==> Baud rate divisor is 4
//     0b0010 ==> Baud rate divisor is 8
//     0b0011 ==> Baud rate divisor is 16
//     0b0100 ==> Baud rate divisor is 32
//     0b0101 ==> Baud rate divisor is 64
//     0b0110 ==> Baud rate divisor is 128
//     0b0111 ==> Baud rate divisor is 256
//     0b1000 ==> Baud rate divisor is 512

#define  SPI0_BR_SPPR_MASK           0x30u
#define  SPI0_BR_SPPR_SHIFT          4
#define  SPI0_BR_SPPR(x)             (((uint8_t)(((uint8_t)(x))<<SPI0_BR_SPPR_SHIFT))&SPI0_BR_SPPR_MASK)
//   SPI baud rate prescale divisor
//     0b000 ==> Baud rate prescaler divisor is 1
//     0b001 ==> Baud rate prescaler divisor is 2
//     0b010 ==> Baud rate prescaler divisor is 3
//     0b011 ==> Baud rate prescaler divisor is 4
//     0b100 ==> Baud rate prescaler divisor is 5
//     0b101 ==> Baud rate prescaler divisor is 6
//     0b110 ==> Baud rate prescaler divisor is 7
//     0b111 ==> Baud rate prescaler divisor is 8

#define  SPI0_S_MODF_MASK            0x10u
#define  SPI0_S_MODF_SHIFT           4
//   Master mode fault flag
//     0b0 ==> No mode fault error
//     0b1 ==> Mode fault error detected

#define  SPI0_S_SPTEF_MASK           0x20u
#define  SPI0_S_SPTEF_SHIFT          5
//   SPI transmit buffer empty flag
//     0b0 ==> SPI transmit buffer not empty
//     0b1 ==> SPI transmit buffer empty

#define  SPI0_S_SPMF_MASK            0x40u
#define  SPI0_S_SPMF_SHIFT           6
//   SPI match flag
//     0b0 ==> Value in the receive data buffer does not match the value in the M register
//     0b1 ==> Value in the receive data buffer matches the value in the M register

#define  SPI0_S_SPRF_MASK            0x80u
#define  SPI0_S_SPRF_SHIFT           7
//   SPI read buffer full flag
//     0b0 ==> No data available in the receive data buffer
//     0b1 ==> Data available in the receive data buffer

#define  SPI0_D_Bits_MASK            0x8u
#define  SPI0_D_Bits_SHIFT           0
#define  SPI0_D_Bits(x)              (((uint8_t)(((uint8_t)(x))<<SPI0_D_Bits_SHIFT))&SPI0_D_Bits_MASK)
//   Data (low byte)

#define  SPI0_M_Bits_MASK            0x8u
#define  SPI0_M_Bits_SHIFT           0
#define  SPI0_M_Bits(x)              (((uint8_t)(((uint8_t)(x))<<SPI0_M_Bits_SHIFT))&SPI0_M_Bits_MASK)
//   Hardware compare value (low byte)

#define  TSI0_GENCS_CURSW_MASK       0x2u
#define  TSI0_GENCS_CURSW_SHIFT      1
//   CURSW
//     0b0 ==> The current source pair are not swapped.
//     0b1 ==> The current source pair are swapped.

#define  TSI0_GENCS_EOSF_MASK        0x4u
#define  TSI0_GENCS_EOSF_SHIFT       2
//   End of Scan Flag
//     0b0 ==> Scan not complete.
//     0b1 ==> Scan complete.

#define  TSI0_GENCS_SCNIP_MASK       0x8u
#define  TSI0_GENCS_SCNIP_SHIFT      3
//   Scan In Progress Status
//     0b0 ==> No scan in progress.
//     0b1 ==> Scan in progress.

#define  TSI0_GENCS_STM_MASK         0x10u
#define  TSI0_GENCS_STM_SHIFT        4
//   Scan Trigger Mode
//     0b0 ==> Software trigger scan.
//     0b1 ==> Hardware trigger scan.

#define  TSI0_GENCS_STPE_MASK        0x20u
#define  TSI0_GENCS_STPE_SHIFT       5
//   TSI STOP Enable
//     0b0 ==> TSI is disabled when MCU goes into low power mode.
//     0b1 ==> Allows TSI to continue running in all low power modes.

#define  TSI0_GENCS_TSIIEN_MASK      0x40u
#define  TSI0_GENCS_TSIIEN_SHIFT     6
//   Touch Sensing Input Interrupt Enable
//     0b0 ==> TSI interrupt is disabled.
//     0b1 ==> TSI interrupt is enabled.

#define  TSI0_GENCS_TSIEN_MASK       0x80u
#define  TSI0_GENCS_TSIEN_SHIFT      7
//   Touch Sensing Input Module Enable
//     0b0 ==> TSI module disabled.
//     0b1 ==> TSI module enabled.

#define  TSI0_GENCS_NSCN_MASK        0x500u
#define  TSI0_GENCS_NSCN_SHIFT       8
#define  TSI0_GENCS_NSCN(x)          (((uint32_t)(((uint32_t)(x))<<TSI0_GENCS_NSCN_SHIFT))&TSI0_GENCS_NSCN_MASK)
//   NSCN
//     0b00000 ==> Once per electrode
//     0b00001 ==> Twice per electrode
//     0b00010 ==> 3 times per electrode
//     0b00011 ==> 4 times per electrode
//     0b00100 ==> 5 times per electrode
//     0b00101 ==> 6 times per electrode
//     0b00110 ==> 7 times per electrode
//     0b00111 ==> 8 times per electrode
//     0b01000 ==> 9 times per electrode
//     0b01001 ==> 10 times per electrode
//     0b01010 ==> 11 times per electrode
//     0b01011 ==> 12 times per electrode
//     0b01100 ==> 13 times per electrode
//     0b01101 ==> 14 times per electrode
//     0b01110 ==> 15 times per electrode
//     0b01111 ==> 16 times per electrode
//     0b10000 ==> 17 times per electrode
//     0b10001 ==> 18 times per electrode
//     0b10010 ==> 19 times per electrode
//     0b10011 ==> 20 times per electrode
//     0b10100 ==> 21 times per electrode
//     0b10101 ==> 22 times per electrode
//     0b10110 ==> 23 times per electrode
//     0b10111 ==> 24 times per electrode
//     0b11000 ==> 25 times per electrode
//     0b11001 ==> 26 times per electrode
//     0b11010 ==> 27 times per electrode
//     0b11011 ==> 28 times per electrode
//     0b11100 ==> 29 times per electrode
//     0b11101 ==> 30 times per electrode
//     0b11110 ==> 31 times per electrode
//     0b11111 ==> 32 times per electrode

#define  TSI0_GENCS_PS_MASK          0x6000u
#define  TSI0_GENCS_PS_SHIFT         13
#define  TSI0_GENCS_PS(x)            (((uint32_t)(((uint32_t)(x))<<TSI0_GENCS_PS_SHIFT))&TSI0_GENCS_PS_MASK)
//   PS
//     0b000 ==> Electrode Oscillator Frequency divided by 1
//     0b001 ==> Electrode Oscillator Frequency divided by 2
//     0b010 ==> Electrode Oscillator Frequency divided by 4
//     0b011 ==> Electrode Oscillator Frequency divided by 8
//     0b100 ==> Electrode Oscillator Frequency divided by 16
//     0b101 ==> Electrode Oscillator Frequency divided by 32
//     0b110 ==> Electrode Oscillator Frequency divided by 64
//     0b111 ==> Electrode Oscillator Frequency divided by 128

#define  TSI0_GENCS_EXTCHRG_MASK     0x30000u
#define  TSI0_GENCS_EXTCHRG_SHIFT    16
#define  TSI0_GENCS_EXTCHRG(x)       (((uint32_t)(((uint32_t)(x))<<TSI0_GENCS_EXTCHRG_SHIFT))&TSI0_GENCS_EXTCHRG_MASK)
//   EXTCHRG
//     0b000 ==> 500 nA.
//     0b001 ==> 1 μA.
//     0b010 ==> 2 μA.
//     0b011 ==> 4 μA.
//     0b100 ==> 8 μA.
//     0b101 ==> 16 μA.
//     0b110 ==> 32 μA.
//     0b111 ==> 64 μA.

#define  TSI0_GENCS_DVOLT_MASK       0x100000u
#define  TSI0_GENCS_DVOLT_SHIFT      19
#define  TSI0_GENCS_DVOLT(x)         (((uint32_t)(((uint32_t)(x))<<TSI0_GENCS_DVOLT_SHIFT))&TSI0_GENCS_DVOLT_MASK)
//   DVOLT
//     0b00 ==> DV = 1.03 V; VP = 1.33 V; Vm = 0.30 V.
//     0b01 ==> DV = 0.73 V; VP = 1.18 V; Vm = 0.45 V.
//     0b10 ==> DV = 0.43 V; VP = 1.03 V; Vm = 0.60 V.
//     0b11 ==> DV = 0.29 V; VP = 0.95 V; Vm = 0.67 V.

#define  TSI0_GENCS_REFCHRG_MASK     0x600000u
#define  TSI0_GENCS_REFCHRG_SHIFT    21
#define  TSI0_GENCS_REFCHRG(x)       (((uint32_t)(((uint32_t)(x))<<TSI0_GENCS_REFCHRG_SHIFT))&TSI0_GENCS_REFCHRG_MASK)
//   REFCHRG
//     0b000 ==> 500 nA.
//     0b001 ==> 1 μA.
//     0b010 ==> 2 μA.
//     0b011 ==> 4 μA.
//     0b100 ==> 8 μA.
//     0b101 ==> 16 μA.
//     0b110 ==> 32 μA.
//     0b111 ==> 64 μA.

