Kinetis/AN2295_Bootloader/an2295sw/src/Kinetis/CommonSource/headers/MKL05Z32LF4.h
#define  TSI0_GENCS_STATUS_SETUP_MASK 0x4000000u
#define  TSI0_GENCS_STATUS_SETUP_SHIFT 24
#define  TSI0_GENCS_STATUS_SETUP(x)  (((uint32_t)(((uint32_t)(x))<<TSI0_GENCS_STATUS_SETUP_SHIFT))&TSI0_GENCS_STATUS_SETUP_MASK)
//   TSI analog modes setup., especially, setting SETUP[3:2] to 2'b11 will configure TSI to noise detection mode.
//     0b0000 ==> No effect.
//     0b1100 ==> Set TSI analog to work in noise detection mode.

#define  TSI0_GENCS_ESOR_MASK        0x10000000u
#define  TSI0_GENCS_ESOR_SHIFT       28
//   End-of-scan or Out-of-Range Interrupt Selection
//     0b0 ==> Out-of-range interrupt is allowed.
//     0b1 ==> End-of-scan interrupt is allowed.

#define  TSI0_GENCS_OUTRGF_MASK      0x80000000u
#define  TSI0_GENCS_OUTRGF_SHIFT     31
//   Out of Range Flag.

#define  TSI0_DATA_TSICNT_MASK       0x10u
#define  TSI0_DATA_TSICNT_SHIFT      0
#define  TSI0_DATA_TSICNT(x)         (((uint32_t)(((uint32_t)(x))<<TSI0_DATA_TSICNT_SHIFT))&TSI0_DATA_TSICNT_MASK)
//   TSI Conversion Counter Value

#define  TSI0_DATA_SWTS_MASK         0x400000u
#define  TSI0_DATA_SWTS_SHIFT        22
//   Software Trigger Start
//     0b0 ==> No effect.
//     0b1 ==> Start a scan to determine which channel is specified by TSI_DATA[TSICH].

#define  TSI0_DATA_DMAEN_MASK        0x800000u
#define  TSI0_DATA_DMAEN_SHIFT       23
//   DMA Transfer Enabled
//     0b0 ==> Interrupt is selected when the interrupt enable bit is set and the corresponding TSI events assert.
//     0b1 ==> DMA transfer request is selected when the interrupt enable bit is set and the corresponding TSI events assert.

#define  TSI0_DATA_TSICH_MASK        0x40000000u
#define  TSI0_DATA_TSICH_SHIFT       28
#define  TSI0_DATA_TSICH(x)          (((uint32_t)(((uint32_t)(x))<<TSI0_DATA_TSICH_SHIFT))&TSI0_DATA_TSICH_MASK)
//   TSICH
//     0b0000 ==> Channel 0.
//     0b0001 ==> Channel 1.
//     0b0010 ==> Channel 2.
//     0b0011 ==> Channel 3.
//     0b0100 ==> Channel 4.
//     0b0101 ==> Channel 5.
//     0b0110 ==> Channel 6.
//     0b0111 ==> Channel 7.
//     0b1000 ==> Channel 8.
//     0b1001 ==> Channel 9.
//     0b1010 ==> Channel 10.
//     0b1011 ==> Channel 11.
//     0b1100 ==> Channel 12.
//     0b1101 ==> Channel 13.
//     0b1110 ==> Channel 14.
//     0b1111 ==> Channel 15.

#define  TSI0_TSHD_THRESL_MASK       0x10u
#define  TSI0_TSHD_THRESL_SHIFT      0
#define  TSI0_TSHD_THRESL(x)         (((uint32_t)(((uint32_t)(x))<<TSI0_TSHD_THRESL_SHIFT))&TSI0_TSHD_THRESL_MASK)
//   TSI Wakeup Channel Low-threshold

#define  TSI0_TSHD_THRESH_MASK       0x100000u
#define  TSI0_TSHD_THRESH_SHIFT      16
#define  TSI0_TSHD_THRESH(x)         (((uint32_t)(((uint32_t)(x))<<TSI0_TSHD_THRESH_SHIFT))&TSI0_TSHD_THRESH_MASK)
//   TSI Wakeup Channel High-threshold


//////////////////////////////////////////////////////////////////////////////////////
// Backward compatibility.

// No backward compatibility issues.
